-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 opened on:  12 Feb 2021, 16:50:35

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 12 Feb 2021)

. 
. noi di "SUBSETTING ON COX CENSORED POPULATION"
SUBSETTING ON COX CENSORED POPULATION

. keep if cox_pop==1
(2,385 observations deleted)

. 
. tab sgtf cox_death, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Exposure: |
      0=VOC; |    Outcome for Cox
   1=non-VOC |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    71,365      1,394 |    72,759 
             |     98.08       1.92 |    100.00 
-------------+----------------------+----------
         VOC |    71,178      1,419 |    72,597 
             |     98.05       1.95 |    100.00 
-------------+----------------------+----------
       Total |   142,543      2,813 |   145,356 
             |     98.06       1.94 |    100.00 

. 
. 
. *******************
. /* Unadjusted HR */
. *******************
. 
. stset stime_death, origin(study_start) fail(cox_death) scale(1) id(patient_id
> )

                id:  patient_id
     failure event:  cox_death != 0 & cox_death < .
obs. time interval:  (stime_death[_n-1], stime_death]
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time study_start

------------------------------------------------------------------------------
    145,356  total observations
          0  exclusions
------------------------------------------------------------------------------
    145,356  observations remaining, representing
    145,356  subjects
      2,813  failures in single-failure-per-subject data
  4,911,398  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        59

. 
. stcox i.sgtf

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -32354.508
Iteration 1:   log likelihood = -32354.263
Refining estimates:
Iteration 0:   log likelihood = -32354.263

Cox regression -- Breslow method for ties

No. of subjects =      145,356                  Number of obs    =     145,356
No. of failures =        2,813
Time at risk    =      4911398
                                                LR chi2(1)       =        0.49
Log likelihood  =   -32354.263                  Prob > chi2      =      0.4843

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.026724   .0387185     0.70   0.484     .9535735    1.105485
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -25877.509
Iteration 1:   log likelihood = -25877.267
Refining estimates:
Iteration 0:   log likelihood = -25877.267

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      145,356                  Number of obs    =     145,356
No. of failures =        2,813
Time at risk    =      4911398
                                                LR chi2(1)       =        0.49
Log likelihood  =   -25877.267                  Prob > chi2      =      0.4859

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.026628   .0387171     0.70   0.486     .9534804    1.105387
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. * Plot scaled schoenfeld residuals
. estat phtest, plot(1.sgtf)

. graph export ./output/unadj_cox_shoen.svg, as(svg) replace
(note: file ./output/unadj_cox_shoen.svg not found)
(file ./output/unadj_cox_shoen.svg written in SVG format)

. 
. * KM plot
. sts graph,      surv by(sgtf) ///
>                         ylabel(0.8(0.05)1) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_km.svg, as(svg) replace
(note: file ./output/unadj_cox_km.svg not found)
(file ./output/unadj_cox_km.svg written in SVG format)

.                 
. * Smoothed hazard plot
. sts graph,      haz by(sgtf) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_haz.svg, as(svg) replace
(note: file ./output/unadj_cox_haz.svg not found)
(file ./output/unadj_cox_haz.svg written in SVG format)

. 
. * Interaction with time
. stcox i.sgtf, tvc(i.sgtf) strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -25877.509
Iteration 1:   log likelihood = -25877.198
Refining estimates:
Iteration 0:   log likelihood = -25877.198

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      145,356                  Number of obs    =     145,356
No. of failures =        2,813
Time at risk    =      4911398
                                                LR chi2(2)       =        0.62
Log likelihood  =   -25877.198                  Prob > chi2      =      0.7325

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
main         |
        sgtf |
        VOC  |   1.005494    .068042     0.08   0.935     .8805997    1.148102
-------------+----------------------------------------------------------------
tvc          |
        sgtf |
        VOC  |   1.001001   .0027062     0.37   0.711     .9957113    1.006319
------------------------------------------------------------------------------
                                                             Stratified by stp
Note: Variables in tvc equation interacted with _t.

. 
. 
. *********************************************************************
. /* Demographically adjusted HR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.male ib1.imd ib1.eth5 household_size ///
>                          ib1.rural_urban5 ib1.start_week age1 age2 age3, stra
> ta(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -19087.543
Iteration 1:   log likelihood = -19075.859
Iteration 2:   log likelihood = -19075.842
Iteration 3:   log likelihood = -19075.842
Refining estimates:
Iteration 0:   log likelihood = -19075.842

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      108,912                  Number of obs    =     108,912
No. of failures =        2,143
Time at risk    =      3681085
                                                LR chi2(24)      =       23.40
Log likelihood  =   -19075.842                  Prob > chi2      =      0.4962

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9838474   .0425181    -0.38   0.706     .9039452    1.070812
             |
        male |
          M  |   .9988803   .0431678    -0.03   0.979     .9177572    1.087174
             |
         imd |
          2  |   1.052502   .0654021     0.82   0.410     .9318144     1.18882
          3  |   .9718053   .0618593    -0.45   0.653     .8578213    1.100935
          4  |   .9987498   .0629239    -0.02   0.984     .8827317    1.130016
5 most de..  |   1.172316    .088024     2.12   0.034     1.011886    1.358181
             |
        eth5 |
South Asian  |   .9986166    .099733    -0.01   0.989     .8210852    1.214533
      Black  |      .9598   .0967075    -0.41   0.684      .787799    1.169354
      Mixed  |   1.040346   .1025663     0.40   0.688     .8575495    1.262109
      Other  |   1.055075   .0757312     0.75   0.455     .9166121    1.214453
             |
household_~e |   1.029284     .02144     1.39   0.166     .9881088    1.072175
             |
rural_urban5 |
Urban min..  |   .8540973   .0840653    -1.60   0.109     .7042503    1.035828
Urban cit..  |   .9635526   .0797347    -0.45   0.654     .8192903    1.133217
Rural tow..  |   1.006153   .0825287     0.07   0.940     .8567325    1.181634
Rural vil..  |   .9524466   .0717893    -0.65   0.518     .8216419    1.104075
             |
  start_week |
23Nov-29Nov  |   1.116319    .075675     1.62   0.105     .9774298    1.274944
30Nov-06Dec  |   1.135906   .0815139     1.78   0.076     .9868687    1.307452
07Dec-13Dec  |   1.111006   .0859944     1.36   0.174      .954622    1.293008
14Dec-20Dec  |   1.061004   .0901082     0.70   0.486     .8983108    1.253162
21Dec-27Dec  |   .9235675    .092564    -0.79   0.428     .7588526    1.124035
28Dec-04Jan  |   1.016163   .1121429     0.15   0.884     .8185132    1.261541
             |
        age1 |   .9964303   .0044403    -0.80   0.422     .9877653    1.005171
        age2 |   1.005509   .0146427     0.38   0.706     .9772157    1.034622
        age3 |   .9939752   .0409055    -0.15   0.883     .9169501    1.077471
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
.                          
.                          
. *********************************************************************
. /* Demographically adjusted HR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.male ib1.imd ib1.eth5 ib1.hh_total_cat ///
>                          ib1.rural_urban5 ib1.start_week i.agegroup, strata(s
> tp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -18728.719
Iteration 1:   log likelihood = -18714.372
Iteration 2:   log likelihood = -18714.337
Iteration 3:   log likelihood = -18714.337
Refining estimates:
Iteration 0:   log likelihood = -18714.337

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      106,493                  Number of obs    =     106,493
No. of failures =        2,108
Time at risk    =      3598885
                                                LR chi2(29)      =       28.76
Log likelihood  =   -18714.337                  Prob > chi2      =      0.4774

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9837394   .0428655    -0.38   0.707     .9032122    1.071446
             |
        male |
          M  |   1.002193   .0436683     0.05   0.960     .9201574    1.091542
             |
         imd |
          2  |   1.053099   .0660563     0.82   0.409     .9312734    1.190862
          3  |   .9751828    .062592    -0.39   0.695     .8599075    1.105911
          4  |   1.003054   .0637171     0.05   0.962     .8856317    1.136044
5 most de..  |   1.178699   .0891379     2.17   0.030     1.016323    1.367018
             |
        eth5 |
South Asian  |   1.006997   .1010748     0.07   0.945     .8271631     1.22593
      Black  |   .9682622   .0980588    -0.32   0.750     .7939429    1.180855
      Mixed  |   1.039194   .1033993     0.39   0.699     .8550715    1.262963
      Other  |   1.055402    .076294     0.75   0.456     .9159789    1.216047
             |
hh_total_cat |
        3-5  |   1.072476   .0468607     1.60   0.109      .984454    1.168369
       6-10  |   1.500811   .7521802     0.81   0.418     .5619771    4.008052
             |
rural_urban5 |
Urban min..  |   .8505389   .0841295    -1.64   0.102     .7006469    1.032498
Urban cit..  |   .9488313   .0790743    -0.63   0.529      .805844     1.11719
Rural tow..  |   .9913763   .0818104    -0.10   0.916     .8433264    1.165417
Rural vil..  |   .9455222   .0716422    -0.74   0.460     .8150349      1.0969
             |
  start_week |
23Nov-29Nov  |   1.115935   .0762216     1.61   0.108     .9761115    1.275788
30Nov-06Dec  |   1.132521   .0818945     1.72   0.085     .9828659    1.304962
07Dec-13Dec  |   1.089751   .0854015     1.10   0.273     .9345886    1.270674
14Dec-20Dec  |   1.066977   .0911604     0.76   0.448     .9024648    1.261479
21Dec-27Dec  |    .933814   .0940728    -0.68   0.497     .7664961    1.137655
28Dec-04Jan  |   1.012395   .1126991     0.11   0.912     .8139442     1.25923
             |
    agegroup |
     18-<30  |   .9208771   .0678286    -1.12   0.263     .7970859    1.063894
     30-<40  |   .9871824   .0740684    -0.17   0.863     .8521807    1.143571
     40-<50  |   .9447429   .0729357    -0.74   0.462     .8120812    1.099076
     50-<60  |   .8864239   .0684333    -1.56   0.118     .7619516     1.03123
     60-<70  |   1.092052   .0852602     1.13   0.259     .9371026    1.272622
     70-<80  |    .923749   .0833755    -0.88   0.380     .7739741    1.102507
        80+  |   .9680778   .1054595    -0.30   0.766      .781957    1.198499
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. 
.                          
. ***********************************************************
. /* Fully adjusted HR - age as spline, continuous hh size */
. ***********************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.obese4cat household
> _size ///
>                          ib1.rural_urban5 ib0.comorb_cat ib1.start_week age1 
> age2 age3, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -19087.543
Iteration 1:   log likelihood = -19073.758
Iteration 2:   log likelihood =  -19073.74
Iteration 3:   log likelihood =  -19073.74
Refining estimates:
Iteration 0:   log likelihood =  -19073.74

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      108,912                  Number of obs    =     108,912
No. of failures =        2,143
Time at risk    =      3681085
                                                LR chi2(31)      =       27.61
Log likelihood  =    -19073.74                  Prob > chi2      =      0.6414

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    .983479   .0425048    -0.39   0.700     .9036019    1.070417
             |
        male |
          M  |   .9993552   .0431907    -0.01   0.988     .9181893    1.087696
             |
         imd |
          2  |   1.051712    .065359     0.81   0.417     .9311045    1.187941
          3  |   .9713678    .061834    -0.46   0.648     .8574308    1.100445
          4  |   .9983011   .0628976    -0.03   0.978     .8823317    1.129513
5 most de..  |   1.172481   .0880383     2.12   0.034     1.012026    1.358377
             |
        eth5 |
South Asian  |   .9997173   .0998494    -0.00   0.998     .8219799    1.215887
      Black  |   .9601362   .0967451    -0.40   0.686     .7880689    1.169773
      Mixed  |   1.041849     .10272     0.42   0.678     .8587796    1.263945
      Other  |   1.055389   .0757557     0.75   0.453     .9168822     1.21482
             |
smoke_nomiss |
     Former  |   1.054343   .1591122     0.35   0.726     .7843793    1.417222
    Current  |   .9550277   .0647099    -0.68   0.497     .8362595    1.090664
             |
   obese4cat |
Obese I ..)  |   .9524351   .0580927    -0.80   0.424     .8451179     1.07338
Obese II..)  |   .9289601   .0570723    -1.20   0.230     .8235727    1.047833
Obese II..)  |   .9626753   .0542608    -0.67   0.500       .86199    1.075121
             |
household_~e |   1.029392   .0214421     1.39   0.164     .9882123    1.072287
             |
rural_urban5 |
Urban min..  |   .8537846   .0840371    -1.61   0.108     .7039885    1.035455
Urban cit..  |   .9632213   .0797095    -0.45   0.651     .8190051    1.132832
Rural tow..  |   1.005575   .0824859     0.07   0.946     .8562321    1.180966
Rural vil..  |   .9518108   .0717436    -0.66   0.512     .8210895    1.103343
             |
  comorb_cat |
1 comorbi..  |   .9859021   .0974267    -0.14   0.886     .8123032    1.196601
2+ comorb..  |    1.05764   .0948549     0.62   0.532     .8871507    1.260893
             |
  start_week |
23Nov-29Nov  |   1.116102   .0756644     1.62   0.105     .9772322    1.274705
30Nov-06Dec  |    1.13622   .0815383     1.78   0.075     .9871378    1.307817
07Dec-13Dec  |   1.111062   .0860025     1.36   0.174     .9546643    1.293083
14Dec-20Dec  |   1.061689   .0901719     0.70   0.481     .8988823    1.253984
21Dec-27Dec  |   .9236759   .0925781    -0.79   0.428     .7589366    1.124175
28Dec-04Jan  |   1.016363   .1121671     0.15   0.883     .8186701    1.261794
             |
        age1 |    .996441   .0044405    -0.80   0.424     .9877756    1.005182
        age2 |   1.005451   .0146433     0.37   0.709     .9771567    1.034565
        age3 |   .9940752   .0409143    -0.14   0.885     .9170338    1.077589
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. 
. 
. **************************************************
. /* Fully adjusted HR - age grouped, cat hh size */
. **************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.agegroup i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.obese4ca
> t ///
>                          ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1
> .start_week, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -18728.719
Iteration 1:   log likelihood = -18712.253
Iteration 2:   log likelihood = -18712.217
Iteration 3:   log likelihood = -18712.217
Refining estimates:
Iteration 0:   log likelihood = -18712.217

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      106,493                  Number of obs    =     106,493
No. of failures =        2,108
Time at risk    =      3598885
                                                LR chi2(36)      =       33.00
Log likelihood  =   -18712.217                  Prob > chi2      =      0.6119

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9833761   .0428523    -0.38   0.700     .9028739    1.071056
             |
    agegroup |
     18-<30  |   .9209186   .0678335    -1.12   0.263     .7971188    1.063946
     30-<40  |   .9870493   .0740606    -0.17   0.862      .852062    1.143422
     40-<50  |   .9438282   .0728672    -0.75   0.454     .8112915    1.098017
     50-<60  |   .8865662    .068446    -1.56   0.119      .762071    1.031399
     60-<70  |   1.091372   .0852112     1.12   0.263     .9365117    1.271839
     70-<80  |   .9230637   .0833154    -0.89   0.375      .773397    1.101694
        80+  |   .9656605   .1052061    -0.32   0.748     .7799888     1.19553
             |
        male |
          M  |   1.002555   .0436861     0.06   0.953     .9204864    1.091941
             |
         imd |
          2  |   1.052208   .0660059     0.81   0.417     .9304754    1.189866
          3  |   .9746413   .0625596    -0.40   0.689     .8594259    1.105302
          4  |   1.002584   .0636894     0.04   0.968      .885213    1.135516
5 most de..  |   1.178998   .0891627     2.18   0.029     1.016577     1.36737
             |
        eth5 |
South Asian  |   1.008114   .1011933     0.08   0.936     .8280703    1.227305
      Black  |   .9683703   .0980736    -0.32   0.751     .7940254    1.180996
      Mixed  |   1.040787    .103564     0.40   0.688     .8563723    1.264914
      Other  |   1.055788   .0763238     0.75   0.453     .9163109    1.216497
             |
smoke_nomiss |
     Former  |   1.023979   .1580282     0.15   0.878     .7567059    1.385654
    Current  |   .9731338   .0660075    -0.40   0.688     .8519924      1.1115
             |
   obese4cat |
Obese I ..)  |   .9387012    .057887    -1.03   0.305     .8318332    1.059299
Obese II..)  |   .9302506   .0574096    -1.17   0.241     .8242687    1.049859
Obese II..)  |    .947814   .0539689    -0.94   0.347     .8477257    1.059719
             |
hh_total_cat |
        3-5  |   1.073182    .046894     1.62   0.106     .9850976    1.169143
       6-10  |   1.504354   .7539717     0.81   0.415     .5632921    4.017596
             |
rural_urban5 |
Urban min..  |   .8502291   .0841009    -1.64   0.101     .7003884    1.032127
Urban cit..  |   .9487709   .0790712    -0.63   0.528     .8057896    1.117123
Rural tow..  |   .9910726   .0817901    -0.11   0.913       .84306    1.165071
Rural vil..  |   .9451096   .0716132    -0.75   0.456     .8146755    1.096427
             |
  comorb_cat |
1 comorbi..  |   .9823523   .0978558    -0.18   0.858     .8081201    1.194149
2+ comorb..  |   1.056776   .0954959     0.61   0.541     .8852457    1.261543
             |
  start_week |
23Nov-29Nov  |   1.116014   .0762312     1.61   0.108     .9761737    1.275888
30Nov-06Dec  |    1.13292   .0819252     1.73   0.084       .98321    1.305427
07Dec-13Dec  |   1.090007   .0854246     1.10   0.271     .9348031     1.27098
14Dec-20Dec  |   1.067842   .0912399     0.77   0.442     .9031867    1.262515
21Dec-27Dec  |   .9340976   .0941047    -0.68   0.499     .7667236    1.138009
28Dec-04Jan  |   1.012836   .1127502     0.11   0.909     .8142963    1.259784
------------------------------------------------------------------------------
                                                             Stratified by stp

.                          
.                          
.                          
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -32354.508
Iteration 1:   log likelihood = -32347.991
Iteration 2:   log likelihood = -32347.985
Refining estimates:
Iteration 0:   log likelihood = -32347.985

Cox regression -- Breslow method for ties

No. of subjects =      145,356                  Number of obs    =     145,356
No. of failures =        2,813
Time at risk    =      4911398
                                                LR chi2(12)      =       13.04
Log likelihood  =   -32347.985                  Prob > chi2      =      0.3658

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.026223   .0387011     0.69   0.492     .9531055    1.104949
             |
  comorb_cat |
1 comorbi..  |    .960784   .0829111    -0.46   0.643     .8112806    1.137838
2+ comorb..  |   1.058388   .0826479     0.73   0.467     .9081882    1.233428
             |
         imd |
          2  |   1.049513   .0568028     0.89   0.372     .9438835    1.166964
          3  |   .9993497   .0548029    -0.01   0.991     .8975089    1.112746
          4  |   .9675386   .0534986    -0.60   0.551     .8681652    1.078287
5 most de..  |   1.120439   .0746457     1.71   0.088     .9832855    1.276724
             |
smoke_nomiss |
     Former  |   1.017751   .1363894     0.13   0.896     .7826568    1.323462
    Current  |   .9981337   .0579652    -0.03   0.974     .8907512    1.118461
             |
        age1 |   .9984163   .0038988    -0.41   0.685      .990804    1.006087
        age2 |   .9989415   .0127016    -0.08   0.934     .9743545    1.024149
        age3 |   1.013232    .036349     0.37   0.714     .9444367     1.08704
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -25877.509
Iteration 1:   log likelihood = -25871.028
Iteration 2:   log likelihood = -25871.023
Refining estimates:
Iteration 0:   log likelihood = -25871.023

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      145,356                  Number of obs    =     145,356
No. of failures =        2,813
Time at risk    =      4911398
                                                LR chi2(12)      =       12.97
Log likelihood  =   -25871.023                  Prob > chi2      =      0.3710

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.026088   .0386982     0.68   0.495     .9529761    1.104808
             |
  comorb_cat |
1 comorbi..  |   .9593682   .0827917    -0.48   0.631     .8100806    1.136168
2+ comorb..  |   1.056982   .0825409     0.71   0.478     .9069767    1.231796
             |
         imd |
          2  |   1.049718   .0568162     0.90   0.370     .9440632    1.167197
          3  |   1.000293   .0548574     0.01   0.996     .8983513    1.113803
          4  |   .9681889    .053536    -0.58   0.559     .8687461    1.079015
5 most de..  |   1.120583   .0746583     1.71   0.087     .9834062    1.276894
             |
smoke_nomiss |
     Former  |   1.017942   .1364271     0.13   0.894      .782786    1.323742
    Current  |   .9983615   .0579833    -0.03   0.977      .890946    1.118727
             |
        age1 |   .9984654   .0038996    -0.39   0.694     .9908515    1.006138
        age2 |   .9988369   .0127023    -0.09   0.927     .9742486    1.024046
        age3 |   1.013475   .0363642     0.37   0.709     .9446511    1.087314
------------------------------------------------------------------------------
                                                             Stratified by stp

.                          
. 
.                          
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 closed on:  12 Feb 2021, 16:55:34
-------------------------------------------------------------------------------
