-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 opened on:  19 Feb 2021, 14:33:14

. 
. clear

. 
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 19 Feb 2021)

. 
. 
. 
. *****************************************************************************
> ***
. *       PROGRAMS TO AUTOMATE TABULATIONS
. *
. *****************************************************************************
> ***
. * All below code from K Baskharan 
. * Generic code to output one row of table
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)
  4.         
.         sum `variable' if `variable' `condition'
  5.         **K Wing additional code to aoutput variable category labels**
.         local level=substr("`condition'",3,.)
  6.         local lab: label `variable'Lab `level'
  7.         file write tablecontent (" `lab'") _tab
  8.         
.         /*this is the overall column*/
.         cou if `variable' `condition'
  9.         local rowdenom = r(N)
 10.         local colpct = 100*(r(N)/`overalldenom')
 11.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
 12. 
.         /*this loops through groups*/
.         forvalues i=0/1{
 13.         cou if sgtf == `i'
 14.         local rowdenom = r(N)
 15.         cou if sgtf == `i' & `variable' `condition'
 16.         local pct = 100*(r(N)/`rowdenom') 
 17.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 18.         }
 19.         
.         file write tablecontent _n
 20. end

. 
. 
. * Output one row of table for co-morbidities and meds
. * This puts it all on the same row, is rohini's edit
. 
. cap prog drop generaterow2 

. program define generaterow2
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)5
  4.         
.         cou if `variable' `condition'
  5.         local rowdenom = r(N)
  6.         local colpct = 100*(r(N)/`overalldenom')
  7.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
  8. 
.         forvalues i=0/1{
  9.         cou if sgtf == `i'
 10.         local rowdenom = r(N)
 11.         cou if sgtf == `i' & `variable' `condition'
 12.         local pct = 100*(r(N)/`rowdenom') 
 13.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 14.         }
 15.         
.         file write tablecontent _n
 16. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines a program (SAS macro/R function equivalent), generate row
> the syntax row specifies two inputs for the program: 
>         a VARNAME which is your variable 
>         a CONDITION which is a string of some condition you impose 
>         
> the program counts if variable and condition and returns the counts
> column percentages are then automatically generated
> this is then written to the text file 'tablecontent' 
> the number followed by space, brackets, formatted pct, end bracket and then t
> ab
> the format %3.1f specifies length of 3, followed by 1 dp. 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to output one section (varible) within table (calls above)
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) min(real) max(real) [missing]
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
.         forvalues varlevel = `min'/`max'{ 
  5.                 generaterow, variable(`variable') condition("==`varlevel'"
> )
  6.         }
  7.         
.         if "`missing'"!="" generaterow, variable(`variable') condition("== 12
> ")
  8.         
. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines program tabulate variable 
> syntax is : 
>         - a VARNAME which you stick in variable 
>         - a numeric minimum 
>         - a numeric maximum 
>         - optional missing option, default value is . 
> forvalues lowest to highest of the variable, manually set for each var
> run the generate row program for the level of the variable 
> if there is a missing specified, then run the generate row for missing vals
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to qui summarize a continous variable 
. 
. cap prog drop summarizevariable 

. prog define summarizevariable
  1. syntax, variable(varname) 
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
. 
.         qui summarize `variable', d
  5.         file write tablecontent ("Mean (SD)") _tab 
  6.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
  7.         
.         forvalues i=0/1{                                                     
>    
  8.         qui summarize `variable' if sgtf == `i', d
  9.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
 10.         }
 11. 
. file write tablecontent _n
 12. 
.         
.         qui summarize `variable', d
 13.         file write tablecontent ("Median (IQR)") _tab 
 14.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 15.         
.         forvalues i=0/1{
 16.         qui summarize `variable' if sgtf == `i', d
 17.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 18.         }
 19.         
. file write tablecontent _n
 20.         
. end

. 
. 
. 
. *****************************************************************************
> ***
. * INVOKE PROGRAMS FOR TABLE 1 
. *
. *****************************************************************************
> ***
. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,035 observations deleted)

. 
. noi di "SUBSETTING ON COX POPULATION"
SUBSETTING ON COX POPULATION

. keep if cox_pop==1
(2,299 observations deleted)

. 
. 
. *Set up output file
. cap file close tablecontent

. 
. file open tablecontent using ./output/table1_cox.txt, write text replace
(note: file ./output/table1_cox.txt not found)

. 
. file write tablecontent ("Table 1: Demographic and Clinical Characteristics")
>  _n

. 
. file write tablecontent _tab ("Total")          _tab ///
>                                                          ("non-VOC")    _tab 
> ///
>                                                          ("VOC")             
>    _n

.                                                          
. 
. 
. * DEMOGRAPHICS (more than one level, potentially missing) 
. 
. /*reminder of variables:
> patient_id age ageCat hh_id hh_size hh_composition case_date case eth5 eth16 
> ethnicity_16 indexdate sex bmicat smoke imd region comorb_Neuro comorb_Immuno
> suppression shielding chronic_respiratory_disease chronic_cardiac_disease dia
> betes chronic_liver_disease cancer egfr_cat hypertension smoke_nomiss rural_u
> rban
> */
. 
. *DIED
. tabulatevariable, variable(cox_death) min(0) max(1) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |    142,877           0           0          0          0
  142,877
  73,088
  71,295
  73,422
  71,582
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |      3,633           1           0          1          1
  3,633
  73,088
  1,793
  73,422
  1,840

. file write tablecontent _n

. 
. *TIME TO DEATH
. summarizevariable, variable(cox_time_d) 

. file write tablecontent _n

. 
. *FOLLOW-UP TIME
. summarizevariable, variable(cox_time) 

. file write tablecontent _n

. 
. *EPI WEEK
. tabulatevariable, variable(start_week) min(1) max(7) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     20,988           1           0          1          1
  20,988
  73,088
  10,339
  73,422
  10,649
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     23,278           2           0          2          2
  23,278
  73,088
  11,602
  73,422
  11,676
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     22,316           3           0          3          3
  22,316
  73,088
  11,006
  73,422
  11,310
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     21,122           4           0          4          4
  21,122
  73,088
  10,654
  73,422
  10,468
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     19,909           5           0          5          5
  19,909
  73,088
  9,981
  73,422
  9,928
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     18,702           6           0          6          6
  18,702
  73,088
  9,296
  73,422
  9,406
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     20,195           7           0          7          7
  20,195
  73,088
  10,210
  73,422
  9,985

. file write tablecontent _n 

. 
. *SEX
. tabulatevariable, variable(male) min(0) max(1) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     74,790           0           0          0          0
  74,790
  73,088
  37,386
  73,422
  37,404
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     71,720           1           0          1          1
  71,720
  73,088
  35,702
  73,422
  36,018

. file write tablecontent _n 

. 
. *AGE
. summarizevariable, variable(age) 

. file write tablecontent _n

. 
. tabulatevariable, variable(agegroup) min(1) max(7) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     22,648           1           0          1          1
  22,648
  73,088
  11,298
  73,422
  11,350
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     19,367           2           0          2          2
  19,367
  73,088
  9,635
  73,422
  9,732
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     18,685           3           0          3          3
  18,685
  73,088
  9,289
  73,422
  9,396
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     19,734           4           0          4          4
  19,734
  73,088
  9,895
  73,422
  9,839
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     15,473           5           0          5          5
  15,473
  73,088
  7,705
  73,422
  7,768
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     12,100           6           0          6          6
  12,100
  73,088
  5,953
  73,422
  6,147
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      7,229           7           0          7          7
  7,229
  73,088
  3,628
  73,422
  3,601

. file write tablecontent _n 

. 
. *ETHNICITY
. tabulatevariable, variable(eth5) min(1) max(6) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     82,237           1           0          1          1
  82,237
  73,088
  40,983
  73,422
  41,254
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,469           2           0          2          2
  5,469
  73,088
  2,766
  73,422
  2,703
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,501           3           0          3          3
  5,501
  73,088
  2,634
  73,422
  2,867
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,574           4           0          4          4
  5,574
  73,088
  2,782
  73,422
  2,792
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     10,932           5           0          5          5
  10,932
  73,088
  5,437
  73,422
  5,495
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     36,797           6           0          6          6
  36,797
  73,088
  18,486
  73,422
  18,311

. file write tablecontent _n 

. 
. *BMI
. tabulatevariable, variable(obese4cat) min(1) max(4) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     59,811           1           0          1          1
  59,811
  73,088
  29,830
  73,422
  29,981
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     26,470           2           0          2          2
  26,470
  73,088
  13,291
  73,422
  13,179
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     26,624           3           0          3          3
  26,624
  73,088
  13,413
  73,422
  13,211
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     33,605           4           0          4          4
  33,605
  73,088
  16,554
  73,422
  17,051

. file write tablecontent _n 

. 
. *SMOKING
. tabulatevariable, variable(smoke_nomiss) min(1) max(3) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |    125,984           1           0          1          1
  125,984
  73,088
  62,819
  73,422
  63,165
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |      2,925           2           0          2          2
  2,925
  73,088
  1,473
  73,422
  1,452
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     17,601           3           0          3          3
  17,601
  73,088
  8,796
  73,422
  8,805

. file write tablecontent _n

. 
. *COMORBIDITIES (3 CATEGORIES)
. tabulatevariable, variable(comorb_cat) min(0) max(2) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |      9,409           0           0          0          0
  9,409
  73,088
  4,642
  73,422
  4,767
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     31,147           1           0          1          1
  31,147
  73,088
  15,629
  73,422
  15,518
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |    105,954           2           0          2          2
  105,954
  73,088
  52,817
  73,422
  53,137

. file write tablecontent _n

. 
. *IMD
. tabulatevariable, variable(imd) min(1) max(5) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     43,879           1           0          1          1
  43,879
  73,088
  21,758
  73,422
  22,121
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,088           2           0          2          2
  29,088
  73,088
  14,610
  73,422
  14,478
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,499           3           0          3          3
  29,499
  73,088
  14,712
  73,422
  14,787
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,354           4           0          4          4
  29,354
  73,088
  14,603
  73,422
  14,751
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     14,690           5           0          5          5
  14,690
  73,088
  7,405
  73,422
  7,285

. file write tablecontent _n 

. 
. *HOUSEHOLD SIZE
. tabulatevariable, variable(hh_total_cat) min(1) max(4) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     69,926           1           0          1          1
  69,926
  73,088
  34,804
  73,422
  35,122
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     73,032           2           0          2          2
  73,032
  73,088
  36,503
  73,422
  36,529
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |        192           3           0          3          3
  192
  73,088
  102
  73,422
  90
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |          0
  0
  73,088
  0
  73,422
  0

. file write tablecontent _n 

. 
. *CARE HOME
. tabulatevariable, variable(home_bin) min(0) max(1) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    home_bin |    124,284           0           0          0          0
  124,284
  73,088
  62,019
  73,422
  62,265
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    home_bin |     22,226           1           0          1          1
  22,226
  73,088
  11,069
  73,422
  11,157

. file write tablecontent _n 

. 
. *REGION
. tabulatevariable, variable(region) min(0) max(8) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |          0
  0
  73,088
  0
  73,422
  0
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,586           1           0          1          1
  14,586
  73,088
  7,196
  73,422
  7,390
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     29,345           2           0          2          2
  29,345
  73,088
  14,648
  73,422
  14,697
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,633           3           0          3          3
  14,633
  73,088
  7,343
  73,422
  7,290
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,571           4           0          4          4
  14,571
  73,088
  7,260
  73,422
  7,311
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,736           5           0          5          5
  14,736
  73,088
  7,393
  73,422
  7,343
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,657           6           0          6          6
  14,657
  73,088
  7,211
  73,422
  7,446
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,524           7           0          7          7
  14,524
  73,088
  7,282
  73,422
  7,242
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,562           8           0          8          8
  14,562
  73,088
  7,314
  73,422
  7,248

. file write tablecontent _n 

. 
. *RURAL URBAN (five categories)
. tabulatevariable, variable(rural_urban5) min(1) max(5) 
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,767           1           0          1          1
  14,767
  73,088
  7,276
  73,422
  7,491
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,546           2           0          2          2
  14,546
  73,088
  7,335
  73,422
  7,211
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     29,253           3           0          3          3
  29,253
  73,088
  14,613
  73,422
  14,640
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     29,312           4           0          4          4
  29,312
  73,088
  14,614
  73,422
  14,698
  146,510

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     58,632           5           0          5          5
  58,632
  73,088
  29,250
  73,422
  29,382

. file write tablecontent _n 

. 
. 
. 
. file write tablecontent _n _n

. 
. 
. file close tablecontent

. 
. 
. 
. /* Histogram of time to death */
. 
. twoway (histogram cox_time_d if sgtf==0, color(red%30)) ///        
>        (histogram cox_time_d if sgtf==1, color(blue%30)), ///   
>        legend(order(1 "non-VOC" 2 "VOC" ))

. 
. graph export ./output/time_death_hist.svg, as(svg) replace
(note: file ./output/time_death_hist.svg not found)
(file ./output/time_death_hist.svg written in SVG format)

. 
. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 closed on:  19 Feb 2021, 14:33:21
-------------------------------------------------------------------------------
