-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 opened on:  25 Feb 2021, 08:47:57

. 
. clear

. 
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 25 Feb 2021)

. 
. 
. 
. *****************************************************************************
> ***
. *       PROGRAMS TO AUTOMATE TABULATIONS
. *
. *****************************************************************************
> ***
. * All below code from K Baskharan 
. * Generic code to output one row of table
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)
  4.         
.         sum `variable' if `variable' `condition'
  5.         **K Wing additional code to aoutput variable category labels**
.         local level=substr("`condition'",3,.)
  6.         local lab: label `variable'Lab `level'
  7.         file write tablecontent (" `lab'") _tab
  8.         
.         /*this is the overall column*/
.         cou if `variable' `condition'
  9.         local rowdenom = r(N)
 10.         local colpct = 100*(r(N)/`overalldenom')
 11.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
 12. 
.         /*this loops through groups*/
.         forvalues i=0/1{
 13.         cou if sgtf == `i'
 14.         local rowdenom = r(N)
 15.         cou if sgtf == `i' & `variable' `condition'
 16.         local pct = 100*(r(N)/`rowdenom') 
 17.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 18.         }
 19.         
.         file write tablecontent _n
 20. end

. 
. 
. * Output one row of table for co-morbidities and meds
. * This puts it all on the same row, is rohini's edit
. 
. cap prog drop generaterow2 

. program define generaterow2
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)5
  4.         
.         cou if `variable' `condition'
  5.         local rowdenom = r(N)
  6.         local colpct = 100*(r(N)/`overalldenom')
  7.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
  8. 
.         forvalues i=0/1{
  9.         cou if sgtf == `i'
 10.         local rowdenom = r(N)
 11.         cou if sgtf == `i' & `variable' `condition'
 12.         local pct = 100*(r(N)/`rowdenom') 
 13.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 14.         }
 15.         
.         file write tablecontent _n
 16. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines a program (SAS macro/R function equivalent), generate row
> the syntax row specifies two inputs for the program: 
>         a VARNAME which is your variable 
>         a CONDITION which is a string of some condition you impose 
>         
> the program counts if variable and condition and returns the counts
> column percentages are then automatically generated
> this is then written to the text file 'tablecontent' 
> the number followed by space, brackets, formatted pct, end bracket and then t
> ab
> the format %3.1f specifies length of 3, followed by 1 dp. 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to output one section (varible) within table (calls above)
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) min(real) max(real) [missing]
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
.         forvalues varlevel = `min'/`max'{ 
  5.                 generaterow, variable(`variable') condition("==`varlevel'"
> )
  6.         }
  7.         
.         if "`missing'"!="" generaterow, variable(`variable') condition("== 12
> ")
  8.         
. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines program tabulate variable 
> syntax is : 
>         - a VARNAME which you stick in variable 
>         - a numeric minimum 
>         - a numeric maximum 
>         - optional missing option, default value is . 
> forvalues lowest to highest of the variable, manually set for each var
> run the generate row program for the level of the variable 
> if there is a missing specified, then run the generate row for missing vals
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to qui summarize a continous variable 
. 
. cap prog drop summarizevariable 

. prog define summarizevariable
  1. syntax, variable(varname) 
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
. 
.         qui summarize `variable', d
  5.         file write tablecontent ("Mean (SD)") _tab 
  6.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
  7.         
.         forvalues i=0/1{                                                     
>    
  8.         qui summarize `variable' if sgtf == `i', d
  9.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
 10.         }
 11. 
. file write tablecontent _n
 12. 
.         
.         qui summarize `variable', d
 13.         file write tablecontent ("Median (IQR)") _tab 
 14.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 15.         
.         forvalues i=0/1{
 16.         qui summarize `variable' if sgtf == `i', d
 17.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 18.         }
 19.         
. file write tablecontent _n
 20.         
. end

. 
. 
. 
. *****************************************************************************
> ***
. * INVOKE PROGRAMS FOR TABLE 1 
. *
. *****************************************************************************
> ***
. 
. * DROP MISSING UTLA
. noi di "DROPPING MISSING UTLA DATA"
DROPPING MISSING UTLA DATA

. drop if utla_group==""
(37 observations deleted)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,027 observations deleted)

. 
. noi di "SUBSETTING ON COX POPULATION"
SUBSETTING ON COX POPULATION

. keep if cox_pop==1
(2,298 observations deleted)

. 
. 
. *Set up output file
. cap file close tablecontent

. 
. file open tablecontent using ./output/table1_cox.txt, write text replace
(note: file ./output/table1_cox.txt not found)

. 
. file write tablecontent ("Table 1: Demographic and Clinical Characteristics")
>  _n

. 
. file write tablecontent _tab ("Total")          _tab ///
>                                                          ("non-VOC")    _tab 
> ///
>                                                          ("VOC")             
>    _n

.                                                          
. 
. 
. * DEMOGRAPHICS (more than one level, potentially missing) 
. 
. /*reminder of variables:
> patient_id age ageCat hh_id hh_size hh_composition case_date case eth5 eth16 
> ethnicity_16 indexdate sex bmicat smoke imd region comorb_Neuro comorb_Immuno
> suppression shielding chronic_respiratory_disease chronic_cardiac_disease dia
> betes chronic_liver_disease cancer egfr_cat hypertension smoke_nomiss rural_u
> rban
> */
. 
. *N
. label define cox_popLab 1 "N"

. label values cox_pop cox_popLab

. tabulatevariable, variable(cox_pop) min(1) max(1) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     cox_pop |    146,482           1           0          1          1
  146,482
  73,073
  73,073
  73,409
  73,409

. file write tablecontent _n 

. 
. *DIED
. tabulatevariable, variable(cox_death) min(0) max(1) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |    142,419           0           0          0          0
  142,419
  73,073
  71,064
  73,409
  71,355
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |      4,063           1           0          1          1
  4,063
  73,073
  2,009
  73,409
  2,054

. file write tablecontent _n

. 
. *TIME TO DEATH
. summarizevariable, variable(cox_time_d) 

. file write tablecontent _n

. 
. *FOLLOW-UP TIME
. summarizevariable, variable(cox_time) 

. file write tablecontent _n

. 
. *EPI WEEK
. tabulatevariable, variable(start_week) min(1) max(8) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     20,983           1           0          1          1
  20,983
  73,073
  10,337
  73,409
  10,646
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     23,274           2           0          2          2
  23,274
  73,073
  11,600
  73,409
  11,674
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     22,312           3           0          3          3
  22,312
  73,073
  11,003
  73,409
  11,309
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     21,118           4           0          4          4
  21,118
  73,073
  10,652
  73,409
  10,466
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     19,906           5           0          5          5
  19,906
  73,073
  9,979
  73,409
  9,927
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     18,698           6           0          6          6
  18,698
  73,073
  9,294
  73,409
  9,404
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |     17,734           7           0          7          7
  17,734
  73,073
  8,958
  73,409
  8,776
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  start_week |      2,457           8           0          8          8
  2,457
  73,073
  1,250
  73,409
  1,207

. file write tablecontent _n 

. 
. *SEX
. tabulatevariable, variable(male) min(0) max(1) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     74,774           0           0          0          0
  74,774
  73,073
  37,376
  73,409
  37,398
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     71,708           1           0          1          1
  71,708
  73,073
  35,697
  73,409
  36,011

. file write tablecontent _n 

. 
. *AGE
. summarizevariable, variable(age) 

. file write tablecontent _n

. 
. tabulatevariable, variable(agegroup) min(1) max(7) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     22,644           1           0          1          1
  22,644
  73,073
  11,295
  73,409
  11,349
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     19,361           2           0          2          2
  19,361
  73,073
  9,632
  73,409
  9,729
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     18,682           3           0          3          3
  18,682
  73,073
  9,287
  73,409
  9,395
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     19,729           4           0          4          4
  19,729
  73,073
  9,894
  73,409
  9,835
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     15,469           5           0          5          5
  15,469
  73,073
  7,703
  73,409
  7,766
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     12,099           6           0          6          6
  12,099
  73,073
  5,953
  73,409
  6,146
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      7,229           7           0          7          7
  7,229
  73,073
  3,628
  73,409
  3,601

. file write tablecontent _n 

. 
. *ETHNICITY
. tabulatevariable, variable(eth5) min(1) max(6) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     82,226           1           0          1          1
  82,226
  73,073
  40,977
  73,409
  41,249
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,467           2           0          2          2
  5,467
  73,073
  2,765
  73,409
  2,702
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,498           3           0          3          3
  5,498
  73,073
  2,633
  73,409
  2,865
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,574           4           0          4          4
  5,574
  73,073
  2,782
  73,409
  2,792
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     10,928           5           0          5          5
  10,928
  73,073
  5,435
  73,409
  5,493
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     36,789           6           0          6          6
  36,789
  73,073
  18,481
  73,409
  18,308

. file write tablecontent _n 

. 
. *BMI
. tabulatevariable, variable(obese4cat) min(1) max(4) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     59,796           1           0          1          1
  59,796
  73,073
  29,821
  73,409
  29,975
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     26,462           2           0          2          2
  26,462
  73,073
  13,288
  73,409
  13,174
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     26,622           3           0          3          3
  26,622
  73,073
  13,412
  73,409
  13,210
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     33,602           4           0          4          4
  33,602
  73,073
  16,552
  73,409
  17,050

. file write tablecontent _n 

. 
. *SMOKING
. tabulatevariable, variable(smoke_nomiss) min(1) max(3) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |    125,961           1           0          1          1
  125,961
  73,073
  62,805
  73,409
  63,156
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |      2,923           2           0          2          2
  2,923
  73,073
  1,472
  73,409
  1,451
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     17,598           3           0          3          3
  17,598
  73,073
  8,796
  73,409
  8,802

. file write tablecontent _n

. 
. *COMORBIDITIES (3 CATEGORIES)
. tabulatevariable, variable(comorb_cat) min(0) max(2) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |      9,407           0           0          0          0
  9,407
  73,073
  4,641
  73,409
  4,766
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     31,141           1           0          1          1
  31,141
  73,073
  15,628
  73,409
  15,513
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |    105,934           2           0          2          2
  105,934
  73,073
  52,804
  73,409
  53,130

. file write tablecontent _n

. 
. *IMD
. tabulatevariable, variable(imd) min(1) max(5) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     43,869           1           0          1          1
  43,869
  73,073
  21,750
  73,409
  22,119
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,082           2           0          2          2
  29,082
  73,073
  14,608
  73,409
  14,474
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,493           3           0          3          3
  29,493
  73,073
  14,710
  73,409
  14,783
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,352           4           0          4          4
  29,352
  73,073
  14,603
  73,409
  14,749
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     14,686           5           0          5          5
  14,686
  73,073
  7,402
  73,409
  7,284

. file write tablecontent _n 

. 
. *HOUSEHOLD SIZE
. replace hh_total_cat = 5 if hh_total_cat==.
(3,360 real changes made)

. label define hh_total_catLab 5 "Missing", modify

. tabulatevariable, variable(hh_total_cat) min(1) max(5) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     69,913           1           0          1          1
  69,913
  73,073
  34,796
  73,409
  35,117
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     73,017           2           0          2          2
  73,017
  73,073
  36,496
  73,409
  36,521
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |        192           3           0          3          3
  192
  73,073
  102
  73,409
  90
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |          0
  0
  73,073
  0
  73,409
  0
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |      3,360           5           0          5          5
  3,360
  73,073
  1,679
  73,409
  1,681

. file write tablecontent _n 

. 
. *CARE HOME
. tabulatevariable, variable(home_bin) min(0) max(1) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    home_bin |    124,264           0           0          0          0
  124,264
  73,073
  62,009
  73,409
  62,255
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    home_bin |     22,218           1           0          1          1
  22,218
  73,073
  11,064
  73,409
  11,154

. file write tablecontent _n 

. 
. *REGION
. tabulatevariable, variable(region) min(0) max(8) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |          0
  0
  73,073
  0
  73,409
  0
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,584           1           0          1          1
  14,584
  73,073
  7,195
  73,409
  7,389
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     29,336           2           0          2          2
  29,336
  73,073
  14,643
  73,409
  14,693
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,631           3           0          3          3
  14,631
  73,073
  7,341
  73,409
  7,290
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,570           4           0          4          4
  14,570
  73,073
  7,259
  73,409
  7,311
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,735           5           0          5          5
  14,735
  73,073
  7,393
  73,409
  7,342
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,652           6           0          6          6
  14,652
  73,073
  7,209
  73,409
  7,443
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,523           7           0          7          7
  14,523
  73,073
  7,282
  73,409
  7,241
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,559           8           0          8          8
  14,559
  73,073
  7,311
  73,409
  7,248

. file write tablecontent _n 

. 
. *RURAL URBAN (five categories)
. replace rural_urban5 = 6 if rural_urban5==.
(0 real changes made)

. label define rural_urban5Lab 6 "Missing", modify

. tabulatevariable, variable(rural_urban5) min(1) max(6) 
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,763           1           0          1          1
  14,763
  73,073
  7,273
  73,409
  7,490
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,545           2           0          2          2
  14,545
  73,073
  7,335
  73,409
  7,210
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     29,244           3           0          3          3
  29,244
  73,073
  14,609
  73,409
  14,635
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     29,307           4           0          4          4
  29,307
  73,073
  14,611
  73,409
  14,696
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     58,623           5           0          5          5
  58,623
  73,073
  29,245
  73,409
  29,378
  146,482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |          0
  0
  73,073
  0
  73,409
  0

. file write tablecontent _n 

. 
. 
. 
. file write tablecontent _n _n

. 
. 
. file close tablecontent

. 
. 
. 
. /* Histogram of time to death */
. 
. twoway (histogram cox_time_d if sgtf==0, color(red%30)) ///        
>        (histogram cox_time_d if sgtf==1, color(blue%30)), ///   
>        legend(order(1 "non-VOC" 2 "VOC" ))

. 
. graph export ./output/time_death_hist.svg, as(svg) replace
(note: file ./output/time_death_hist.svg not found)
(file ./output/time_death_hist.svg written in SVG format)

. 
. /* Histogram of date of death */
. 
. twoway (histogram died_date_ons if sgtf==0, color(red%30)) ///        
>        (histogram died_date_ons if cox_death==1 & sgtf==0, color(blue%30)), /
> //   
>        legend(order(1 "non-VOC" 2 "VOC" ))

. 
. graph export ./output/time_date_death_hist.svg, as(svg) replace
(note: file ./output/time_date_death_hist.svg not found)
(file ./output/time_date_death_hist.svg written in SVG format)

. 
. twoway (histogram died_date_ons if sgtf==1, color(red%30)) ///        
>        (histogram died_date_ons if cox_death==1 & sgtf==1, color(blue%30)), /
> //   
>        legend(order(1 "non-VOC" 2 "VOC" ))

. 
. graph export ./output/time_date_death_hist1.svg, as(svg) replace
(note: file ./output/time_date_death_hist1.svg not found)
(file ./output/time_date_death_hist1.svg written in SVG format)

. 
. 
. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 closed on:  25 Feb 2021, 08:48:06
-------------------------------------------------------------------------------
