-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 opened on:  10 Feb 2021, 17:33:15

. 
. clear

. 
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 10 Feb 2021)

. 
. 
. 
. 
. *****************************************************************************
> ***
. *       PROGRAMS TO AUTOMATE TABULATIONS
. *
. *****************************************************************************
> ***
. * All below code from K Baskharan 
. * Generic code to output one row of table
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)
  4.         
.         sum `variable' if `variable' `condition'
  5.         **K Wing additional code to aoutput variable category labels**
.         local level=substr("`condition'",3,.)
  6.         local lab: label `variable'Lab `level'
  7.         file write tablecontent (" `lab'") _tab
  8.         
.         /*this is the overall column*/
.         cou if `variable' `condition'
  9.         local rowdenom = r(N)
 10.         local colpct = 100*(r(N)/`overalldenom')
 11.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
 12. 
.         /*this loops through groups*/
.         forvalues i=0/1{
 13.         cou if sgtf == `i'
 14.         local rowdenom = r(N)
 15.         cou if sgtf == `i' & `variable' `condition'
 16.         local pct = 100*(r(N)/`rowdenom') 
 17.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 18.         }
 19.         
.         file write tablecontent _n
 20. end

. 
. 
. * Output one row of table for co-morbidities and meds
. * This puts it all on the same row, is rohini's edit
. 
. cap prog drop generaterow2 

. program define generaterow2
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)5
  4.         
.         cou if `variable' `condition'
  5.         local rowdenom = r(N)
  6.         local colpct = 100*(r(N)/`overalldenom')
  7.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
  8. 
.         forvalues i=0/1{
  9.         cou if sgtf == `i'
 10.         local rowdenom = r(N)
 11.         cou if sgtf == `i' & `variable' `condition'
 12.         local pct = 100*(r(N)/`rowdenom') 
 13.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 14.         }
 15.         
.         file write tablecontent _n
 16. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines a program (SAS macro/R function equivalent), generate row
> the syntax row specifies two inputs for the program: 
>         a VARNAME which is your variable 
>         a CONDITION which is a string of some condition you impose 
>         
> the program counts if variable and condition and returns the counts
> column percentages are then automatically generated
> this is then written to the text file 'tablecontent' 
> the number followed by space, brackets, formatted pct, end bracket and then t
> ab
> the format %3.1f specifies length of 3, followed by 1 dp. 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to output one section (varible) within table (calls above)
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) min(real) max(real) [missing]
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
.         forvalues varlevel = `min'/`max'{ 
  5.                 generaterow, variable(`variable') condition("==`varlevel'"
> )
  6.         }
  7.         
.         if "`missing'"!="" generaterow, variable(`variable') condition("== 12
> ")
  8.         
. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines program tabulate variable 
> syntax is : 
>         - a VARNAME which you stick in variable 
>         - a numeric minimum 
>         - a numeric maximum 
>         - optional missing option, default value is . 
> forvalues lowest to highest of the variable, manually set for each var
> run the generate row program for the level of the variable 
> if there is a missing specified, then run the generate row for missing vals
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to qui summarize a continous variable 
. 
. cap prog drop summarizevariable 

. prog define summarizevariable
  1. syntax, variable(varname) 
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
. 
.         qui summarize `variable', d
  5.         file write tablecontent ("Mean (SD)") _tab 
  6.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
  7.         
.         forvalues i=0/1{                                                     
>    
  8.         qui summarize `variable' if sgtf == `i', d
  9.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
 10.         }
 11. 
. file write tablecontent _n
 12. 
.         
.         qui summarize `variable', d
 13.         file write tablecontent ("Median (IQR)") _tab 
 14.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 15.         
.         forvalues i=0/1{
 16.         qui summarize `variable' if sgtf == `i', d
 17.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 18.         }
 19.         
. file write tablecontent _n
 20.         
. end

. 
. 
. 
. *****************************************************************************
> ***
. * INVOKE PROGRAMS FOR TABLE 1 
. *
. *****************************************************************************
> ***
. 
. noi di "SUBSETTING ON COX POPULATION"
SUBSETTING ON COX POPULATION

. keep if cox_pop==1
(1,527 observations deleted)

. 
. 
. *Set up output file
. cap file close tablecontent

. 
. file open tablecontent using ./output/table1_cox.txt, write text replace
(note: file ./output/table1_cox.txt not found)

. 
. file write tablecontent ("Table 1: Demographic and Clinical Characteristics")
>  _n

. 
. file write tablecontent _tab ("Total")          _tab ///
>                                                          ("non-VOC")    _tab 
> ///
>                                                          ("VOC")             
>    _n

.                                                          
. 
. 
. * DEMOGRAPHICS (more than one level, potentially missing) 
. 
. /*reminder of variables:
> patient_id age ageCat hh_id hh_size hh_composition case_date case eth5 eth16 
> ethnicity_16 indexdate sex bmicat smoke imd region comorb_Neuro comorb_Immuno
> suppression shielding chronic_respiratory_disease chronic_cardiac_disease dia
> betes chronic_liver_disease cancer egfr_cat hypertension smoke_nomiss rural_u
> rban
> */
. 
. *DIED
. tabulatevariable, variable(cox_death) min(0) max(1) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |     88,158           0           0          0          0
  88,158
  44,373
  43,654
  45,549
  44,504
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |      1,764           1           0          1          1
  1,764
  44,373
  719
  45,549
  1,045

. file write tablecontent _n

. 
. *SURVIVAL TIME
. summarizevariable, variable(cox_time) 

. file write tablecontent _n

. 
. *SEX
. tabulatevariable, variable(male) min(0) max(1) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     46,005           0           0          0          0
  46,005
  44,373
  22,586
  45,549
  23,419
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     43,917           1           0          1          1
  43,917
  44,373
  21,787
  45,549
  22,130

. file write tablecontent _n 

. 
. *AGE
. summarizevariable, variable(age) 

. file write tablecontent _n

. 
. tabulatevariable, variable(agegroup) min(1) max(7) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     13,907           1           0          1          1
  13,907
  44,373
  6,906
  45,549
  7,001
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     11,921           2           0          2          2
  11,921
  44,373
  5,873
  45,549
  6,048
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     11,563           3           0          3          3
  11,563
  44,373
  5,821
  45,549
  5,742
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     12,069           4           0          4          4
  12,069
  44,373
  5,860
  45,549
  6,209
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      9,619           5           0          5          5
  9,619
  44,373
  4,643
  45,549
  4,976
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      7,295           6           0          6          6
  7,295
  44,373
  3,601
  45,549
  3,694
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      4,387           7           0          7          7
  4,387
  44,373
  2,191
  45,549
  2,196

. file write tablecontent _n 

. 
. *ETHNICITY
. tabulatevariable, variable(eth5) min(1) max(5) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     50,575           1           0          1          1
  50,575
  44,373
  24,930
  45,549
  25,645
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      3,404           2           0          2          2
  3,404
  44,373
  1,661
  45,549
  1,743
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      3,390           3           0          3          3
  3,390
  44,373
  1,647
  45,549
  1,743
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      3,422           4           0          4          4
  3,422
  44,373
  1,659
  45,549
  1,763
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      6,772           5           0          5          5
  6,772
  44,373
  3,316
  45,549
  3,456

. file write tablecontent _n 

. 
. *BMI
. tabulatevariable, variable(obese4cat) min(1) max(4) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     36,715           1           0          1          1
  36,715
  44,373
  18,193
  45,549
  18,522
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     16,410           2           0          2          2
  16,410
  44,373
  8,075
  45,549
  8,335
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     16,285           3           0          3          3
  16,285
  44,373
  8,008
  45,549
  8,277
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     20,512           4           0          4          4
  20,512
  44,373
  10,097
  45,549
  10,415

. file write tablecontent _n 

. 
. *SMOKING
. tabulatevariable, variable(smoke_nomiss) min(1) max(3) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     77,365           1           0          1          1
  77,365
  44,373
  38,210
  45,549
  39,155
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |      1,807           2           0          2          2
  1,807
  44,373
  892
  45,549
  915
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     10,750           3           0          3          3
  10,750
  44,373
  5,271
  45,549
  5,479

. file write tablecontent _n

. 
. *COMORBIDITIES (3 CATEGORIES)
. tabulatevariable, variable(comorb_cat) min(0) max(2) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |      5,955           0           0          0          0
  5,955
  44,373
  2,931
  45,549
  3,024
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     19,020           1           0          1          1
  19,020
  44,373
  9,343
  45,549
  9,677
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     64,947           2           0          2          2
  64,947
  44,373
  32,099
  45,549
  32,848

. file write tablecontent _n

. 
. *IMD
. tabulatevariable, variable(imd) min(1) max(5) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     62,909           1           0          1          1
  62,909
  44,373
  31,073
  45,549
  31,836
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |          0
  0
  44,373
  0
  45,549
  0
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |          0
  0
  44,373
  0
  45,549
  0
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     17,965           4           0          4          4
  17,965
  44,373
  8,782
  45,549
  9,183
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |      9,048           5           0          5          5
  9,048
  44,373
  4,518
  45,549
  4,530

. file write tablecontent _n 

. 
. *HOUSEHOLD SIZE
. tabulatevariable, variable(hh_total_cat) min(1) max(4) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     43,095           1           0          1          1
  43,095
  44,373
  21,371
  45,549
  21,724
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     44,626           2           0          2          2
  44,626
  44,373
  21,924
  45,549
  22,702
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |        115           3           0          3          3
  115
  44,373
  59
  45,549
  56
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |          0
  0
  44,373
  0
  45,549
  0

. file write tablecontent _n 

. 
. *REGION
. tabulatevariable, variable(region) min(0) max(8) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |      9,068           0           0          0          0
  9,068
  44,373
  4,464
  45,549
  4,604
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |      9,010           1           0          1          1
  9,010
  44,373
  4,425
  45,549
  4,585
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     17,784           2           0          2          2
  17,784
  44,373
  8,814
  45,549
  8,970
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |      9,081           3           0          3          3
  9,081
  44,373
  4,506
  45,549
  4,575
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |      9,081           4           0          4          4
  9,081
  44,373
  4,441
  45,549
  4,640
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     17,877           5           0          5          5
  17,877
  44,373
  8,879
  45,549
  8,998
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |          0
  0
  44,373
  0
  45,549
  0
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |      9,053           7           0          7          7
  9,053
  44,373
  4,448
  45,549
  4,605
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |      8,968           8           0          8          8
  8,968
  44,373
  4,396
  45,549
  4,572

. file write tablecontent _n 

. 
. *RURAL URBAN (five categories)
. tabulatevariable, variable(rural_urban5) min(1) max(5) 
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |      8,905           1           0          1          1
  8,905
  44,373
  4,471
  45,549
  4,434
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |      8,971           2           0          2          2
  8,971
  44,373
  4,442
  45,549
  4,529
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     18,137           3           0          3          3
  18,137
  44,373
  8,834
  45,549
  9,303
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     17,923           4           0          4          4
  17,923
  44,373
  8,840
  45,549
  9,083
  89,922

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     35,986           5           0          5          5
  35,986
  44,373
  17,786
  45,549
  18,200

. file write tablecontent _n 

. 
. 
. 
. 
. 
. 
. 
. file write tablecontent _n _n

. 
. 
. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 closed on:  10 Feb 2021, 17:33:17
-------------------------------------------------------------------------------
