-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 opened on:  13 Feb 2021, 22:01:09

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 13 Feb 2021)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,035 observations deleted)

. 
. noi di "SUBSETTING ON COX CENSORED POPULATION"
SUBSETTING ON COX CENSORED POPULATION

. keep if cox_pop==1
(2,299 observations deleted)

. 
. tab sgtf cox_death, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

        SGTF |    Outcome for Cox
  (exposure) |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    71,295      1,793 |    73,088 
             |     97.55       2.45 |    100.00 
-------------+----------------------+----------
         VOC |    71,582      1,840 |    73,422 
             |     97.49       2.51 |    100.00 
-------------+----------------------+----------
       Total |   142,877      3,633 |   146,510 
             |     97.52       2.48 |    100.00 

. 
. 
. *******************
. /* Unadjusted HR */
. *******************
. 
. stset stime_death, origin(study_start) fail(cox_death) scale(1) id(patient_id
> )

                id:  patient_id
     failure event:  cox_death != 0 & cox_death < .
obs. time interval:  (stime_death[_n-1], stime_death]
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time study_start

------------------------------------------------------------------------------
    146,510  total observations
          0  exclusions
------------------------------------------------------------------------------
    146,510  observations remaining, representing
    146,510  subjects
      3,633  failures in single-failure-per-subject data
  6,651,843  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        73

. 
. stcox i.sgtf

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -42083.903
Iteration 1:   log likelihood =  -42083.79
Refining estimates:
Iteration 0:   log likelihood =  -42083.79

Cox regression -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,510
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(1)       =        0.23
Log likelihood  =    -42083.79                  Prob > chi2      =      0.6334

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.015954    .033714     0.48   0.633      .951979    1.084229
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -33718.576
Iteration 1:   log likelihood = -33718.444
Refining estimates:
Iteration 0:   log likelihood = -33718.444

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,510
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(1)       =        0.26
Log likelihood  =   -33718.444                  Prob > chi2      =      0.6075

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.017191    .033759     0.51   0.608     .9531305    1.085557
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. * Stratified by region
. stcox i.sgtf, strata(region)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -31096.493
Iteration 1:   log likelihood =  -31096.47
Refining estimates:
Iteration 0:   log likelihood =  -31096.47

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     131,614
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(1)       =        0.05
Log likelihood  =    -31096.47                  Prob > chi2      =      0.8285

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.007577   .0351149     0.22   0.829     .9410513    1.078806
------------------------------------------------------------------------------
                                                          Stratified by region

. 
. * Stratified by UTLA
. stcox i.sgtf, strata(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -24889.349
Iteration 1:   log likelihood =  -24889.22
Refining estimates:
Iteration 0:   log likelihood =  -24889.22

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,482
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(1)       =        0.26
Log likelihood  =    -24889.22                  Prob > chi2      =      0.6119

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    1.01699   .0337736     0.51   0.612     .9529033    1.085387
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
. 
. * Plot scaled schoenfeld residuals
. estat phtest, plot(1.sgtf)

. graph export ./output/unadj_cox_shoen.svg, as(svg) replace
(note: file ./output/unadj_cox_shoen.svg not found)
(file ./output/unadj_cox_shoen.svg written in SVG format)

. 
. * KM plot
. sts graph,      surv by(sgtf) ///
>                         ylabel(0.8(0.05)1) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_km.svg, as(svg) replace
(note: file ./output/unadj_cox_km.svg not found)
(file ./output/unadj_cox_km.svg written in SVG format)

.                 
. * Smoothed hazard plot
. sts graph,      haz by(sgtf) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_haz.svg, as(svg) replace
(note: file ./output/unadj_cox_haz.svg not found)
(file ./output/unadj_cox_haz.svg written in SVG format)

. 
. * Interaction with time
. stcox i.sgtf, tvc(i.sgtf) strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -33718.576
Iteration 1:   log likelihood = -33716.516
Iteration 2:   log likelihood = -33716.516
Refining estimates:
Iteration 0:   log likelihood = -33716.516

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,510
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(2)       =        4.12
Log likelihood  =   -33716.516                  Prob > chi2      =      0.1274

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
main         |
        sgtf |
        VOC  |   .9193886   .0563311    -1.37   0.170     .8153534    1.036698
-------------+----------------------------------------------------------------
tvc          |
        sgtf |
        VOC  |   1.003834   .0019577     1.96   0.050     1.000005    1.007679
------------------------------------------------------------------------------
                                                             Stratified by stp
Note: Variables in tvc equation interacted with _t.

. 
. * Interaction with time excluding November
. stcox i.sgtf if study_start >= date("01dec2020", "DMY"), strata(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -13618.916
Iteration 1:   log likelihood = -13618.747
Refining estimates:
Iteration 0:   log likelihood = -13618.747

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       99,006                  Number of obs    =      98,987
No. of failures =        2,099
Time at risk    =      3839403
                                                LR chi2(1)       =        0.34
Log likelihood  =   -13618.747                  Prob > chi2      =      0.5613

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.025709   .0448256     0.58   0.561     .9415103    1.117438
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. stcox i.sgtf if study_start >= date("01dec2020", "DMY"), tvc(i.sgtf) strata(u
> tla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -13618.916
Iteration 1:   log likelihood = -13618.715
Iteration 2:   log likelihood = -13618.715
Refining estimates:
Iteration 0:   log likelihood = -13618.715

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       99,006                  Number of obs    =      98,987
No. of failures =        2,099
Time at risk    =      3839403
                                                LR chi2(2)       =        0.40
Log likelihood  =   -13618.715                  Prob > chi2      =      0.8184

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
main         |
        sgtf |
        VOC  |   1.043837   .0857653     0.52   0.602     .8885763    1.226225
-------------+----------------------------------------------------------------
tvc          |
        sgtf |
        VOC  |   .9992148   .0031173    -0.25   0.801     .9931236    1.005343
------------------------------------------------------------------------------
                                                      Stratified by utla_group
Note: Variables in tvc equation interacted with _t.

. 
. 
. *********************************************************************
. /* Demographically adjusted HR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by region
. stcox i.sgtf i.male ib1.imd ib1.eth2 household_size ///
>                          ib1.rural_urban5 ib1.start_week age1 age2 age3, stra
> ta(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -24889.349
Iteration 1:   log likelihood = -24880.391
Iteration 2:   log likelihood = -24880.387
Refining estimates:
Iteration 0:   log likelihood = -24880.387

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,482
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(22)      =       17.92
Log likelihood  =   -24880.387                  Prob > chi2      =      0.7105

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.017173   .0337825     0.51   0.608     .9530699    1.085589
             |
        male |
          M  |   .9892746   .0328648    -0.32   0.745      .926913    1.055832
             |
         imd |
          2  |    1.02232     .04847     0.47   0.642     .9316005    1.121873
          3  |   .9086589   .0444677    -1.96   0.050     .8255532    1.000131
          4  |   1.010385   .0479444     0.22   0.828      .920653    1.108863
5 most de..  |   .9809806   .0594175    -0.32   0.751     .8711712    1.104631
             |
        eth2 |
      Other  |   .9708526   .0431969    -0.66   0.506     .8897748    1.059318
    Missing  |   .9786009   .0390688    -0.54   0.588     .9049466     1.05825
             |
household_~e |   .9836423   .0157215    -1.03   0.302     .9533063    1.014944
             |
rural_urban5 |
Urban min..  |    1.00355   .0754945     0.05   0.962     .8659747    1.162981
Urban cit..  |   1.081351   .0694882     1.22   0.224     .9533844    1.226494
Rural tow..  |   1.022605   .0662913     0.34   0.730     .9005915    1.161148
Rural vil..  |   1.018475   .0603139     0.31   0.757     .9068648    1.143822
             |
  start_week |
23Nov-29Nov  |   1.100306   .0588985     1.79   0.074     .9907163    1.222018
30Nov-06Dec  |   1.046094   .0596436     0.79   0.429     .9354895    1.169775
07Dec-13Dec  |   .9943932   .0605748    -0.09   0.926     .8824823    1.120496
14Dec-20Dec  |    1.07114     .06802     1.08   0.279     .9457859    1.213108
21Dec-27Dec  |    1.10016   .0751055     1.40   0.162     .9623788    1.257666
28Dec-04Jan  |   1.054276   .0773919     0.72   0.472     .9129976    1.217416
             |
        age1 |   .9966607   .0034042    -0.98   0.327     .9900109    1.003355
        age2 |   1.011099   .0113129     0.99   0.324     .9891679    1.033517
        age3 |   .9681171   .0307121    -1.02   0.307     .9097557    1.030222
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
.                          
.                          
. *********************************************************************
. /* Demographically adjusted HR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by region
. stcox i.sgtf i.male ib1.imd ib1.eth2 ib1.hh_total_cat ///
>                          ib1.rural_urban5 ib1.start_week ib2.agegroupA, strat
> a(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -24236.374
Iteration 1:   log likelihood = -24226.847
Iteration 2:   log likelihood =  -24226.76
Iteration 3:   log likelihood = -24226.758
Iteration 4:   log likelihood = -24226.758
Refining estimates:
Iteration 0:   log likelihood = -24226.758

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      143,150                  Number of obs    =     143,122
No. of failures =        3,551
Time at risk    =      6498741
                                                LR chi2(23)      =       19.23
Log likelihood  =   -24226.758                  Prob > chi2      =      0.6877

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.012067   .0339988     0.36   0.721     .9475769    1.080946
             |
        male |
          M  |   .9861126   .0331384    -0.42   0.677     .9232553    1.053249
             |
         imd |
          2  |   1.025174    .049235     0.52   0.605     .9330773     1.12636
          3  |   .9177409   .0454031    -1.74   0.083     .8329307    1.011187
          4  |   1.015666   .0487807     0.32   0.746     .9244199    1.115919
5 most de..  |   .9918894   .0606654    -0.13   0.894     .8798376    1.118211
             |
        eth2 |
      Other  |   .9799709   .0440482    -0.45   0.653     .8973316    1.070221
    Missing  |   .9891799    .039886    -0.27   0.787     .9140141    1.070527
             |
hh_total_cat |
        3-5  |   .9664505   .0324717    -1.02   0.310     .9048575    1.032236
       6-10  |   .4129598   .2922961    -1.25   0.211     .1031385    1.653464
             |
rural_urban5 |
Urban min..  |    .997737   .0760865    -0.03   0.976     .8592198    1.158585
Urban cit..  |   1.088795   .0708199     1.31   0.191     .9584734    1.236835
Rural tow..  |   1.022565   .0671401     0.34   0.734     .8990886       1.163
Rural vil..  |   1.024494   .0614214     0.40   0.686     .9109137    1.152236
             |
  start_week |
23Nov-29Nov  |   1.116752   .0604673     2.04   0.041      1.00431    1.241782
30Nov-06Dec  |   1.052839    .060826     0.89   0.373     .9401244    1.179068
07Dec-13Dec  |   .9997032   .0617012    -0.00   0.996     .8857993    1.128254
14Dec-20Dec  |   1.077955   .0693726     1.17   0.243     .9502128     1.22287
21Dec-27Dec  |   1.121154   .0772276     1.66   0.097     .9795635    1.283211
28Dec-04Jan  |   1.054299   .0785678     0.71   0.478      .911027    1.220103
             |
   agegroupA |
      0-<65  |   1.011354   .0571167     0.20   0.842     .9053802    1.129731
     75-<85  |   .9665582    .085936    -0.38   0.702     .8119856    1.150556
        85+  |   1.007708   .1207489     0.06   0.949      .796782    1.274472
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
. 
.                          
. ***********************************************************
. /* Fully adjusted HR - age as spline, continuous hh size */
. ***********************************************************
. 
. * Stratified by region
. stcox i.sgtf i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.obese4cat househol
> d_size ///
>                          ib1.rural_urban5 ib0.comorb_cat ib1.start_week age1 
> age2 age3, strata(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -3278.2477
Iteration 1:   log likelihood = -3268.4684
Iteration 2:   log likelihood = -3268.4613
Iteration 3:   log likelihood = -3268.4613
Refining estimates:
Iteration 0:   log likelihood = -3268.4613

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,317
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(28)      =       19.57
Log likelihood  =   -3268.4613                  Prob > chi2      =      0.8795

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9942545   .0784873    -0.07   0.942     .8517321    1.160626
             |
        male |
          M  |   .9789499   .0772271    -0.27   0.787     .8387086    1.142641
             |
         imd |
          2  |   1.062316   .1227498     0.52   0.601     .8470287    1.332323
          3  |    .968362   .1143204    -0.27   0.785     .7683317    1.220469
          4  |   1.185589   .1324679     1.52   0.128     .9524191    1.475844
5 most de..  |   1.140431   .1596344     0.94   0.348     .8668029    1.500438
             |
        eth2 |
      Other  |   1.060555   .1111834     0.56   0.575     .8635698    1.302474
    Missing  |   1.047387   .0989217     0.49   0.624     .8703912    1.260375
             |
smoke_nomi~2 |
     Former  |   1.077671   .1045402     0.77   0.441     .8910762     1.30334
             |
   obese4cat |
Obese I ..)  |   1.053161   .1125487     0.48   0.628     .8541399    1.298556
Obese II..)  |   .8729725   .0996908    -1.19   0.234     .6979044    1.091956
Obese II..)  |   .8347576   .0891697    -1.69   0.091     .6770709    1.029169
             |
household_~e |   .9578443   .0363062    -1.14   0.256     .8892644    1.031713
             |
rural_urban5 |
Urban min..  |   1.100058   .1886548     0.56   0.578     .7860287    1.539546
Urban cit..  |   1.072136   .1622025     0.46   0.645     .7970258    1.442206
Rural tow..  |   .9216715   .1427178    -0.53   0.598     .6804095    1.248481
Rural vil..  |   .9628657   .1347378    -0.27   0.787     .7319031    1.266712
             |
  comorb_cat |
1 comorbi..  |   1.034793   .1844003     0.19   0.848      .729742    1.467364
2+ comorb..  |   1.010012   .1653159     0.06   0.951     .7328321    1.392031
             |
  start_week |
23Nov-29Nov  |    .996256   .1274624    -0.03   0.977      .775295    1.280191
30Nov-06Dec  |   1.163682   .1526923     1.16   0.248     .8997957    1.504958
07Dec-13Dec  |   .9225757   .1367255    -0.54   0.587      .690008    1.233531
14Dec-20Dec  |   1.064885    .159882     0.42   0.675     .7934199     1.42923
21Dec-27Dec  |   1.155635   .1889016     0.88   0.376      .838846    1.592059
28Dec-04Jan  |   1.036226   .1849121     0.20   0.842     .7303979    1.470109
             |
        age1 |   .9912849   .0081302    -1.07   0.286     .9754774    1.007349
        age2 |    1.03831   .0278066     1.40   0.160     .9852157    1.094266
        age3 |    .893335   .0678727    -1.48   0.138     .7697378    1.036778
------------------------------------------------------------------------------
                                                      Stratified by utla_group

.                          
. est store e_no_int

. 
. /* Subgroup analyses */
. 
. * Epi week
. stcox i.sgtf##ib1.start_week i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.ob
> ese4cat household_size ///
>                          ib1.rural_urban5 ib0.comorb_cat age1 age2 age3, stra
> ta(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -3278.2477
Iteration 1:   log likelihood = -3266.0577
Iteration 2:   log likelihood = -3266.0335
Iteration 3:   log likelihood = -3266.0335
Refining estimates:
Iteration 0:   log likelihood = -3266.0335

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,317
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(34)      =       24.43
Log likelihood  =   -3266.0335                  Prob > chi2      =      0.8867

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.308109   .2290557     1.53   0.125     .9281002    1.843713
             |
  start_week |
23Nov-29Nov  |   1.139313    .212095     0.70   0.484     .7910114    1.640979
30Nov-06Dec  |   1.488039   .2766312     2.14   0.033     1.033649    2.142177
07Dec-13Dec  |   1.163664   .2396159     0.74   0.462      .777235    1.742219
14Dec-20Dec  |   1.178859   .2539489     0.76   0.445     .7728529    1.798155
21Dec-27Dec  |   1.350973   .3136601     1.30   0.195     .8570774    2.129477
28Dec-04Jan  |    1.30723   .3192751     1.10   0.273     .8099462    2.109831
             |
        sgtf#|
  start_week |
        VOC #|
23Nov-29Nov  |   .7827161   .1967908    -0.97   0.330     .4781838     1.28119
        VOC #|
30Nov-06Dec  |   .6225556   .1577893    -1.87   0.062     .3788241    1.023101
        VOC #|
07Dec-13Dec  |   .6366439   .1818863    -1.58   0.114     .3636739    1.114502
        VOC #|
14Dec-20Dec  |    .833515   .2383915    -0.64   0.524     .4758427    1.460035
        VOC #|
21Dec-27Dec  |    .748448   .2329878    -0.93   0.352     .4066186    1.377641
        VOC #|
28Dec-04Jan  |   .6376387   .2163703    -1.33   0.185     .3278959    1.239976
             |
        male |
          M  |   .9809168   .0774024    -0.24   0.807     .8403601    1.144983
             |
         imd |
          2  |   1.062288   .1227566     0.52   0.601     .8469901    1.332312
          3  |   .9685435   .1143505    -0.27   0.787     .7684622    1.220719
          4  |   1.188928   .1328659     1.55   0.121     .9550615    1.480061
5 most de..  |   1.139048   .1595404     0.93   0.353     .8656034    1.498875
             |
        eth2 |
      Other  |   1.061651   .1113149     0.57   0.568     .8644355     1.30386
    Missing  |   1.047415   .0989236     0.49   0.624     .8704154    1.260407
             |
smoke_nomi~2 |
     Former  |   1.078416   .1046248     0.78   0.436     .8916719    1.304269
             |
   obese4cat |
Obese I ..)  |   1.051259   .1123814     0.47   0.640     .8525403    1.296297
Obese II..)  |   .8689794    .099273    -1.23   0.219     .6946523    1.087055
Obese II..)  |   .8344808   .0891483    -1.69   0.090     .6768334    1.028847
             |
household_~e |    .957184   .0363207    -1.15   0.249     .8885796    1.031085
             |
rural_urban5 |
Urban min..  |   1.100094   .1886409     0.56   0.578     .7860827    1.539541
Urban cit..  |   1.069944   .1618992     0.45   0.655     .7953546    1.439332
Rural tow..  |   .9215955   .1427048    -0.53   0.598     .6803552    1.248375
Rural vil..  |   .9622087   .1346563    -0.28   0.783     .7313881    1.265874
             |
  comorb_cat |
1 comorbi..  |   1.030087   .1835821     0.17   0.868     .7263947    1.460747
2+ comorb..  |   1.003303   .1642527     0.02   0.984     .7279147    1.382879
             |
        age1 |   .9916186    .008134    -1.03   0.305     .9758038     1.00769
        age2 |   1.037089   .0277775     1.36   0.174     .9840502    1.092986
        age3 |    .896323    .068117    -1.44   0.150     .7722832    1.040285
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
. est store e_weekX

. 
. * Test for interaction
. lrtest e_no_int e_weekX

Likelihood-ratio test                                 LR chi2(6)  =      4.86
(Assumption: e_no_int nested in e_weekX)              Prob > chi2 =    0.5625

. 
. * Epi week VOC vs. non-VOC HR
. lincom 1.sgtf, eform                                            // week 1

 ( 1)  1.sgtf = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.308109   .2290557     1.53   0.125     .9281002    1.843713
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.start_week, eform      // week 2

 ( 1)  1.sgtf + 1.sgtf#2.start_week = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.023878   .1848384     0.13   0.896     .7187582    1.458525
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.start_week, eform      // week 3

 ( 1)  1.sgtf + 1.sgtf#3.start_week = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8143708   .1492299    -1.12   0.262     .5686476    1.166275
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.start_week, eform      // week 4

 ( 1)  1.sgtf + 1.sgtf#4.start_week = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8327998   .1879621    -0.81   0.418      .535088    1.296152
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.start_week, eform      // week 5

 ( 1)  1.sgtf + 1.sgtf#5.start_week = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.090329   .2465334     0.38   0.702     .6999917     1.69833
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.start_week, eform      // week 6

 ( 1)  1.sgtf + 1.sgtf#6.start_week = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9790518   .2519384    -0.08   0.934      .591244     1.62123
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.start_week, eform      // week 7

 ( 1)  1.sgtf + 1.sgtf#7.start_week = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8341011   .2424951    -0.62   0.533     .4717936    1.474638
------------------------------------------------------------------------------

. 
. 
. 
. * Comorbidities
. stcox i.sgtf##ib0.comorb_cat i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.ob
> ese4cat household_size ///
>                          ib1.rural_urban5 ib1.start_week age1 age2 age3, stra
> ta(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -3278.2477
Iteration 1:   log likelihood = -3266.2873
Iteration 2:   log likelihood = -3266.2436
Iteration 3:   log likelihood = -3266.2436
Refining estimates:
Iteration 0:   log likelihood = -3266.2436

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,317
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(30)      =       24.01
Log likelihood  =   -3266.2436                  Prob > chi2      =      0.7717

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .5363531   .1746931    -1.91   0.056     .2832761    1.015527
             |
  comorb_cat |
1 comorbi..  |   .7343303   .1706402    -1.33   0.184     .4656861     1.15795
2+ comorb..  |   .7655002   .1593118    -1.28   0.199     .5090938    1.151046
             |
        sgtf#|
  comorb_cat |
        VOC #|
1 comorbi..  |   2.131748   .7820973     2.06   0.039     1.038596    4.375477
        VOC #|
2+ comorb..  |   1.873814   .6349429     1.85   0.064     .9644866    3.640462
             |
        male |
          M  |   .9774274   .0771089    -0.29   0.772      .837401    1.140868
             |
         imd |
          2  |   1.065163   .1231019     0.55   0.585     .8492621     1.33595
          3  |   .9704971   .1145863    -0.25   0.800     .7700043    1.223194
          4  |   1.188533   .1328107     1.55   0.122     .9547619    1.479542
5 most de..  |   1.144896   .1602774     0.97   0.334     .8701696    1.506359
             |
        eth2 |
      Other  |   1.058813   .1110332     0.54   0.586     .8620996    1.300413
    Missing  |   1.051061   .0992844     0.53   0.598     .8734184    1.264833
             |
smoke_nomi~2 |
     Former  |   1.078923   .1046817     0.78   0.434     .8920791    1.304902
             |
   obese4cat |
Obese I ..)  |   1.056994   .1129749     0.52   0.604     .8572217    1.303321
Obese II..)  |    .875209   .0999501    -1.17   0.243     .6996862    1.094763
Obese II..)  |   .8367144   .0893744    -1.67   0.095      .678665    1.031571
             |
household_~e |   .9581968   .0363203    -1.13   0.260     .8895903    1.032094
             |
rural_urban5 |
Urban min..  |   1.101595   .1889273     0.56   0.573      .787115    1.541722
Urban cit..  |   1.069031   .1617505     0.44   0.659     .7946917    1.438076
Rural tow..  |    .921212    .142665    -0.53   0.596     .6800437    1.247907
Rural vil..  |   .9606452   .1344377    -0.29   0.774     .7301993    1.263818
             |
  start_week |
23Nov-29Nov  |   .9981209   .1277294    -0.01   0.988      .776703    1.282659
30Nov-06Dec  |   1.166218   .1530426     1.17   0.241     .9017302    1.508283
07Dec-13Dec  |     .92594   .1372303    -0.52   0.604     .6925152    1.238045
14Dec-20Dec  |   1.066339   .1601101     0.43   0.669     .7944894    1.431208
21Dec-27Dec  |   1.159985   .1896256     0.91   0.364     .8419847    1.598086
28Dec-04Jan  |   1.040441    .185679     0.22   0.824     .7333489     1.47613
             |
        age1 |   .9912732   .0081287    -1.07   0.285     .9754685    1.007334
        age2 |   1.038494   .0278047     1.41   0.158     .9854028    1.094445
        age3 |   .8927507   .0678096    -1.49   0.135     .7692659    1.036058
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
. est store e_comorbX

. 
. * Test for interaction
. lrtest e_no_int e_comorbX

Likelihood-ratio test                                 LR chi2(2)  =      4.44
(Assumption: e_no_int nested in e_comorbX)            Prob > chi2 =    0.1089

. 
. * Comorbidities VOC vs. non-VOC HR
. lincom 1.sgtf, eform                                            // no comorbs

 ( 1)  1.sgtf = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5363531   .1746931    -1.91   0.056     .2832761    1.015527
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.comorb_cat, eform      // 1 comorb

 ( 1)  1.sgtf + 1.sgtf#1.comorb_cat = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.14337   .1932081     0.79   0.428     .8210122    1.592296
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.comorb_cat, eform      // 2+ comorbs

 ( 1)  1.sgtf + 1.sgtf#2.comorb_cat = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.005026   .0936497     0.05   0.957     .8372614    1.206406
------------------------------------------------------------------------------

. 
. 
. 
. * Ethnicity
. stcox i.sgtf##ib1.eth2 i.male ib1.imd ib0.comorb_cat ib1.smoke_nomiss2 ib1.ob
> ese4cat household_size ///
>                          ib1.rural_urban5 ib1.start_week age1 age2 age3, stra
> ta(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -3278.2477
Iteration 1:   log likelihood = -3268.0008
Iteration 2:   log likelihood = -3267.9934
Iteration 3:   log likelihood = -3267.9934
Refining estimates:
Iteration 0:   log likelihood = -3267.9934

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,317
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(30)      =       20.51
Log likelihood  =   -3267.9934                  Prob > chi2      =      0.9026

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9527956    .101139    -0.46   0.649     .7738289    1.173153
             |
        eth2 |
      Other  |   1.065881   .1587198     0.43   0.668     .7960796     1.42712
    Missing  |   .9597109   .1301355    -0.30   0.762     .7357303    1.251879
             |
   sgtf#eth2 |
  VOC#Other  |   .9915362   .2077937    -0.04   0.968     .6575434    1.495177
VOC#Missing  |   1.188578   .2245587     0.91   0.361     .8207476    1.721256
             |
        male |
          M  |   .9789769   .0772285    -0.27   0.788      .838733    1.142671
             |
         imd |
          2  |   1.063579   .1229025     0.53   0.594     .8480249    1.333923
          3  |   .9690139   .1144021    -0.27   0.790     .7688417    1.221302
          4  |   1.187718   .1327425     1.54   0.124     .9540709    1.478583
5 most de..  |   1.142034   .1598694     0.95   0.343     .8680052    1.502574
             |
  comorb_cat |
1 comorbi..  |   1.038467   .1851058     0.21   0.832     .7322626    1.472715
2+ comorb..  |   1.013334   .1659042     0.08   0.936     .7351783    1.396729
             |
smoke_nomi~2 |
     Former  |   1.078639   .1046439     0.78   0.435     .8918603    1.304533
             |
   obese4cat |
Obese I ..)  |   1.052039   .1124553     0.47   0.635     .8531875    1.297236
Obese II..)  |   .8720625   .0995933    -1.20   0.231     .6971669    1.090834
Obese II..)  |   .8344502   .0891377    -1.69   0.090     .6768202    1.028792
             |
household_~e |    .957463   .0362912    -1.15   0.251     .8889114    1.031301
             |
rural_urban5 |
Urban min..  |   1.099363   .1885472     0.55   0.581     .7855159    1.538605
Urban cit..  |   1.071461   .1621085     0.46   0.648      .796512     1.44132
Rural tow..  |    .921137   .1426358    -0.53   0.596     .6800138    1.247759
Rural vil..  |   .9620776   .1346459    -0.28   0.782     .7312766    1.265722
             |
  start_week |
23Nov-29Nov  |    .995882   .1274056    -0.03   0.974     .7750177    1.279688
30Nov-06Dec  |   1.163876   .1527289     1.16   0.247     .8999295    1.505238
07Dec-13Dec  |   .9229104   .1367717    -0.54   0.588     .6902633    1.233969
14Dec-20Dec  |   1.063877   .1597263     0.41   0.680     .7926749    1.427866
21Dec-27Dec  |   1.153882   .1886237     0.88   0.381     .8375612    1.589668
28Dec-04Jan  |   1.035502   .1847861     0.20   0.845     .7298832     1.46909
             |
        age1 |    .991323   .0081316    -1.06   0.288     .9755128    1.007389
        age2 |   1.038152    .027806     1.40   0.162     .9850587    1.094106
        age3 |   .8937658   .0679127    -1.48   0.139     .7700968    1.037295
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
. est store e_eth2X

. 
. * Test for interaction
. lrtest e_no_int e_eth2X

Likelihood-ratio test                                 LR chi2(2)  =      0.94
(Assumption: e_no_int nested in e_eth2X)              Prob > chi2 =    0.6263

. 
. * Ethnicity VOC vs. non-VOC HR
. lincom 1.sgtf, eform                                    // White

 ( 1)  1.sgtf = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9527956    .101139    -0.46   0.649     .7738289    1.173153
------------------------------------------------------------------------------

. *lincom 1.sgtf + 1.sgtf#2.eth5, eform   // S Asian
. *lincom 1.sgtf + 1.sgtf#3.eth5, eform   // Black
. *lincom 1.sgtf + 1.sgtf#4.eth5, eform   // Mixed
. lincom 1.sgtf + 1.sgtf#5.eth2, eform    // Other

 ( 1)  1.sgtf + 1.sgtf#5.eth2 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9447313   .1707006    -0.31   0.753     .6629905    1.346199
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#9.eth2, eform    // Missing

 ( 1)  1.sgtf + 1.sgtf#9.eth2 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.132472   .1769158     0.80   0.426     .8337807    1.538165
------------------------------------------------------------------------------

. 
. 
. 
. **************************************************
. /* Fully adjusted HR - age grouped, cat hh size */
. **************************************************
. 
. * Stratified by region
. stcox i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.obes
> e4cat ///
>                          ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1
> .start_week, strata(utla_group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood =  -3178.222
Iteration 1:   log likelihood = -3166.2912
Iteration 2:   log likelihood =   -3166.03
Iteration 3:   log likelihood = -3165.9476
Iteration 4:   log likelihood = -3165.9173
Iteration 5:   log likelihood = -3165.9062
Iteration 6:   log likelihood = -3165.9021
Iteration 7:   log likelihood = -3165.9006
Iteration 8:   log likelihood =    -3165.9
Iteration 9:   log likelihood = -3165.8998
Iteration 10:  log likelihood = -3165.8998
Iteration 11:  log likelihood = -3165.8997
Iteration 12:  log likelihood = -3165.8997
Iteration 13:  log likelihood = -3165.8997
Iteration 14:  log likelihood = -3165.8997
Iteration 15:  log likelihood = -3165.8997
Iteration 16:  log likelihood = -3165.8997
Iteration 17:  log likelihood = -3165.8997
Iteration 18:  log likelihood = -3165.8997
Iteration 19:  log likelihood = -3165.8997
Iteration 20:  log likelihood = -3165.8997
Iteration 21:  log likelihood = -3165.8997
Iteration 22:  log likelihood = -3165.8997
Iteration 23:  log likelihood = -3165.8997
Iteration 24:  log likelihood = -3165.8997
Iteration 25:  log likelihood = -3165.8997
Iteration 26:  log likelihood = -3165.8997
Iteration 27:  log likelihood = -3165.8997
Iteration 28:  log likelihood = -3165.8997
Iteration 29:  log likelihood = -3165.8997
Iteration 30:  log likelihood = -3165.8997
Iteration 31:  log likelihood = -3165.8997
Iteration 32:  log likelihood = -3165.8997
Iteration 33:  log likelihood = -3165.8997
Iteration 34:  log likelihood = -3165.8997
Iteration 35:  log likelihood = -3165.8997
Iteration 36:  log likelihood = -3165.8997
Iteration 37:  log likelihood = -3165.8997
Iteration 38:  log likelihood = -3165.8997
Refining estimates:
Iteration 0:   log likelihood = -3165.8997
Iteration 1:   log likelihood = -3165.8997

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       25,689                  Number of obs    =      25,683
No. of failures =          632
Time at risk    =      1167532
                                                LR chi2(29)      =       24.64
Log likelihood  =   -3165.8997                  Prob > chi2      =      0.6965

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9797321    .078389    -0.26   0.798     .8375335    1.146074
             |
   agegroupA |
      0-<65  |    1.17662   .1661964     1.15   0.250     .8920822    1.551914
     75-<85  |   .8880865   .2064842    -0.51   0.610       .56305     1.40076
        85+  |   1.529726   .4086548     1.59   0.112     .9061949    2.582295
             |
        male |
          M  |   .9839226   .0786841    -0.20   0.839      .841183    1.150883
             |
         imd |
          2  |   1.099393   .1283884     0.81   0.417     .8744779    1.382157
          3  |   .9934836   .1188276    -0.05   0.956     .7858706    1.255944
          4  |   1.184734    .135134     1.49   0.137     .9473941    1.481533
5 most de..  |   1.177742    .166699     1.16   0.248     .8924215    1.554283
             |
        eth2 |
      Other  |    1.08327   .1148107     0.75   0.450     .8800794    1.333373
    Missing  |   1.059557   .1012472     0.61   0.545     .8785908    1.277797
             |
smoke_nomi~2 |
     Former  |   1.084333     .10673     0.82   0.411     .8940865     1.31506
             |
   obese4cat |
Obese I ..)  |    1.05739   .1139007     0.52   0.604     .8561397    1.305947
Obese II..)  |    .852497   .0989449    -1.37   0.169     .6790445    1.070255
Obese II..)  |    .803624   .0877394    -2.00   0.045     .6488123    .9953751
             |
hh_total_cat |
        3-5  |    1.03951   .0833105     0.48   0.629     .8884028    1.216319
       6-10  |   1.19e-17   3.56e-09    -0.00   1.000            0           .
             |
rural_urban5 |
Urban min..  |    1.06421   .1871281     0.35   0.723     .7539701    1.502106
Urban cit..  |   1.090284    .167285     0.56   0.573     .8071187    1.472792
Rural tow..  |   .9350046   .1468791    -0.43   0.669     .6872254    1.272121
Rural vil..  |   .9871719    .140072    -0.09   0.927     .7475048    1.303682
             |
  comorb_cat |
1 comorbi..  |   1.005482   .1798329     0.03   0.976     .7081658    1.427624
2+ comorb..  |   .9763162   .1600188    -0.15   0.884      .708073    1.346179
             |
  start_week |
23Nov-29Nov  |   1.020097   .1330042     0.15   0.879     .7900573    1.317117
30Nov-06Dec  |   1.201732   .1604724     1.38   0.169     .9250023    1.561249
07Dec-13Dec  |   .9497779   .1433131    -0.34   0.733     .7066156    1.276618
14Dec-20Dec  |   1.090842   .1666834     0.57   0.569     .8085298    1.471728
21Dec-27Dec  |   1.195841   .1982287     1.08   0.281     .8641201    1.654905
28Dec-04Jan  |   1.066707   .1931899     0.36   0.721     .7479721    1.521266
------------------------------------------------------------------------------
                                                      Stratified by utla_group

.                          
.                          
.                          
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -6366.0917
Iteration 1:   log likelihood = -6362.5744
Iteration 2:   log likelihood = -6362.5723
Refining estimates:
Iteration 0:   log likelihood = -6362.5723

Cox regression -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,323
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(11)      =        7.04
Log likelihood  =   -6362.5723                  Prob > chi2      =      0.7959

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.008109   .0791597     0.10   0.918     .8643079    1.175834
             |
  comorb_cat |
1 comorbi..  |   1.032533   .1830889     0.18   0.857     .7294049    1.461635
2+ comorb..  |   1.003271   .1634508     0.02   0.984     .7290244    1.380684
             |
         imd |
          2  |   1.061369   .1221647     0.52   0.605     .8470173    1.329966
          3  |   .9738542   .1145362    -0.23   0.822     .7733624    1.226323
          4  |   1.181833    .131328     1.50   0.133     .9505358    1.469412
5 most de..  |   1.156335    .161019     1.04   0.297     .8801456    1.519194
             |
smoke_nomi~2 |
     Former  |   1.076726   .1038785     0.77   0.444     .8912188    1.300846
        age1 |   .9916341   .0080805    -1.03   0.303     .9759223    1.007599
        age2 |   1.038121   .0276474     1.40   0.160     .9853226    1.093748
        age3 |   .8914536   .0673652    -1.52   0.128     .7687325    1.033766
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -4872.2391
Iteration 1:   log likelihood = -4868.7087
Iteration 2:   log likelihood = -4868.7064
Refining estimates:
Iteration 0:   log likelihood = -4868.7064

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,323
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(11)      =        7.07
Log likelihood  =   -4868.7064                  Prob > chi2      =      0.7938

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.007022   .0790925     0.09   0.929     .8633459    1.174609
             |
  comorb_cat |
1 comorbi..  |   1.034849   .1835308     0.19   0.847     .7309977    1.465001
2+ comorb..  |   1.003644   .1635418     0.02   0.982     .7292525    1.381279
             |
         imd |
          2  |   1.060848   .1221647     0.51   0.608     .8465074     1.32946
          3  |   .9768544   .1149467    -0.20   0.842     .7756551    1.230243
          4  |   1.183326    .131543     1.51   0.130     .9516594    1.471388
5 most de..  |   1.157862   .1613058     1.05   0.293     .8811969     1.52139
             |
smoke_nomi~2 |
     Former  |   1.074659   .1037056     0.75   0.456     .8894655    1.298412
        age1 |   .9917087   .0080862    -1.02   0.307     .9759859    1.007685
        age2 |   1.038163   .0276611     1.41   0.160     .9853398    1.093819
        age3 |   .8909379   .0673543    -1.53   0.127     .7682405    1.033232
------------------------------------------------------------------------------
                                                             Stratified by stp

.                          
. * Stratified by region
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3, strata(utla
> _group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -3278.2477
Iteration 1:   log likelihood = -3274.9672
Iteration 2:   log likelihood = -3274.9653
Refining estimates:
Iteration 0:   log likelihood = -3274.9653

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,317
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(11)      =        6.56
Log likelihood  =   -3274.9653                  Prob > chi2      =      0.8332

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9963235   .0786111    -0.05   0.963     .8535708     1.16295
             |
  comorb_cat |
1 comorbi..  |   1.035168   .1843394     0.19   0.846     .7301824     1.46754
2+ comorb..  |   1.009943   .1652056     0.06   0.952     .7329223    1.391668
             |
         imd |
          2  |   1.059612   .1223739     0.50   0.616     .8449716    1.328775
          3  |   .9702878   .1145342    -0.26   0.798     .7698807    1.222863
          4  |   1.181883   .1319479     1.50   0.134     .9496089    1.470972
5 most de..  |   1.138485   .1593307     0.93   0.354       .86537    1.497796
             |
smoke_nomi~2 |
     Former  |   1.074255   .1041479     0.74   0.460     .8883506    1.299064
        age1 |   .9912825   .0081225    -1.07   0.285     .9754899    1.007331
        age2 |   1.037857   .0277732     1.39   0.165     .9848252    1.093744
        age3 |   .8945365   .0679234    -1.47   0.142     .7708416     1.03808
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
. * Plot scaled schoenfeld residuals
. estat phtest, plot(1.sgtf)

. graph export ./output/minadj_cox_shoen.svg, as(svg) replace
(note: file ./output/minadj_cox_shoen.svg not found)
(file ./output/minadj_cox_shoen.svg written in SVG format)

. 
. * KM plot
. sts graph,      surv by(sgtf) ///
>                         ylabel(0.8(0.05)1) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/minadj_cox_km.svg, as(svg) replace
(note: file ./output/minadj_cox_km.svg not found)
(file ./output/minadj_cox_km.svg written in SVG format)

.                 
. * Smoothed hazard plot
. sts graph,      haz by(sgtf) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/minadj_cox_haz.svg, as(svg) replace
(note: file ./output/minadj_cox_haz.svg not found)
(file ./output/minadj_cox_haz.svg written in SVG format)

. 
. * Interaction with time
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3, strata(utla_
> group) tvc(i.sgtf)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -24889.349
Iteration 1:   log likelihood = -24881.572
Iteration 2:   log likelihood = -24881.563
Iteration 3:   log likelihood = -24881.563
Refining estimates:
Iteration 0:   log likelihood = -24881.563

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,482
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(13)      =       15.57
Log likelihood  =   -24881.563                  Prob > chi2      =      0.2730

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
main         |
        sgtf |
        VOC  |   .9204287   .0564337    -1.35   0.176     .8162082    1.037957
             |
  comorb_cat |
1 comorbi..  |   .9018994   .0653351    -1.43   0.154     .7825203    1.039491
2+ comorb..  |    .917499   .0602427    -1.31   0.190     .8067072    1.043507
             |
         imd |
          2  |    1.02171   .0484381     0.45   0.651     .9310506    1.121198
          3  |   .9083725   .0444521    -1.96   0.050     .8252958    .9998119
          4  |   1.010527   .0479475     0.22   0.825      .920789    1.109011
5 most de..  |   .9812438    .059431    -0.31   0.755     .8714093    1.104922
             |
smoke_nomiss |
     Former  |   1.156772   .1287596     1.31   0.191     .9300389    1.438781
    Current  |   .9880829   .0508683    -0.23   0.816     .8932479    1.092986
             |
        age1 |   .9967251   .0034043    -0.96   0.337     .9900751     1.00342
        age2 |   1.010867   .0113098     0.97   0.334     .9889415    1.033279
        age3 |   .9687651   .0307314    -1.00   0.317     .9103668    1.030909
-------------+----------------------------------------------------------------
tvc          |
        sgtf |
        VOC  |   1.003782     .00196     1.93   0.053     .9999477    1.007631
------------------------------------------------------------------------------
                                                      Stratified by utla_group
Note: Variables in tvc equation interacted with _t.

. 
. 
.                          
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 closed on:  13 Feb 2021, 22:49:42
-------------------------------------------------------------------------------
