-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 opened on:  13 Feb 2021, 17:31:10

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 13 Feb 2021)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,035 observations deleted)

. 
. noi di "SUBSETTING ON COX CENSORED POPULATION"
SUBSETTING ON COX CENSORED POPULATION

. keep if cox_pop==1
(2,299 observations deleted)

. 
. tab sgtf cox_death, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

        SGTF |    Outcome for Cox
  (exposure) |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    71,295      1,793 |    73,088 
             |     97.55       2.45 |    100.00 
-------------+----------------------+----------
         VOC |    71,582      1,840 |    73,422 
             |     97.49       2.51 |    100.00 
-------------+----------------------+----------
       Total |   142,877      3,633 |   146,510 
             |     97.52       2.48 |    100.00 

. 
. 
. *******************
. /* Unadjusted HR */
. *******************
. 
. stset stime_death, origin(study_start) fail(cox_death) scale(1) id(patient_id
> )

                id:  patient_id
     failure event:  cox_death != 0 & cox_death < .
obs. time interval:  (stime_death[_n-1], stime_death]
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time study_start

------------------------------------------------------------------------------
    146,510  total observations
          0  exclusions
------------------------------------------------------------------------------
    146,510  observations remaining, representing
    146,510  subjects
      3,633  failures in single-failure-per-subject data
  6,651,843  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        73

. 
. stcox i.sgtf

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -42083.903
Iteration 1:   log likelihood =  -42083.79
Refining estimates:
Iteration 0:   log likelihood =  -42083.79

Cox regression -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,510
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(1)       =        0.23
Log likelihood  =    -42083.79                  Prob > chi2      =      0.6334

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.015954    .033714     0.48   0.633      .951979    1.084229
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -33718.576
Iteration 1:   log likelihood = -33718.444
Refining estimates:
Iteration 0:   log likelihood = -33718.444

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,510
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(1)       =        0.26
Log likelihood  =   -33718.444                  Prob > chi2      =      0.6075

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.017191    .033759     0.51   0.608     .9531305    1.085557
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. * Stratified by region
. stcox i.sgtf, strata(region)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -31096.493
Iteration 1:   log likelihood =  -31096.47
Refining estimates:
Iteration 0:   log likelihood =  -31096.47

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     131,614
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(1)       =        0.05
Log likelihood  =    -31096.47                  Prob > chi2      =      0.8285

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.007577   .0351149     0.22   0.829     .9410513    1.078806
------------------------------------------------------------------------------
                                                          Stratified by region

. 
. 
. * Plot scaled schoenfeld residuals
. estat phtest, plot(1.sgtf)

. graph export ./output/unadj_cox_shoen.svg, as(svg) replace
(note: file ./output/unadj_cox_shoen.svg not found)
(file ./output/unadj_cox_shoen.svg written in SVG format)

. 
. * KM plot
. sts graph,      surv by(sgtf) ///
>                         ylabel(0.8(0.05)1) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_km.svg, as(svg) replace
(note: file ./output/unadj_cox_km.svg not found)
(file ./output/unadj_cox_km.svg written in SVG format)

.                 
. * Smoothed hazard plot
. sts graph,      haz by(sgtf) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_haz.svg, as(svg) replace
(note: file ./output/unadj_cox_haz.svg not found)
(file ./output/unadj_cox_haz.svg written in SVG format)

. 
. * Interaction with time
. stcox i.sgtf, tvc(i.sgtf) strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -33718.576
Iteration 1:   log likelihood = -33716.516
Iteration 2:   log likelihood = -33716.516
Refining estimates:
Iteration 0:   log likelihood = -33716.516

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     146,510
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(2)       =        4.12
Log likelihood  =   -33716.516                  Prob > chi2      =      0.1274

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
main         |
        sgtf |
        VOC  |   .9193886   .0563311    -1.37   0.170     .8153534    1.036698
-------------+----------------------------------------------------------------
tvc          |
        sgtf |
        VOC  |   1.003834   .0019577     1.96   0.050     1.000005    1.007679
------------------------------------------------------------------------------
                                                             Stratified by stp
Note: Variables in tvc equation interacted with _t.

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted HR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by region
. stcox i.sgtf i.male ib1.imd ib1.eth2 household_size ///
>                          ib1.rural_urban5 ib1.start_week age1 age2 age3, stra
> ta(region)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -31096.493
Iteration 1:   log likelihood =  -31086.02
Iteration 2:   log likelihood = -31086.016
Refining estimates:
Iteration 0:   log likelihood = -31086.016

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     131,614
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(22)      =       20.95
Log likelihood  =   -31086.016                  Prob > chi2      =      0.5236

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.007658   .0351207     0.22   0.827     .9411209    1.078898
             |
        male |
          M  |   .9747147   .0339872    -0.73   0.463     .9103264    1.043657
             |
         imd |
          2  |   1.018038    .050739     0.36   0.720     .9232946    1.122504
          3  |    .917235   .0470219    -1.69   0.092     .8295526    1.014185
          4  |    1.01724   .0506332     0.34   0.731     .9226881    1.121481
5 most de..  |    .983143   .0626673    -0.27   0.790     .8676799    1.113971
             |
        eth2 |
      Other  |   .9879268   .0458603    -0.26   0.794       .90201    1.082027
    Missing  |   .9697991   .0407975    -0.73   0.466     .8930451     1.05315
             |
household_~e |   .9851613   .0165261    -0.89   0.373     .9532974     1.01809
             |
rural_urban5 |
Urban min..  |   1.004717   .0791315     0.06   0.952     .8609999    1.172423
Urban cit..  |   1.080875   .0727526     1.16   0.248     .9472879    1.233301
Rural tow..  |   1.018425   .0691791     0.27   0.788     .8914746    1.163454
Rural vil..  |   1.007728   .0625756     0.12   0.901     .8922512    1.138149
             |
  start_week |
23Nov-29Nov  |   1.151846   .0650666     2.50   0.012     1.031124    1.286702
30Nov-06Dec  |   1.088426   .0654123     1.41   0.159     .9674826    1.224487
07Dec-13Dec  |   1.011629   .0651563     0.18   0.858     .8916564    1.147743
14Dec-20Dec  |   1.124014   .0749822     1.75   0.080     .9862536    1.281017
21Dec-27Dec  |    1.14546   .0820963     1.89   0.058      .995345    1.318216
28Dec-04Jan  |   1.050369   .0817355     0.63   0.528      .901789     1.22343
             |
        age1 |   .9973996   .0035795    -0.73   0.468     .9904086     1.00444
        age2 |   1.008789    .011855     0.74   0.456     .9858194    1.032294
        age3 |   .9732415   .0324463    -0.81   0.416     .9116811    1.038959
------------------------------------------------------------------------------
                                                          Stratified by region

. 
.                          
.                          
. *********************************************************************
. /* Demographically adjusted HR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by region
. stcox i.sgtf i.male ib1.imd ib1.eth2 ib1.hh_total_cat ///
>                          ib1.rural_urban5 ib1.start_week ib2.agegroupA, strat
> a(region)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -30288.047
Iteration 1:   log likelihood = -30276.127
Iteration 2:   log likelihood = -30276.065
Iteration 3:   log likelihood = -30276.065
Iteration 4:   log likelihood = -30276.065
Refining estimates:
Iteration 0:   log likelihood = -30276.065

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      143,150                  Number of obs    =     128,576
No. of failures =        3,551
Time at risk    =      6498741
                                                LR chi2(23)      =       23.96
Log likelihood  =   -30276.065                  Prob > chi2      =      0.4058

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.002213   .0353517     0.06   0.950      .935266    1.073952
             |
        male |
          M  |   .9718853    .034299    -0.81   0.419     .9069328     1.04149
             |
         imd |
          2  |   1.023872   .0517033     0.47   0.640     .9273887    1.130393
          3  |   .9269818   .0480837    -1.46   0.144     .8373718    1.026181
          4  |   1.024375    .051637     0.48   0.633     .9280074     1.13075
5 most de..  |   .9956633   .0641449    -0.07   0.946     .8775552    1.129667
             |
        eth2 |
      Other  |   1.001309   .0469391     0.03   0.978     .9134103    1.097667
    Missing  |   .9815869   .0417303    -0.44   0.662     .9031119    1.066881
             |
hh_total_cat |
        3-5  |    .963467   .0339931    -1.05   0.291     .8990931     1.03245
       6-10  |   .4473098   .3165079    -1.14   0.256     .1117672    1.790204
             |
rural_urban5 |
Urban min..  |   .9960039    .079566    -0.05   0.960     .8516528    1.164822
Urban cit..  |   1.086573   .0740387     1.22   0.223     .9507322    1.241822
Rural tow..  |   1.017869   .0700259     0.26   0.797     .8894721    1.164801
Rural vil..  |   1.012972   .0636683     0.21   0.838     .8955647    1.145772
             |
  start_week |
23Nov-29Nov  |   1.171423   .0669809     2.77   0.006     1.047232    1.310342
30Nov-06Dec  |   1.096951   .0668457     1.52   0.129     .9734575    1.236111
07Dec-13Dec  |   1.015603   .0663532     0.24   0.813     .8935355    1.154347
14Dec-20Dec  |   1.133002   .0766228     1.85   0.065     .9923515    1.293588
21Dec-27Dec  |   1.167866   .0845188     2.14   0.032     1.013424    1.345844
28Dec-04Jan  |   1.046832   .0828286     0.58   0.563     .8964524    1.222437
             |
   agegroupA |
      0-<65  |   1.018358   .0605333     0.31   0.760     .9063654    1.144189
     75-<85  |   .9435855   .0888732    -0.62   0.538     .7845298    1.134888
        85+  |   1.012479   .1279777     0.10   0.922     .7903039    1.297114
------------------------------------------------------------------------------
                                                          Stratified by region

. 
. 
.                          
. ***********************************************************
. /* Fully adjusted HR - age as spline, continuous hh size */
. ***********************************************************
. 
. * Stratified by region
. stcox i.sgtf i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.obese4cat househol
> d_size ///
>                          ib1.rural_urban5 ib0.comorb_cat ib1.start_week age1 
> age2 age3, strata(region)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -4525.5063
Iteration 1:   log likelihood = -4515.0383
Iteration 2:   log likelihood = -4515.0251
Iteration 3:   log likelihood = -4515.0251
Refining estimates:
Iteration 0:   log likelihood = -4515.0251

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      23,686
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(28)      =       20.96
Log likelihood  =   -4515.0251                  Prob > chi2      =      0.8269

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.011442   .0834326     0.14   0.890     .8604512    1.188928
             |
        male |
          M  |   .9609875   .0793205    -0.48   0.630      .817446    1.129735
             |
         imd |
          2  |   1.079345   .1299262     0.63   0.526     .8525052    1.366545
          3  |   .9720508   .1204089    -0.23   0.819     .7625175    1.239162
          4  |   1.187849    .138845     1.47   0.141     .9446396    1.493675
5 most de..  |   1.169333   .1713721     1.07   0.286     .8773842    1.558426
             |
        eth2 |
      Other  |   1.071867   .1160068     0.64   0.521     .8669943    1.325151
    Missing  |   1.009913   .1006238     0.10   0.921     .8307563    1.227706
             |
smoke_nomi~2 |
     Former  |   1.040556   .1043523     0.40   0.692     .8548751    1.266568
             |
   obese4cat |
Obese I ..)  |   1.038668   .1154577     0.34   0.733     .8353292    1.291504
Obese II..)  |   .8578911   .1025474    -1.28   0.200     .6787102    1.084376
Obese II..)  |   .8268774   .0926902    -1.70   0.090     .6637801    1.030049
             |
household_~e |   .9691892   .0386071    -0.79   0.432     .8963992     1.04789
             |
rural_urban5 |
Urban min..  |   1.147154   .2025149     0.78   0.437     .8116216      1.6214
Urban cit..  |   1.041891   .1628697     0.26   0.793       .76694    1.415413
Rural tow..  |   .9229675   .1475235    -0.50   0.616     .6747357    1.262522
Rural vil..  |   .9301824   .1343932    -0.50   0.616     .7007871    1.234668
             |
  comorb_cat |
1 comorbi..  |   1.006488   .1839364     0.04   0.972     .7034782    1.440012
2+ comorb..  |   .9637328   .1614752    -0.22   0.826     .6939629    1.338373
             |
  start_week |
23Nov-29Nov  |   1.070659   .1429709     0.51   0.609     .8241109    1.390967
30Nov-06Dec  |   1.241979   .1703201     1.58   0.114     .9492567    1.624967
07Dec-13Dec  |   .9132618    .143417    -0.58   0.563     .6713115    1.242414
14Dec-20Dec  |   1.157024   .1804206     0.94   0.350     .8523344    1.570632
21Dec-27Dec  |   1.169719   .2015755     0.91   0.363     .8344412    1.639712
28Dec-04Jan  |   .9511903   .1818033    -0.26   0.793     .6539962    1.383438
             |
        age1 |   .9934661   .0085418    -0.76   0.446     .9768647     1.01035
        age2 |   1.030424    .028861     1.07   0.285     .9753823    1.088572
        age3 |   .9128726    .072453    -1.15   0.251     .7813613    1.066519
------------------------------------------------------------------------------
                                                          Stratified by region

. 
. 
. 
. **************************************************
. /* Fully adjusted HR - age grouped, cat hh size */
. **************************************************
. 
. * Stratified by region
. stcox i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.obes
> e4cat ///
>                          ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1
> .start_week, strata(region)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -4383.1771
Iteration 1:   log likelihood = -4369.6397
Iteration 2:   log likelihood = -4369.4343
Iteration 3:   log likelihood = -4369.3753
Iteration 4:   log likelihood = -4369.3536
Iteration 5:   log likelihood = -4369.3456
Iteration 6:   log likelihood = -4369.3427
Iteration 7:   log likelihood = -4369.3416
Iteration 8:   log likelihood = -4369.3412
Iteration 9:   log likelihood =  -4369.341
Iteration 10:  log likelihood =  -4369.341
Iteration 11:  log likelihood =  -4369.341
Iteration 12:  log likelihood = -4369.3409
Iteration 13:  log likelihood = -4369.3409
Iteration 14:  log likelihood = -4369.3409
Iteration 15:  log likelihood = -4369.3409
Iteration 16:  log likelihood = -4369.3409
Iteration 17:  log likelihood = -4369.3409
Iteration 18:  log likelihood = -4369.3409
Iteration 19:  log likelihood = -4369.3409
Iteration 20:  log likelihood = -4369.3409
Iteration 21:  log likelihood = -4369.3409
Iteration 22:  log likelihood = -4369.3409
Iteration 23:  log likelihood = -4369.3409
Iteration 24:  log likelihood = -4369.3409
Iteration 25:  log likelihood = -4369.3409
Iteration 26:  log likelihood = -4369.3409
Iteration 27:  log likelihood = -4369.3409
Refining estimates:
Iteration 0:   log likelihood = -4369.3409
Iteration 1:   log likelihood = -4369.3409
Iteration 2:   log likelihood = -4369.3409
Iteration 3:   log likelihood = -4369.3409
Iteration 4:   log likelihood = -4369.3409

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       25,689                  Number of obs    =      23,116
No. of failures =          632
Time at risk    =      1167532
                                                LR chi2(29)      =       27.67
Log likelihood  =   -4369.3409                  Prob > chi2      =      0.5355

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9970256   .0834592    -0.04   0.972     .8461625    1.174786
             |
   agegroupA |
      0-<65  |   1.224815   .1838915     1.35   0.177     .9125833    1.643873
     75-<85  |   .9735277   .2335305    -0.11   0.911     .6083612    1.557884
        85+  |   1.631381   .4500766     1.77   0.076     .9499924    2.801501
             |
        male |
          M  |   .9651095   .0808213    -0.42   0.672     .8190197    1.137258
             |
         imd |
          2  |   1.119555   .1363427     0.93   0.354     .8818278    1.421371
          3  |   1.000647    .125742     0.01   0.996     .7822011    1.280099
          4  |   1.186913   .1418965     1.43   0.152     .9389811    1.500309
5 most de..  |   1.208507   .1792308     1.28   0.202     .9036693    1.616177
             |
        eth2 |
      Other  |   1.096246   .1199944     0.84   0.401      .884578    1.358564
    Missing  |   1.020427   .1029949     0.20   0.841     .8372735    1.243645
             |
smoke_nomi~2 |
     Former  |   1.040083   .1059503     0.39   0.700     .8518412    1.269924
             |
   obese4cat |
Obese I ..)  |   1.041762   .1167609     0.37   0.715     .8363068    1.297691
Obese II..)  |   .8340237   .1014766    -1.49   0.136     .6570702    1.058632
Obese II..)  |   .7903865   .0907689    -2.05   0.041     .6310831    .9899026
             |
hh_total_cat |
        3-5  |   1.082886   .0908527     0.95   0.343     .9186875    1.276431
       6-10  |   3.73e-14   2.42e-07    -0.00   1.000            0           .
             |
rural_urban5 |
Urban min..  |   1.101346   .1997374     0.53   0.595     .7718843    1.571432
Urban cit..  |   1.055225   .1675055     0.34   0.735     .7730832    1.440337
Rural tow..  |   .9335018   .1515674    -0.42   0.672     .6790635    1.283276
Rural vil..  |   .9497658   .1393259    -0.35   0.725     .7124419    1.266145
             |
  comorb_cat |
1 comorbi..  |   .9692033   .1777888    -0.17   0.865     .6765067    1.388538
2+ comorb..  |   .9238442   .1550155    -0.47   0.637     .6649244    1.283587
             |
  start_week |
23Nov-29Nov  |    1.10689   .1509836     0.74   0.457     .8472231    1.446143
30Nov-06Dec  |   1.295337   .1811088     1.85   0.064      .984852    1.703704
07Dec-13Dec  |   .9431693   .1511398    -0.37   0.715     .6889495    1.291195
14Dec-20Dec  |   1.194568   .1900383     1.12   0.264     .8745752    1.631641
21Dec-27Dec  |   1.221355   .2138791     1.14   0.254     .8665285    1.721477
28Dec-04Jan  |   .9841067   .1913248    -0.08   0.934     .6722892     1.44055
------------------------------------------------------------------------------
                                                          Stratified by region

.                          
.                          
.                          
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -6366.0917
Iteration 1:   log likelihood = -6362.5744
Iteration 2:   log likelihood = -6362.5723
Refining estimates:
Iteration 0:   log likelihood = -6362.5723

Cox regression -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,323
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(11)      =        7.04
Log likelihood  =   -6362.5723                  Prob > chi2      =      0.7959

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.008109   .0791597     0.10   0.918     .8643079    1.175834
             |
  comorb_cat |
1 comorbi..  |   1.032533   .1830889     0.18   0.857     .7294049    1.461635
2+ comorb..  |   1.003271   .1634508     0.02   0.984     .7290244    1.380684
             |
         imd |
          2  |   1.061369   .1221647     0.52   0.605     .8470173    1.329966
          3  |   .9738542   .1145362    -0.23   0.822     .7733624    1.226323
          4  |   1.181833    .131328     1.50   0.133     .9505358    1.469412
5 most de..  |   1.156335    .161019     1.04   0.297     .8801456    1.519194
             |
smoke_nomi~2 |
     Former  |   1.076726   .1038785     0.77   0.444     .8912188    1.300846
        age1 |   .9916341   .0080805    -1.03   0.303     .9759223    1.007599
        age2 |   1.038121   .0276474     1.40   0.160     .9853226    1.093748
        age3 |   .8914536   .0673652    -1.52   0.128     .7687325    1.033766
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -4872.2391
Iteration 1:   log likelihood = -4868.7087
Iteration 2:   log likelihood = -4868.7064
Refining estimates:
Iteration 0:   log likelihood = -4868.7064

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,323
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(11)      =        7.07
Log likelihood  =   -4868.7064                  Prob > chi2      =      0.7938

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.007022   .0790925     0.09   0.929     .8633459    1.174609
             |
  comorb_cat |
1 comorbi..  |   1.034849   .1835308     0.19   0.847     .7309977    1.465001
2+ comorb..  |   1.003644   .1635418     0.02   0.982     .7292525    1.381279
             |
         imd |
          2  |   1.060848   .1221647     0.51   0.608     .8465074     1.32946
          3  |   .9768544   .1149467    -0.20   0.842     .7756551    1.230243
          4  |   1.183326    .131543     1.51   0.130     .9516594    1.471388
5 most de..  |   1.157862   .1613058     1.05   0.293     .8811969     1.52139
             |
smoke_nomi~2 |
     Former  |   1.074659   .1037056     0.75   0.456     .8894655    1.298412
        age1 |   .9917087   .0080862    -1.02   0.307     .9759859    1.007685
        age2 |   1.038163   .0276611     1.41   0.160     .9853398    1.093819
        age3 |   .8909379   .0673543    -1.53   0.127     .7682405    1.033232
------------------------------------------------------------------------------
                                                             Stratified by stp

.                          
. * Stratified by region
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3, strata(regi
> on)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -4525.5063
Iteration 1:   log likelihood = -4522.7356
Iteration 2:   log likelihood = -4522.7341
Refining estimates:
Iteration 0:   log likelihood = -4522.7341

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      23,686
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(11)      =        5.54
Log likelihood  =   -4522.7341                  Prob > chi2      =      0.9020

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.013538    .083563     0.16   0.870      .862306    1.191294
             |
  comorb_cat |
1 comorbi..  |   1.005437   .1836718     0.03   0.976      .702843    1.438305
2+ comorb..  |   .9627168   .1612414    -0.23   0.821     .6933211    1.336789
             |
         imd |
          2  |   1.076004   .1294695     0.61   0.543     .8499506    1.362179
          3  |   .9747023   .1206935    -0.21   0.836     .7646647    1.242433
          4  |   1.188144   .1388184     1.48   0.140     .9449695    1.493896
5 most de..  |   1.170058   .1714474     1.07   0.284     .8779737    1.559312
             |
smoke_nomi~2 |
     Former  |   1.037303   .1039888     0.37   0.715     .8522628    1.262519
        age1 |   .9934381   .0085401    -0.77   0.444     .9768401    1.010318
        age2 |   1.030484   .0288506     1.07   0.283     .9754615    1.088611
        age3 |   .9124705   .0723872    -1.15   0.248      .781074    1.065971
------------------------------------------------------------------------------
                                                          Stratified by region

. 
. * Plot scaled schoenfeld residuals
. estat phtest, plot(1.sgtf)

. graph export ./output/minadj_cox_shoen.svg, as(svg) replace
(note: file ./output/minadj_cox_shoen.svg not found)
(file ./output/minadj_cox_shoen.svg written in SVG format)

. 
. * KM plot
. sts graph,      surv by(sgtf) ///
>                         ylabel(0.8(0.05)1) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/minadj_cox_km.svg, as(svg) replace
(note: file ./output/minadj_cox_km.svg not found)
(file ./output/minadj_cox_km.svg written in SVG format)

.                 
. * Smoothed hazard plot
. sts graph,      haz by(sgtf) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/minadj_cox_haz.svg, as(svg) replace
(note: file ./output/minadj_cox_haz.svg not found)
(file ./output/minadj_cox_haz.svg written in SVG format)

. 
. * Interaction with time
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3, strata(regio
> n) tvc(i.sgtf)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -31096.493
Iteration 1:   log likelihood = -31088.814
Iteration 2:   log likelihood = -31088.798
Iteration 3:   log likelihood = -31088.798
Refining estimates:
Iteration 0:   log likelihood = -31088.798

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      146,510                  Number of obs    =     131,614
No. of failures =        3,633
Time at risk    =      6651843
                                                LR chi2(13)      =       15.39
Log likelihood  =   -31088.798                  Prob > chi2      =      0.2836

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
main         |
        sgtf |
        VOC  |   .9152557   .0588114    -1.38   0.168     .8069506    1.038097
             |
  comorb_cat |
1 comorbi..  |    .871129   .0657456    -1.83   0.068     .7513475    1.010006
2+ comorb..  |   .8886366   .0606609    -1.73   0.084     .7773538     1.01585
             |
         imd |
          2  |   1.017158   .0506924     0.34   0.733     .9225005    1.121527
          3  |   .9168776   .0470012    -1.69   0.090     .8292336    1.013785
          4  |   1.017293   .0506319     0.34   0.730     .9227425    1.121531
5 most de..  |   .9837732   .0627046    -0.26   0.797     .8682411    1.114679
             |
smoke_nomiss |
     Former  |    1.18922   .1373683     1.50   0.134     .9482845     1.49137
    Current  |   .9708841   .0527407    -0.54   0.586      .872827    1.079957
             |
        age1 |   .9975134   .0035798    -0.69   0.488     .9905216    1.004554
        age2 |   1.008414   .0118503     0.71   0.476     .9854536     1.03191
        age3 |    .974262   .0324796    -0.78   0.434     .9126384    1.040047
-------------+----------------------------------------------------------------
tvc          |
        sgtf |
        VOC  |   1.003678   .0020659     1.78   0.074     .9996372    1.007735
------------------------------------------------------------------------------
                                                          Stratified by region
Note: Variables in tvc equation interacted with _t.

. 
. 
. * Stratified by UTLA
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3, strata(utla
> _group)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -3278.2477
Iteration 1:   log likelihood = -3274.9672
Iteration 2:   log likelihood = -3274.9653
Refining estimates:
Iteration 0:   log likelihood = -3274.9653

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       26,323                  Number of obs    =      26,317
No. of failures =          649
Time at risk    =      1196769
                                                LR chi2(11)      =        6.56
Log likelihood  =   -3274.9653                  Prob > chi2      =      0.8332

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9963235   .0786111    -0.05   0.963     .8535708     1.16295
             |
  comorb_cat |
1 comorbi..  |   1.035168   .1843394     0.19   0.846     .7301824     1.46754
2+ comorb..  |   1.009943   .1652056     0.06   0.952     .7329223    1.391668
             |
         imd |
          2  |   1.059612   .1223739     0.50   0.616     .8449716    1.328775
          3  |   .9702878   .1145342    -0.26   0.798     .7698807    1.222863
          4  |   1.181883   .1319479     1.50   0.134     .9496089    1.470972
5 most de..  |   1.138485   .1593307     0.93   0.354       .86537    1.497796
             |
smoke_nomi~2 |
     Former  |   1.074255   .1041479     0.74   0.460     .8883506    1.299064
        age1 |   .9912825   .0081225    -1.07   0.285     .9754899    1.007331
        age2 |   1.037857   .0277732     1.39   0.165     .9848252    1.093744
        age3 |   .8945365   .0679234    -1.47   0.142     .7708416     1.03808
------------------------------------------------------------------------------
                                                      Stratified by utla_group

. 
.                          
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 closed on:  13 Feb 2021, 17:44:50
-------------------------------------------------------------------------------
