-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 opened on:  12 Feb 2021, 16:20:40

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 12 Feb 2021)

. 
. noi di "SUBSETTING ON COX CENSORED POPULATION"
SUBSETTING ON COX CENSORED POPULATION

. keep if cox_pop==1
(2,998 observations deleted)

. 
. tab sgtf cox_death, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Exposure: |
      0=VOC; |    Outcome for Cox
   1=non-VOC |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    71,191      1,337 |    72,528 
             |     98.16       1.84 |    100.00 
-------------+----------------------+----------
         VOC |    71,341      1,283 |    72,624 
             |     98.23       1.77 |    100.00 
-------------+----------------------+----------
Unclassified |    17,610        312 |    17,922 
             |     98.26       1.74 |    100.00 
-------------+----------------------+----------
       Blank |    18,096        392 |    18,488 
             |     97.88       2.12 |    100.00 
-------------+----------------------+----------
       Total |   178,238      3,324 |   181,562 
             |     98.17       1.83 |    100.00 

. 
. 
. *******************
. /* Unadjusted HR */
. *******************
. 
. stset stime_death, origin(study_start) fail(cox_death) scale(1) id(patient_id
> )

                id:  patient_id
     failure event:  cox_death != 0 & cox_death < .
obs. time interval:  (stime_death[_n-1], stime_death]
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time study_start

------------------------------------------------------------------------------
    181,562  total observations
          0  exclusions
------------------------------------------------------------------------------
    181,562  observations remaining, representing
    181,562  subjects
      3,324  failures in single-failure-per-subject data
  6,126,517  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        59

. 
. stcox i.sgtf

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -38988.546
Iteration 1:   log likelihood = -38983.219
Iteration 2:   log likelihood = -38983.197
Iteration 3:   log likelihood = -38983.197
Refining estimates:
Iteration 0:   log likelihood = -38983.197

Cox regression -- Breslow method for ties

No. of subjects =      181,562                  Number of obs    =     181,562
No. of failures =        3,324
Time at risk    =      6126517
                                                LR chi2(3)       =       10.70
Log likelihood  =   -38983.197                  Prob > chi2      =      0.0135

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9587651   .0374701    -1.08   0.281     .8880674    1.035091
Unclassif~d  |   .9426099   .0592652    -0.94   0.347     .8333241    1.066228
      Blank  |   1.151337    .066129     2.45   0.014     1.028756    1.288525
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -31334.217
Iteration 1:   log likelihood = -31328.908
Iteration 2:   log likelihood = -31328.887
Iteration 3:   log likelihood = -31328.887
Refining estimates:
Iteration 0:   log likelihood = -31328.887

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      181,562                  Number of obs    =     181,562
No. of failures =        3,324
Time at risk    =      6126517
                                                LR chi2(3)       =       10.66
Log likelihood  =   -31328.887                  Prob > chi2      =      0.0137

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9590474    .037483    -1.07   0.285     .8883254      1.0354
Unclassif~d  |   .9425048     .05926    -0.94   0.346     .8332288    1.066112
      Blank  |   1.151212   .0661248     2.45   0.014     1.028638    1.288391
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. * Plot scaled schoenfeld residuals
. estat phtest, plot(1.sgtf)

. graph export ./output/unadj_cox_shoen.svg, as(svg) replace
(note: file ./output/unadj_cox_shoen.svg not found)
(file ./output/unadj_cox_shoen.svg written in SVG format)

. 
. * KM plot
. sts graph,      surv by(sgtf) ///
>                         ylabel(0.8(0.05)1) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_km.svg, as(svg) replace
(note: file ./output/unadj_cox_km.svg not found)
(file ./output/unadj_cox_km.svg written in SVG format)

.                 
. * Smoothed hazard plot
. sts graph,      haz by(sgtf) ///
>                         legend(label(1 "non-VOC") label(2 "VOC"))

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

. graph export ./output/unadj_cox_haz.svg, as(svg) replace
(note: file ./output/unadj_cox_haz.svg not found)
(file ./output/unadj_cox_haz.svg written in SVG format)

. 
. * Interaction with time
. stcox i.sgtf, tvc(i.sgtf) strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -31334.217
Iteration 1:   log likelihood =  -31327.32
Iteration 2:   log likelihood = -31327.282
Iteration 3:   log likelihood = -31327.282
Refining estimates:
Iteration 0:   log likelihood = -31327.282

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      181,562                  Number of obs    =     181,562
No. of failures =        3,324
Time at risk    =      6126517
                                                LR chi2(6)       =       13.87
Log likelihood  =   -31327.282                  Prob > chi2      =      0.0311

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
main         |
        sgtf |
        VOC  |   .9193474   .0644181    -1.20   0.230     .8013763    1.054685
Unclassif~d  |   1.045431   .1155659     0.40   0.688     .8417831    1.298346
      Blank  |   1.069761   .1108373     0.65   0.515     .8731614    1.310628
-------------+----------------------------------------------------------------
tvc          |
        sgtf |
        VOC  |   1.002047   .0028184     0.73   0.467     .9965382    1.007586
Unclassif~d  |   .9948379    .004589    -1.12   0.262     .9858842    1.003873
      Blank  |    1.00353   .0041183     0.86   0.391     .9954905    1.011634
------------------------------------------------------------------------------
                                                             Stratified by stp
Note: Variables in tvc equation interacted with _t.

. 
. 
. *********************************************************************
. /* Demographically adjusted HR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.male ib1.imd ib1.eth5 household_size ///
>                          ib1.rural_urban5 ib1.start_week age1 age2 age3, stra
> ta(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -22234.425
Iteration 1:   log likelihood =  -22217.92
Iteration 2:   log likelihood =   -22217.9
Iteration 3:   log likelihood =   -22217.9
Refining estimates:
Iteration 0:   log likelihood =   -22217.9

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      136,182                  Number of obs    =     136,182
No. of failures =        2,433
Time at risk    =      4591838
                                                LR chi2(26)      =       33.05
Log likelihood  =     -22217.9                  Prob > chi2      =      0.1607

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    .951446   .0434806    -1.09   0.276     .8699307      1.0406
Unclassif~d  |   .9554104   .0698859    -0.62   0.533     .8278024    1.102689
      Blank  |   1.140562   .0767736     1.95   0.051     .9995918    1.301413
             |
        male |
          M  |   1.089843   .0442142     2.12   0.034     1.006541     1.18004
             |
         imd |
          2  |   .9983667   .0580665    -0.03   0.978     .8908056    1.118915
          3  |   .9667371   .0564039    -0.58   0.562     .8622742    1.083856
          4  |    .949338   .0559197    -0.88   0.377     .8458274    1.065516
5 most de..  |   .9894549   .0730713    -0.14   0.886     .8561201    1.143556
             |
        eth5 |
South Asian  |   .8887172   .0868676    -1.21   0.227     .7337751    1.076377
      Black  |   .8936255   .0884868    -1.14   0.256     .7359861    1.085029
      Mixed  |   .9169091   .0892485    -0.89   0.373     .7576585    1.109632
      Other  |   1.073164   .0711166     1.07   0.287     .9424502    1.222006
             |
household_~e |    .990297   .0193959    -0.50   0.619      .953002    1.029051
             |
rural_urban5 |
Urban min..  |   1.078941   .0968051     0.85   0.397     .9049522     1.28638
Urban cit..  |   1.059997   .0833253     0.74   0.459     .9086411    1.236564
Rural tow..  |   .9687175   .0771887    -0.40   0.690     .8286521    1.132458
Rural vil..  |   1.008607   .0730191     0.12   0.906     .8751825    1.162373
             |
  start_week |
23Nov-29Nov  |   .8496699   .0533381    -2.60   0.009     .7513046    .9609138
30Nov-06Dec  |   .9290624   .0610917    -1.12   0.263     .8167197    1.056858
07Dec-13Dec  |   .8434046   .0614693    -2.34   0.019     .7311365    .9729119
14Dec-20Dec  |   .9383614   .0719351    -0.83   0.407     .8074521    1.090495
21Dec-27Dec  |   .8649486   .0767039    -1.64   0.102     .7269516    1.029141
28Dec-04Jan  |   .9678454   .0948857    -0.33   0.739     .7986487    1.172887
             |
        age1 |   1.005584   .0042875     1.31   0.192      .997216    1.014023
        age2 |   .9827768   .0135082    -1.26   0.206     .9566546    1.009612
        age3 |   1.048964   .0406421     1.23   0.217     .9722561    1.131724
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
.                          
.                          
. *********************************************************************
. /* Demographically adjusted HR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.male ib1.imd ib1.eth5 ib1.hh_total_cat ///
>                          ib1.rural_urban5 ib1.start_week i.agegroup, strata(s
> tp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -21648.722
Iteration 1:   log likelihood = -21626.025
Iteration 2:   log likelihood = -21625.983
Iteration 3:   log likelihood = -21625.983
Refining estimates:
Iteration 0:   log likelihood = -21625.983

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      133,134                  Number of obs    =     133,134
No. of failures =        2,375
Time at risk    =      4489845
                                                LR chi2(31)      =       45.48
Log likelihood  =   -21625.983                  Prob > chi2      =      0.0452

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9467414   .0438229    -1.18   0.237     .8646311    1.036649
Unclassif~d  |   .9631063   .0709771    -0.51   0.610     .8335738    1.112767
      Blank  |   1.139893   .0776765     1.92   0.055     .9973782    1.302771
             |
        male |
          M  |   1.084526   .0445309     1.98   0.048     1.000667    1.175413
             |
         imd |
          2  |   .9870097   .0581836    -0.22   0.824     .8793133    1.107896
          3  |   .9631434   .0567789    -0.64   0.524     .8580471    1.081112
          4  |   .9466489   .0563542    -0.92   0.357     .8423968    1.063803
5 most de..  |   .9751223   .0731132    -0.34   0.737      .841855    1.129486
             |
        eth5 |
South Asian  |   .8875319   .0879407    -1.20   0.229     .7308748    1.077767
      Black  |    .880434   .0888106    -1.26   0.207     .7224952    1.072899
      Mixed  |   .9153421   .0903071    -0.90   0.370     .7544048    1.110612
      Other  |   1.077996   .0721529     1.12   0.262     .9454624    1.229109
             |
hh_total_cat |
        3-5  |   .9847765   .0404429    -0.37   0.709      .908616    1.067321
       6-10  |    .567968    .402001    -0.80   0.424     .1418579     2.27402
             |
rural_urban5 |
Urban min..  |   1.088921   .0989258     0.94   0.348     .9113116    1.301146
Urban cit..  |    1.04648    .083645     0.57   0.570     .8947352    1.223961
Rural tow..  |   .9844961   .0793737    -0.19   0.846     .8405954    1.153031
Rural vil..  |   1.013351   .0744115     0.18   0.857     .8775167    1.170213
             |
  start_week |
23Nov-29Nov  |   .8495221   .0540504    -2.56   0.010     .7499244    .9623475
30Nov-06Dec  |   .9367825   .0622905    -0.98   0.326     .8223163    1.067182
07Dec-13Dec  |    .838012    .062049    -2.39   0.017     .7248107    .9688932
14Dec-20Dec  |   .9384392   .0729625    -0.82   0.414     .8057982    1.092914
21Dec-27Dec  |   .8772427   .0785659    -1.46   0.144     .7360141    1.045571
28Dec-04Jan  |   .9933514   .0980339    -0.07   0.946     .8186491    1.205336
             |
    agegroup |
     18-<30  |   1.127016    .076665     1.76   0.079     .9863414    1.287754
     30-<40  |   1.150531    .081465     1.98   0.048     1.001447     1.32181
     40-<50  |   .9691217   .0732482    -0.41   0.678     .8356852    1.123864
     50-<60  |   .9615888   .0715606    -0.53   0.599     .8310817     1.11259
     60-<70  |   1.179126   .0884165     2.20   0.028     1.017965    1.365801
     70-<80  |   1.086439   .0914817     0.98   0.325     .9211521    1.281384
        80+  |   .9940207    .104728    -0.06   0.955     .8085642    1.222014
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. 
.                          
. ***********************************************************
. /* Fully adjusted HR - age as spline, continuous hh size */
. ***********************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.obese4cat household
> _size ///
>                          ib1.rural_urban5 ib0.comorb_cat ib1.start_week age1 
> age2 age3, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -22234.425
Iteration 1:   log likelihood = -22215.215
Iteration 2:   log likelihood = -22215.193
Iteration 3:   log likelihood = -22215.193
Refining estimates:
Iteration 0:   log likelihood = -22215.193

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      136,182                  Number of obs    =     136,182
No. of failures =        2,433
Time at risk    =      4591838
                                                LR chi2(33)      =       38.46
Log likelihood  =   -22215.193                  Prob > chi2      =      0.2359

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9513222   .0434769    -1.09   0.275      .869814    1.040468
Unclassif~d  |   .9552194   .0698738    -0.63   0.531     .8276337    1.102473
      Blank  |   1.140391    .076765     1.95   0.051     .9994375    1.301225
             |
        male |
          M  |    1.08955   .0442038     2.11   0.035     1.006267    1.179726
             |
         imd |
          2  |   .9984314   .0580716    -0.03   0.978      .890861    1.118991
          3  |    .966432   .0563872    -0.59   0.558     .8620001    1.083516
          4  |   .9493975   .0559252    -0.88   0.378      .845877    1.065587
5 most de..  |   .9900064   .0731153    -0.14   0.892     .8565919      1.1442
             |
        eth5 |
South Asian  |   .8886268   .0868595    -1.21   0.227     .7336992    1.076269
      Black  |   .8943681   .0885624    -1.13   0.260     .7365943    1.085936
      Mixed  |   .9171726   .0892767    -0.89   0.374     .7578721    1.109957
      Other  |    1.07285    .071098     1.06   0.289     .9421711    1.221654
             |
smoke_nomiss |
     Former  |   1.111281   .1532286     0.77   0.444     .8481177    1.456101
    Current  |   1.077333   .0658049     1.22   0.223     .9557793    1.214346
             |
   obese4cat |
Obese I ..)  |   1.000783   .0574891     0.01   0.989     .8942176    1.120047
Obese II..)  |    1.09104   .0610246     1.56   0.119     .9777572    1.217449
Obese II..)  |   .9876683   .0528857    -0.23   0.817     .8892681    1.096957
             |
household_~e |   .9901943   .0193958    -0.50   0.615     .9528997    1.028949
             |
rural_urban5 |
Urban min..  |   1.079083   .0968199     0.85   0.396     .9050686    1.286555
Urban cit..  |   1.060243   .0833461     0.74   0.457     .9088499    1.236855
Rural tow..  |   .9690256   .0772175    -0.39   0.693     .8289085    1.132828
Rural vil..  |   1.009124   .0730592     0.13   0.900     .8756258    1.162975
             |
  comorb_cat |
1 comorbi..  |   .9505059   .0844808    -0.57   0.568     .7985464    1.131383
2+ comorb..  |   .9559714   .0770012    -0.56   0.576     .8163617    1.119456
             |
  start_week |
23Nov-29Nov  |   .8494846   .0533276    -2.60   0.009     .7511386     .960707
30Nov-06Dec  |   .9290592   .0610934    -1.12   0.263     .8167136    1.056859
07Dec-13Dec  |   .8435949   .0614844    -2.33   0.020     .7312993    .9731341
14Dec-20Dec  |   .9382302   .0719275    -0.83   0.406      .807335    1.090348
21Dec-27Dec  |   .8654353   .0767488    -1.63   0.103     .7273578    1.029725
28Dec-04Jan  |   .9676974    .094872    -0.33   0.738     .7985253     1.17271
             |
        age1 |   1.005577   .0042878     1.30   0.192      .997208    1.014016
        age2 |   .9827781   .0135086    -1.26   0.206     .9566551    1.009614
        age3 |   1.048993    .040643     1.23   0.217     .9722831    1.131754
------------------------------------------------------------------------------
                                                             Stratified by stp

. 
. 
. 
. **************************************************
. /* Fully adjusted HR - age grouped, cat hh size */
. **************************************************
. 
. * Stratified by STP
. stcox i.sgtf i.agegroup i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.obese4ca
> t ///
>                          ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1
> .start_week, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -21648.722
Iteration 1:   log likelihood = -21623.754
Iteration 2:   log likelihood =  -21623.71
Iteration 3:   log likelihood =  -21623.71
Refining estimates:
Iteration 0:   log likelihood =  -21623.71

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      133,134                  Number of obs    =     133,134
No. of failures =        2,375
Time at risk    =      4489845
                                                LR chi2(38)      =       50.02
Log likelihood  =    -21623.71                  Prob > chi2      =      0.0917

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9465544   .0438164    -1.19   0.235     .8644565    1.036449
Unclassif~d  |    .963035   .0709737    -0.51   0.609     .8335089    1.112689
      Blank  |   1.139641   .0776626     1.92   0.055     .9971524     1.30249
             |
    agegroup |
     18-<30  |   1.126543   .0766443     1.75   0.080     .9859074    1.287239
     30-<40  |   1.150618   .0814744     1.98   0.048     1.001517    1.321917
     40-<50  |   .9690379   .0732454    -0.42   0.677     .8356071    1.123775
     50-<60  |   .9607403   .0715002    -0.54   0.590     .8303436    1.111614
     60-<70  |   1.179317   .0884388     2.20   0.028     1.018117     1.36604
     70-<80  |    1.08668   .0915093     0.99   0.324     .9213443    1.281685
        80+  |   .9936652   .1046944    -0.06   0.952      .808269    1.221587
             |
        male |
          M  |   1.084141   .0445165     1.97   0.049     1.000309    1.174999
             |
         imd |
          2  |   .9868825   .0581778    -0.22   0.823      .879197    1.107757
          3  |   .9628502   .0567629    -0.64   0.521     .8577839    1.080786
          4  |   .9465876   .0563525    -0.92   0.357     .8423388    1.063738
5 most de..  |    .975461   .0731419    -0.33   0.740     .8421417    1.129886
             |
        eth5 |
South Asian  |   .8873897   .0879278    -1.21   0.228     .7307559    1.077597
      Black  |   .8809996   .0888697    -1.26   0.209     .7229559    1.073593
      Mixed  |   .9154857   .0903236    -0.89   0.371     .7545193    1.110792
      Other  |   1.077842   .0721453     1.12   0.263     .9453228    1.228939
             |
smoke_nomiss |
     Former  |     1.0958   .1539507     0.65   0.515     .8320411    1.443172
    Current  |   1.073723   .0664422     1.15   0.250     .9510862    1.212174
             |
   obese4cat |
Obese I ..)  |   1.017776   .0589566     0.30   0.761     .9085417    1.140144
Obese II..)  |     1.0908   .0618664     1.53   0.125     .9760403    1.219052
Obese II..)  |   .9925327   .0538323    -0.14   0.890     .8924378    1.103854
             |
hh_total_cat |
        3-5  |   .9846891   .0404401    -0.38   0.707     .9085341    1.067228
       6-10  |   .5711422    .404259    -0.79   0.429     .1426451    2.286817
             |
rural_urban5 |
Urban min..  |   1.088979   .0989333     0.94   0.348     .9113561     1.30122
Urban cit..  |   1.046707   .0836645     0.57   0.568     .8949268    1.224229
Rural tow..  |   .9846358   .0793895    -0.19   0.848     .8407071    1.153205
Rural vil..  |   1.013731   .0744426     0.19   0.853     .8778401    1.170658
             |
  comorb_cat |
1 comorbi..  |   .9772071   .0884242    -0.25   0.799     .8183974    1.166834
2+ comorb..  |   .9738857   .0800621    -0.32   0.748     .8289563    1.144154
             |
  start_week |
23Nov-29Nov  |   .8494463   .0540468    -2.56   0.010     .7498552    .9622644
30Nov-06Dec  |   .9368118   .0622947    -0.98   0.326     .8223382    1.067221
07Dec-13Dec  |   .8383088    .062072    -2.38   0.017     .7250657    .9692386
14Dec-20Dec  |   .9384137   .0729627    -0.82   0.414     .8057725    1.092889
21Dec-27Dec  |   .8776245   .0786017    -1.46   0.145     .7363318    1.046029
28Dec-04Jan  |   .9931839   .0980184    -0.07   0.945     .8185094    1.205135
------------------------------------------------------------------------------
                                                             Stratified by stp

.                          
.                          
.                          
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -38988.546
Iteration 1:   log likelihood = -38979.021
Iteration 2:   log likelihood = -38978.999
Iteration 3:   log likelihood = -38978.999
Refining estimates:
Iteration 0:   log likelihood = -38978.999

Cox regression -- Breslow method for ties

No. of subjects =      181,562                  Number of obs    =     181,562
No. of failures =        3,324
Time at risk    =      6126517
                                                LR chi2(14)      =       19.09
Log likelihood  =   -38978.999                  Prob > chi2      =      0.1614

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9587205   .0374699    -1.08   0.281     .8880231    1.035046
Unclassif~d  |    .942413   .0592554    -0.94   0.346     .8331457    1.066011
      Blank  |   1.150421   .0660785     2.44   0.015     1.027934    1.287504
             |
  comorb_cat |
1 comorbi..  |   .9180338    .069321    -1.13   0.257     .7917429    1.064469
2+ comorb..  |   .9357257   .0638318    -0.97   0.330     .8186207    1.069583
             |
         imd |
          2  |   .9972736   .0495657    -0.05   0.956     .9047082     1.09931
          3  |   .9507065   .0476882    -1.01   0.314     .8616869    1.048922
          4  |   .9528417   .0479085    -0.96   0.337     .8634212    1.051523
5 most de..  |   .9943679   .0625262    -0.09   0.928     .8790696    1.124789
             |
smoke_nomiss |
     Former  |   1.054749   .1285254     0.44   0.662     .8306672    1.339281
    Current  |   1.075823   .0561379     1.40   0.161     .9712345    1.191675
             |
        age1 |   1.005934   .0036488     1.63   0.103     .9988083    1.013111
        age2 |   .9791195   .0114837    -1.80   0.072     .9568687    1.001888
        age3 |   1.060481   .0351209     1.77   0.076     .9938322      1.1316
------------------------------------------------------------------------------

. 
. * Stratified by STP
. stcox i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3, strata(stp)

         failure _d:  cox_death
   analysis time _t:  (stime_death-origin)
             origin:  time study_start
                 id:  patient_id

Iteration 0:   log likelihood = -31334.217
Iteration 1:   log likelihood = -31324.701
Iteration 2:   log likelihood = -31324.678
Iteration 3:   log likelihood = -31324.678
Refining estimates:
Iteration 0:   log likelihood = -31324.678

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      181,562                  Number of obs    =     181,562
No. of failures =        3,324
Time at risk    =      6126517
                                                LR chi2(14)      =       19.08
Log likelihood  =   -31324.678                  Prob > chi2      =      0.1620

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9590137   .0374833    -1.07   0.284     .8882913    1.035367
Unclassif~d  |   .9423076   .0592502    -0.95   0.345       .83305    1.065895
      Blank  |   1.150353   .0660773     2.44   0.015     1.027868    1.287434
             |
  comorb_cat |
1 comorbi..  |   .9173591    .069273    -1.14   0.253     .7911561    1.063694
2+ comorb..  |    .935558   .0638228    -0.98   0.329     .8184696    1.069397
             |
         imd |
          2  |   .9968479   .0495471    -0.06   0.949     .9043176    1.098846
          3  |   .9502999   .0476698    -1.02   0.310     .8613149    1.048478
          4  |   .9526669   .0479006    -0.96   0.335     .8632611    1.051332
5 most de..  |   .9935034   .0624735    -0.10   0.917     .8783025    1.123814
             |
smoke_nomiss |
     Former  |   1.054056   .1284512     0.43   0.666     .8301047    1.338426
    Current  |   1.075305   .0561143     1.39   0.164     .9707604    1.191108
             |
        age1 |   1.005954   .0036489     1.64   0.102     .9988273    1.013131
        age2 |   .9790491    .011483    -1.81   0.071     .9567996    1.001816
        age3 |   1.060691   .0351271     1.78   0.075     .9940301    1.131823
------------------------------------------------------------------------------
                                                             Stratified by stp

.                          
. 
.                          
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_models.log
  log type:  text
 closed on:  12 Feb 2021, 16:26:56
-------------------------------------------------------------------------------
