-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 opened on:  12 Feb 2021, 16:49:39

. 
. clear

. 
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 12 Feb 2021)

. 
. 
. 
. 
. *****************************************************************************
> ***
. *       PROGRAMS TO AUTOMATE TABULATIONS
. *
. *****************************************************************************
> ***
. * All below code from K Baskharan 
. * Generic code to output one row of table
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)
  4.         
.         sum `variable' if `variable' `condition'
  5.         **K Wing additional code to aoutput variable category labels**
.         local level=substr("`condition'",3,.)
  6.         local lab: label `variable'Lab `level'
  7.         file write tablecontent (" `lab'") _tab
  8.         
.         /*this is the overall column*/
.         cou if `variable' `condition'
  9.         local rowdenom = r(N)
 10.         local colpct = 100*(r(N)/`overalldenom')
 11.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
 12. 
.         /*this loops through groups*/
.         forvalues i=0/1{
 13.         cou if sgtf == `i'
 14.         local rowdenom = r(N)
 15.         cou if sgtf == `i' & `variable' `condition'
 16.         local pct = 100*(r(N)/`rowdenom') 
 17.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 18.         }
 19.         
.         file write tablecontent _n
 20. end

. 
. 
. * Output one row of table for co-morbidities and meds
. * This puts it all on the same row, is rohini's edit
. 
. cap prog drop generaterow2 

. program define generaterow2
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)5
  4.         
.         cou if `variable' `condition'
  5.         local rowdenom = r(N)
  6.         local colpct = 100*(r(N)/`overalldenom')
  7.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
  8. 
.         forvalues i=0/1{
  9.         cou if sgtf == `i'
 10.         local rowdenom = r(N)
 11.         cou if sgtf == `i' & `variable' `condition'
 12.         local pct = 100*(r(N)/`rowdenom') 
 13.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 14.         }
 15.         
.         file write tablecontent _n
 16. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines a program (SAS macro/R function equivalent), generate row
> the syntax row specifies two inputs for the program: 
>         a VARNAME which is your variable 
>         a CONDITION which is a string of some condition you impose 
>         
> the program counts if variable and condition and returns the counts
> column percentages are then automatically generated
> this is then written to the text file 'tablecontent' 
> the number followed by space, brackets, formatted pct, end bracket and then t
> ab
> the format %3.1f specifies length of 3, followed by 1 dp. 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to output one section (varible) within table (calls above)
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) min(real) max(real) [missing]
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
.         forvalues varlevel = `min'/`max'{ 
  5.                 generaterow, variable(`variable') condition("==`varlevel'"
> )
  6.         }
  7.         
.         if "`missing'"!="" generaterow, variable(`variable') condition("== 12
> ")
  8.         
. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines program tabulate variable 
> syntax is : 
>         - a VARNAME which you stick in variable 
>         - a numeric minimum 
>         - a numeric maximum 
>         - optional missing option, default value is . 
> forvalues lowest to highest of the variable, manually set for each var
> run the generate row program for the level of the variable 
> if there is a missing specified, then run the generate row for missing vals
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to qui summarize a continous variable 
. 
. cap prog drop summarizevariable 

. prog define summarizevariable
  1. syntax, variable(varname) 
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
. 
.         qui summarize `variable', d
  5.         file write tablecontent ("Mean (SD)") _tab 
  6.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
  7.         
.         forvalues i=0/1{                                                     
>    
  8.         qui summarize `variable' if sgtf == `i', d
  9.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
 10.         }
 11. 
. file write tablecontent _n
 12. 
.         
.         qui summarize `variable', d
 13.         file write tablecontent ("Median (IQR)") _tab 
 14.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 15.         
.         forvalues i=0/1{
 16.         qui summarize `variable' if sgtf == `i', d
 17.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 18.         }
 19.         
. file write tablecontent _n
 20.         
. end

. 
. 
. 
. *****************************************************************************
> ***
. * INVOKE PROGRAMS FOR TABLE 1 
. *
. *****************************************************************************
> ***
. 
. noi di "SUBSETTING ON COX POPULATION"
SUBSETTING ON COX POPULATION

. keep if cox_pop==1
(2,385 observations deleted)

. 
. 
. *Set up output file
. cap file close tablecontent

. 
. file open tablecontent using ./output/table1_cox.txt, write text replace
(note: file ./output/table1_cox.txt not found)

. 
. file write tablecontent ("Table 1: Demographic and Clinical Characteristics")
>  _n

. 
. file write tablecontent _tab ("Total")          _tab ///
>                                                          ("non-VOC")    _tab 
> ///
>                                                          ("VOC")             
>    _n

.                                                          
. 
. 
. * DEMOGRAPHICS (more than one level, potentially missing) 
. 
. /*reminder of variables:
> patient_id age ageCat hh_id hh_size hh_composition case_date case eth5 eth16 
> ethnicity_16 indexdate sex bmicat smoke imd region comorb_Neuro comorb_Immuno
> suppression shielding chronic_respiratory_disease chronic_cardiac_disease dia
> betes chronic_liver_disease cancer egfr_cat hypertension smoke_nomiss rural_u
> rban
> */
. 
. *DIED
. tabulatevariable, variable(cox_death) min(0) max(1) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |    142,543           0           0          0          0
  142,543
  72,759
  71,365
  72,597
  71,178
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   cox_death |      2,813           1           0          1          1
  2,813
  72,759
  1,394
  72,597
  1,419

. file write tablecontent _n

. 
. *SURVIVAL TIME
. summarizevariable, variable(cox_time) 

. file write tablecontent _n

. 
. *SEX
. tabulatevariable, variable(male) min(0) max(1) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     73,866           0           0          0          0
  73,866
  72,759
  36,949
  72,597
  36,917
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     71,490           1           0          1          1
  71,490
  72,759
  35,810
  72,597
  35,680

. file write tablecontent _n 

. 
. *AGE
. summarizevariable, variable(age) 

. file write tablecontent _n

. 
. tabulatevariable, variable(agegroup) min(1) max(7) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     22,211           1           0          1          1
  22,211
  72,759
  11,087
  72,597
  11,124
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     19,392           2           0          2          2
  19,392
  72,759
  9,751
  72,597
  9,641
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     18,621           3           0          3          3
  18,621
  72,759
  9,274
  72,597
  9,347
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     19,627           4           0          4          4
  19,627
  72,759
  9,811
  72,597
  9,816
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     15,468           5           0          5          5
  15,468
  72,759
  7,691
  72,597
  7,777
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     12,065           6           0          6          6
  12,065
  72,759
  6,033
  72,597
  6,032
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      7,119           7           0          7          7
  7,119
  72,759
  3,544
  72,597
  3,575

. file write tablecontent _n 

. 
. *ETHNICITY
. tabulatevariable, variable(eth5) min(1) max(5) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     81,802           1           0          1          1
  81,802
  72,759
  40,911
  72,597
  40,891
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,456           2           0          2          2
  5,456
  72,759
  2,740
  72,597
  2,716
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,583           3           0          3          3
  5,583
  72,759
  2,796
  72,597
  2,787
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,383           4           0          4          4
  5,383
  72,759
  2,640
  72,597
  2,743
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     10,688           5           0          5          5
  10,688
  72,759
  5,405
  72,597
  5,283

. file write tablecontent _n 

. 
. *BMI
. tabulatevariable, variable(obese4cat) min(1) max(4) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     59,062           1           0          1          1
  59,062
  72,759
  29,381
  72,597
  29,681
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     26,424           2           0          2          2
  26,424
  72,759
  13,419
  72,597
  13,005
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     26,654           3           0          3          3
  26,654
  72,759
  13,343
  72,597
  13,311
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     33,216           4           0          4          4
  33,216
  72,759
  16,616
  72,597
  16,600

. file write tablecontent _n 

. 
. *SMOKING
. tabulatevariable, variable(smoke_nomiss) min(1) max(3) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |    125,075           1           0          1          1
  125,075
  72,759
  62,529
  72,597
  62,546
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |      2,872           2           0          2          2
  2,872
  72,759
  1,445
  72,597
  1,427
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     17,409           3           0          3          3
  17,409
  72,759
  8,785
  72,597
  8,624

. file write tablecontent _n

. 
. *COMORBIDITIES (3 CATEGORIES)
. tabulatevariable, variable(comorb_cat) min(0) max(2) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |      9,568           0           0          0          0
  9,568
  72,759
  4,783
  72,597
  4,785
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     30,382           1           0          1          1
  30,382
  72,759
  15,208
  72,597
  15,174
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |    105,406           2           0          2          2
  105,406
  72,759
  52,768
  72,597
  52,638

. file write tablecontent _n

. 
. *IMD
. tabulatevariable, variable(imd) min(1) max(5) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     43,556           1           0          1          1
  43,556
  72,759
  21,833
  72,597
  21,723
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     28,922           2           0          2          2
  28,922
  72,759
  14,500
  72,597
  14,422
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,140           3           0          3          3
  29,140
  72,759
  14,545
  72,597
  14,595
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     29,227           4           0          4          4
  29,227
  72,759
  14,687
  72,597
  14,540
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     14,511           5           0          5          5
  14,511
  72,759
  7,194
  72,597
  7,317

. file write tablecontent _n 

. 
. *HOUSEHOLD SIZE
. tabulatevariable, variable(hh_total_cat) min(1) max(4) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     69,014           1           0          1          1
  69,014
  72,759
  34,543
  72,597
  34,471
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     72,883           2           0          2          2
  72,883
  72,759
  36,480
  72,597
  36,403
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |        207           3           0          3          3
  207
  72,759
  106
  72,597
  101
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |          0
  0
  72,759
  0
  72,597
  0

. file write tablecontent _n 

. 
. *REGION
. tabulatevariable, variable(region) min(0) max(8) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,457           0           0          0          0
  14,457
  72,759
  7,203
  72,597
  7,254
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,490           1           0          1          1
  14,490
  72,759
  7,269
  72,597
  7,221
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     29,165           2           0          2          2
  29,165
  72,759
  14,610
  72,597
  14,555
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,678           3           0          3          3
  14,678
  72,759
  7,421
  72,597
  7,257
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,397           4           0          4          4
  14,397
  72,759
  7,203
  72,597
  7,194
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,474           5           0          5          5
  14,474
  72,759
  7,237
  72,597
  7,237
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,511           6           0          6          6
  14,511
  72,759
  7,268
  72,597
  7,243
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,742           7           0          7          7
  14,742
  72,759
  7,296
  72,597
  7,446
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,442           8           0          8          8
  14,442
  72,759
  7,252
  72,597
  7,190

. file write tablecontent _n 

. 
. *RURAL URBAN (five categories)
. tabulatevariable, variable(rural_urban5) min(1) max(5) 
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,508           1           0          1          1
  14,508
  72,759
  7,270
  72,597
  7,238
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,675           2           0          2          2
  14,675
  72,759
  7,320
  72,597
  7,355
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     28,898           3           0          3          3
  28,898
  72,759
  14,463
  72,597
  14,435
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     29,054           4           0          4          4
  29,054
  72,759
  14,603
  72,597
  14,451
  145,356

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     58,221           5           0          5          5
  58,221
  72,759
  29,103
  72,597
  29,118

. file write tablecontent _n 

. 
. 
. 
. 
. 
. 
. 
. file write tablecontent _n _n

. 
. 
. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_cox_table1.log
  log type:  text
 closed on:  12 Feb 2021, 16:49:47
-------------------------------------------------------------------------------
