-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_logit_models.log
  log type:  text
 opened on:  18 Feb 2021, 16:33:22

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 14 Feb 2021)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,035 observations deleted)

. 
. noi di "SUBSETTING ON 28-DAY RISK POPULATION"
SUBSETTING ON 28-DAY RISK POPULATION

. keep if risk_pop==1
(7,498 observations deleted)

. 
. tab sgtf risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

        SGTF |    28-day outcome
  (exposure) |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    69,407      1,073 |    70,480 
             |     98.48       1.52 |    100.00 
-------------+----------------------+----------
         VOC |    69,773      1,058 |    70,831 
             |     98.51       1.49 |    100.00 
-------------+----------------------+----------
       Total |   139,180      2,131 |   141,311 
             |     98.49       1.51 |    100.00 

. 
. 
. 
. *******************
. /* Unadjusted OR */
. *******************
. 
. glm risk_28 i.sgtf, family(bin) link(logit) eform

Iteration 0:   log likelihood = -17793.022  
Iteration 1:   log likelihood = -11070.515  
Iteration 2:   log likelihood = -11053.017  
Iteration 3:   log likelihood = -11052.959  
Iteration 4:   log likelihood = -11052.959  

Generalized linear models                         Number of obs   =    141,311
Optimization     : ML                             Residual df     =    141,309
                                                  Scale parameter =          1
Deviance         =  22105.91762                   (1/df) Deviance =   .1564367
Pearson          =       141311                   (1/df) Pearson  =   1.000014

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1564628
Log likelihood   = -11052.95881                   BIC             =   -1653638

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9808483   .0428204    -0.44   0.658     .9004122     1.06847
       _cons |   .0154595   .0004756  -135.54   0.000      .014555    .0164203
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. * Absolute odds
. margins sgtf

Adjusted predictions                            Number of obs     =    141,311
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0152242   .0004612    33.01   0.000     .0143202    .0161281
        VOC  |    .014937   .0004558    32.77   0.000     .0140437    .0158303
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted OR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 household_size i.home_bin ///
>                         i.region ib1.rural_urban5 ib1.start_week age1 age2 ag
> e3 ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -16070.978  
Iteration 1:   log likelihood = -10070.002  
Iteration 2:   log likelihood =  -10050.94  
Iteration 3:   log likelihood = -10050.914  
Iteration 4:   log likelihood = -10050.914  

Generalized linear models                         Number of obs   =    126,948
Optimization     : ML                             Residual df     =    126,917
                                                  Scale parameter =          1
Deviance         =  20101.82871                   (1/df) Deviance =   .1583856
Pearson          =  126906.6811                   (1/df) Pearson  =   .9999187

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588353
Log likelihood   = -10050.91436                   BIC             =   -1471367

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9761135   .0445994    -0.53   0.597        .8925     1.06756
             |
        male |
          M  |   1.014433   .0463512     0.31   0.754     .9275354    1.109472
             |
         imd |
          2  |   1.006147    .065112     0.09   0.925     .8862913    1.142211
          3  |   .8075619   .0555947    -3.10   0.002     .7056296    .9242189
          4  |   .9925611   .0643731    -0.12   0.908     .8740819      1.1271
5 most de..  |   1.003746    .082072     0.05   0.964     .8551151     1.17821
             |
        eth2 |
      Other  |   .9582602   .0588137    -0.69   0.487     .8496509    1.080753
    Missing  |   .9618162   .0529816    -0.71   0.480     .8633834    1.071471
             |
household_~e |   .9970025   .0219226    -0.14   0.891     .9549477    1.040909
             |
    home_bin |
  Care home  |   1.081902   .0670559     1.27   0.204     .9581436    1.221645
             |
      region |
     London  |    1.05878   .0915022     0.66   0.509     .8938049    1.254205
 North East  |   1.086694   .1073331     0.84   0.400     .8954343    1.318805
 North West  |   1.019837   .1023558     0.20   0.845     .8377219    1.241542
 South East  |   1.206297   .1161989     1.95   0.052     .9987587    1.456961
 South West  |   1.108841   .1089339     1.05   0.293     .9146314    1.344288
West Midl..  |   1.085537   .1073354     0.83   0.407     .8942924    1.317678
Yorkshire..  |    1.12231   .1101475     1.18   0.240      .925919    1.360357
             |
rural_urban5 |
Urban min..  |   .9278047     .09741    -0.71   0.475     .7552471    1.139788
Urban cit..  |   1.072611   .0944796     0.80   0.426     .9025371    1.274733
Rural tow..  |   1.022461   .0907753     0.25   0.802     .8591638    1.216795
Rural vil..  |   1.009237   .0820081     0.11   0.910     .8606503    1.183477
             |
  start_week |
23Nov-29Nov  |   1.161298   .0958402     1.81   0.070     .9878597    1.365187
30Nov-06Dec  |   1.129914   .0945708     1.46   0.144      .958964     1.33134
07Dec-13Dec  |   1.025206   .0883619     0.29   0.773     .8658578     1.21388
14Dec-20Dec  |    1.09284   .0942893     1.03   0.303      .922817    1.294188
21Dec-27Dec  |   1.112976   .0969815     1.23   0.219     .9382414    1.320253
28Dec-04Jan  |    1.12771   .1083755     1.25   0.211     .9341039    1.361445
             |
        age1 |   .9971783   .0047022    -0.60   0.549     .9880045    1.006437
        age2 |   1.008366   .0155432     0.54   0.589     .9783574    1.039295
        age3 |   .9778154   .0426823    -0.51   0.607     .8976382    1.065154
       _cons |   .0119332   .0033309   -15.87   0.000      .006905    .0206229
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted OR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 ib1.hh_total_cat i.home_bin ///
>                         i.region ib1.rural_urban5 ib1.start_week ib2.agegroup
> A ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15697.327  
Iteration 1:   log likelihood = -9832.2708  
Iteration 2:   log likelihood = -9812.9389  
Iteration 3:   log likelihood = -9812.9158  
Iteration 4:   log likelihood = -9812.9158  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,990
                                                  Scale parameter =          1
Deviance         =  19625.83156                   (1/df) Deviance =   .1582856
Pearson          =  124009.7084                   (1/df) Pearson  =   1.000159

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1587608
Log likelihood   = -9812.915779                   BIC             =   -1434555

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9780834   .0452276    -0.48   0.632     .8933372    1.070869
             |
        male |
          M  |    1.01268   .0468283     0.27   0.785     .9249349     1.10875
             |
         imd |
          2  |   1.018499   .0667318     0.28   0.780     .8957566     1.15806
          3  |   .8191123   .0570472    -2.87   0.004     .7145973    .9389132
          4  |   .9991446   .0657085    -0.01   0.990      .878313    1.136599
5 most de..  |   1.022846   .0844456     0.27   0.784     .8700323      1.2025
             |
        eth2 |
      Other  |   .9647966   .0599395    -0.58   0.564     .8541882    1.089728
    Missing  |    .977848   .0543449    -0.40   0.687     .8769301     1.09038
             |
hh_total_cat |
        3-5  |   .9816895   .0454179    -0.40   0.690     .8965887    1.074868
       6-10  |   .7516876   .5353586    -0.40   0.689     .1861247    3.035783
             |
    home_bin |
  Care home  |   1.074371   .0675236     1.14   0.254     .9498539    1.215212
             |
      region |
     London  |   1.068079   .0933544     0.75   0.451     .8999225    1.267657
 North East  |   1.095353   .1093936     0.91   0.362     .9006251    1.332184
 North West  |   1.024105    .103955     0.23   0.814     .8393457    1.249535
 South East  |   1.193757   .1167852     1.81   0.070     .9854685    1.446068
 South West  |   1.106664   .1101587     1.02   0.309     .9105132    1.345072
West Midl..  |   1.077877   .1081312     0.75   0.455     .8854776     1.31208
Yorkshire..  |   1.127636   .1118899     1.21   0.226      .928343    1.369713
             |
rural_urban5 |
Urban min..  |   .9180054   .0978629    -0.80   0.422       .74491    1.131323
Urban cit..  |   1.077109   .0961102     0.83   0.405     .9042887    1.282957
Rural tow..  |   1.036338   .0930254     0.40   0.691     .8691501    1.235687
Rural vil..  |   1.009692    .083134     0.12   0.907       .85922    1.186515
             |
  start_week |
23Nov-29Nov  |   1.165645   .0972641     1.84   0.066     .9897829    1.372753
30Nov-06Dec  |    1.12578   .0954309     1.40   0.162     .9534511    1.329257
07Dec-13Dec  |   1.019618   .0890187     0.22   0.824     .8592562    1.209908
14Dec-20Dec  |   1.095269   .0955579     1.04   0.297     .9231166    1.299525
21Dec-27Dec  |   1.126247   .0989856     1.35   0.176     .9480288    1.337967
28Dec-04Jan  |   1.112589   .1086277     1.09   0.275     .9188138     1.34723
             |
   agegroupA |
      0-<65  |   1.140182   .0934662     1.60   0.110     .9709501    1.338909
     75-<85  |   1.098921   .1363343     0.76   0.447     .8617172     1.40142
        85+  |    1.35674   .2128002     1.95   0.052     .9976736    1.845036
             |
       _cons |   .0119824    .001794   -29.55   0.000     .0089352    .0160688
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. ***********************************************************
. /* Fully adjusted OR - age as spline, continuous hh size */
. ***********************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.obese4cat ho
> usehold_size ///
>                         i.region ib1.rural_urban5 ib0.comorb_cat ib1.start_we
> ek age1 age2 age3 i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -16070.595  
Iteration 1:   log likelihood =     -10068  
Iteration 2:   log likelihood = -10047.768  
Iteration 3:   log likelihood = -10047.747  
Iteration 4:   log likelihood = -10047.747  

Generalized linear models                         Number of obs   =    126,948
Optimization     : ML                             Residual df     =    126,911
                                                  Scale parameter =          1
Deviance         =  20095.49302                   (1/df) Deviance =   .1583432
Pearson          =  126939.1365                   (1/df) Pearson  =   1.000222

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =     .15888
Log likelihood   = -10047.74651                   BIC             =   -1471303

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9762225   .0446074    -0.53   0.598     .8925943    1.067686
             |
        male |
          M  |   1.014409   .0463533     0.31   0.754     .9275075    1.109452
             |
         imd |
          2  |   1.006584   .0651435     0.10   0.919     .8866713    1.142714
          3  |    .807541   .0555948    -3.10   0.002     .7056088    .9241983
          4  |   .9928311   .0643932    -0.11   0.912     .8743151    1.127412
5 most de..  |   1.003859   .0820842     0.05   0.962     .8552065     1.17835
             |
        eth2 |
      Other  |   .9586585   .0588416    -0.69   0.492     .8499981     1.08121
    Missing  |   .9620506   .0529977    -0.70   0.482     .8635883    1.071739
             |
smoke_nomi~2 |
     Former  |   .9962836   .0656562    -0.06   0.955     .8755639    1.133648
             |
   obese4cat |
Obese I ..)  |   1.122176   .0708762     1.83   0.068     .9915158    1.270055
Obese II..)  |   .9953676   .0651792    -0.07   0.943     .8754768    1.131677
Obese II..)  |   1.049007   .0625708     0.80   0.422     .9332677      1.1791
             |
household_~e |   .9972086    .021931    -0.13   0.899     .9551378    1.041133
             |
      region |
     London  |   1.058044   .0914428     0.65   0.514     .8931768    1.253343
 North East  |   1.086744   .1073455     0.84   0.400     .8954632    1.318883
 North West  |       1.02   .1023758     0.20   0.844     .8378502    1.241749
 South East  |   1.205598   .1161354     1.94   0.052     .9981742    1.456126
 South West  |   1.107694   .1088265     1.04   0.298      .913677     1.34291
West Midl..  |   1.085455   .1073314     0.83   0.407     .8942182    1.317588
Yorkshire..  |   1.121996   .1101212     1.17   0.241     .9256522    1.359986
             |
rural_urban5 |
Urban min..  |    .927265   .0973561    -0.72   0.472     .7548035    1.139131
Urban cit..  |   1.072757   .0944953     0.80   0.425     .9026555    1.274913
Rural tow..  |   1.022167   .0907514     0.25   0.805     .8589131     1.21645
Rural vil..  |    1.00949   .0820318     0.12   0.907      .860861    1.183781
             |
  comorb_cat |
1 comorbi..  |   .9008458   .0886385    -1.06   0.289     .7428424    1.092457
2+ comorb..  |   .8706798   .0779081    -1.55   0.122     .7306229    1.037585
             |
  start_week |
23Nov-29Nov  |    1.16029   .0957643     1.80   0.072     .9869897    1.364018
30Nov-06Dec  |   1.130865   .0946541     1.47   0.142     .9597646    1.332468
07Dec-13Dec  |   1.025328   .0883807     0.29   0.772     .8659471    1.214043
14Dec-20Dec  |   1.093227   .0943287     1.03   0.302     .9231336     1.29466
21Dec-27Dec  |   1.113585   .0970417     1.23   0.217     .9387434    1.320992
28Dec-04Jan  |    1.12733   .1083458     1.25   0.212     .9337782    1.361002
             |
        age1 |   .9972223    .004703    -0.59   0.555      .988047    1.006483
        age2 |   1.008231   .0155419     0.53   0.595     .9782253    1.039158
        age3 |   .9781951   .0426986    -0.51   0.614     .8979873    1.065567
             |
    home_bin |
  Care home  |   1.082186   .0670775     1.27   0.203     .9583883    1.221975
       _cons |   .0130817   .0038283   -14.82   0.000     .0073716     .023215
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. **************************************************
. /* Fully adjusted OR - age grouped, cat hh size */
. **************************************************
. 
. glm risk_28 i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib
> 1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.901  
Iteration 1:   log likelihood =  -9830.049  
Iteration 2:   log likelihood = -9809.4222  
Iteration 3:   log likelihood = -9809.4032  
Iteration 4:   log likelihood = -9809.4032  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,984
                                                  Scale parameter =          1
Deviance         =  19618.80638                   (1/df) Deviance =   .1582366
Pearson          =  124052.3788                   (1/df) Pearson  =   1.000552

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588009
Log likelihood   = -9809.403191                   BIC             =   -1434492

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9781993   .0452364    -0.48   0.634      .893437    1.071003
             |
   agegroupA |
      0-<65  |    1.13893   .0933697     1.59   0.113      .969874    1.337453
     75-<85  |   1.098449   .1362829     0.76   0.449     .8613363    1.400836
        85+  |   1.355183   .2125688     1.94   0.053     .9965104    1.842953
             |
        male |
          M  |   1.012637     .04683     0.27   0.786     .9248883     1.10871
             |
         imd |
          2  |   1.018909   .0667625     0.29   0.775     .8961106    1.158535
          3  |   .8190723   .0570463    -2.87   0.004     .7145592    .9388718
          4  |   .9993827   .0657271    -0.01   0.993     .8785172    1.136877
5 most de..  |   1.022953    .084458     0.27   0.783     .8701175    1.202633
             |
        eth2 |
      Other  |   .9653356   .0599766    -0.57   0.570      .854659    1.090345
    Missing  |   .9780776   .0543608    -0.40   0.690     .8771305    1.090642
             |
smoke_nomi~2 |
     Former  |   1.000067   .0666558     0.00   0.999     .8775977    1.139627
             |
   obese4cat |
Obese I ..)  |   1.124225   .0718893     1.83   0.067     .9917968    1.274336
Obese II..)  |   1.004217   .0664337     0.06   0.949     .8820976    1.143243
Obese II..)  |   1.050798   .0634747     0.82   0.412     .9334727    1.182871
             |
hh_total_cat |
        3-5  |   .9823025   .0454483    -0.39   0.700     .8971449    1.075543
       6-10  |   .7493832   .5337477    -0.41   0.685     .1855394    3.026716
             |
      region |
     London  |   1.067352   .0932956     0.75   0.456     .8993019    1.266805
 North East  |   1.095553   .1094225     0.91   0.361     .9007753    1.332449
 North West  |   1.024624   .1040122     0.24   0.811      .839763    1.250179
 South East  |    1.19323   .1167379     1.81   0.071      .985027    1.445441
 South West  |   1.105736   .1100725     1.01   0.313     .9097399    1.343959
West Midl..  |    1.07781   .1081291     0.75   0.455     .8854159    1.312011
Yorkshire..  |   1.127261   .1118583     1.21   0.227     .9280248    1.369271
             |
rural_urban5 |
Urban min..  |   .9175611   .0978182    -0.81   0.420     .7445453    1.130782
Urban cit..  |   1.077421   .0961409     0.84   0.403     .9045461    1.283336
Rural tow..  |    1.03627   .0930216     0.40   0.691     .8690889    1.235611
Rural vil..  |   1.010144   .0831745     0.12   0.902     .8595988    1.187054
             |
  comorb_cat |
1 comorbi..  |   .8959745   .0885685    -1.11   0.266     .7381643    1.087523
2+ comorb..  |   .8541307   .0767896    -1.75   0.079     .7161403     1.01871
             |
  start_week |
23Nov-29Nov  |   1.164527   .0971788     1.83   0.068     .9888207    1.371455
30Nov-06Dec  |   1.126689    .095512     1.41   0.159     .9542139    1.330339
07Dec-13Dec  |   1.019748   .0890386     0.22   0.823     .8593509    1.210082
14Dec-20Dec  |   1.095578   .0955915     1.05   0.295     .9233664    1.299907
21Dec-27Dec  |    1.12687   .0990472     1.36   0.174     .9485421    1.338723
28Dec-04Jan  |   1.112387   .1086147     1.09   0.275     .9186362    1.347002
             |
    home_bin |
  Care home  |   1.074547   .0675389     1.14   0.253     .9500015    1.215419
       _cons |   .0132776   .0023088   -24.85   0.000     .0094429    .0186694
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. est store fully

. 
. * Adjusted absolute risks
. margins comorb_cat#male#agegroupA if sgtf==0, post asobserved

Predictive margins                              Number of obs     =     61,874
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  comorb_cat#|
        male#|
   agegroupA |
No comorb.. #|
          F #|
      0-<65  |   .0177871   .0016105    11.04   0.000     .0146306    .0209436
No comorb.. #|
          F #|
     65-<75  |   .0156519    .001825     8.58   0.000      .012075    .0192288
No comorb.. #|
          F #|
     75-<85  |   .0171659   .0022104     7.77   0.000     .0128337    .0214982
No comorb.. #|
          F #|
        85+  |   .0210921   .0033551     6.29   0.000     .0145163    .0276679
No comorb.. #|
          M #|
      0-<65  |   .0180078   .0016294    11.05   0.000     .0148142    .0212013
No comorb.. #|
          M #|
     65-<75  |   .0158465   .0018465     8.58   0.000     .0122273    .0194657
No comorb.. #|
          M #|
     75-<85  |    .017379   .0022367     7.77   0.000     .0129952    .0217629
No comorb.. #|
          M #|
        85+  |   .0213528   .0033937     6.29   0.000     .0147012    .0280044
1 comorbi.. #|
          F #|
      0-<65  |   .0159668   .0009418    16.95   0.000     .0141209    .0178127
1 comorbi.. #|
          F #|
     65-<75  |   .0140469   .0013168    10.67   0.000      .011466    .0166279
1 comorbi.. #|
          F #|
     75-<85  |   .0154082   .0016827     9.16   0.000     .0121101    .0187063
1 comorbi.. #|
          F #|
        85+  |   .0189402   .0027289     6.94   0.000     .0135916    .0242887
1 comorbi.. #|
          M #|
      0-<65  |   .0161653   .0009561    16.91   0.000     .0142913    .0180392
1 comorbi.. #|
          M #|
     65-<75  |   .0142219   .0013342    10.66   0.000     .0116068     .016837
1 comorbi.. #|
          M #|
     75-<85  |   .0155998   .0017046     9.15   0.000     .0122588    .0189408
1 comorbi.. #|
          M #|
        85+  |   .0191749    .002762     6.94   0.000     .0137615    .0245882
2+ comorb.. #|
          F #|
      0-<65  |   .0152327   .0006554    23.24   0.000     .0139481    .0165172
2+ comorb.. #|
          F #|
     65-<75  |   .0133998   .0011314    11.84   0.000     .0111823    .0156174
2+ comorb.. #|
          F #|
     75-<85  |   .0146993     .00149     9.87   0.000      .011779    .0176197
2+ comorb.. #|
          F #|
        85+  |   .0180719    .002495     7.24   0.000     .0131817     .022962
2+ comorb.. #|
          M #|
      0-<65  |   .0154221     .00067    23.02   0.000      .014109    .0167353
2+ comorb.. #|
          M #|
     65-<75  |   .0135668    .001148    11.82   0.000     .0113169    .0158168
2+ comorb.. #|
          M #|
     75-<85  |   .0148823   .0015108     9.85   0.000     .0119212    .0178434
2+ comorb.. #|
          M #|
        85+  |    .018296   .0025264     7.24   0.000     .0133443    .0232476
------------------------------------------------------------------------------

. 
. * Save risk estimates
. matrix est = e(b)

. matrix inv_est = est'

. svmat inv_est

. 
. * Save SE estimates
. matrix var = e(V)

. matrix diag_var = vecdiag(var)

. matrix inv_var = diag_var'

. svmat inv_var

. gen sq_var = sqrt(inv_var1)
(141,287 missing values generated)

. 
. noi disp "CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE"
CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE

. list inv_est1 sq_var in 1/24

     +---------------------+
     | inv_est1     sq_var |
     |---------------------|
  1. | .0177871   .0016105 |
  2. | .0156519    .001825 |
  3. | .0171659   .0022104 |
  4. | .0210921   .0033551 |
  5. | .0180078   .0016294 |
     |---------------------|
  6. | .0158465   .0018465 |
  7. |  .017379   .0022367 |
  8. | .0213528   .0033937 |
  9. | .0159668   .0009418 |
 10. | .0140469   .0013168 |
     |---------------------|
 11. | .0154082   .0016827 |
 12. | .0189402   .0027289 |
 13. | .0161653   .0009561 |
 14. | .0142219   .0013342 |
 15. | .0155998   .0017046 |
     |---------------------|
 16. | .0191749    .002762 |
 17. | .0152327   .0006554 |
 18. | .0133998   .0011314 |
 19. | .0146993     .00149 |
 20. | .0180719    .002495 |
     |---------------------|
 21. | .0154221     .00067 |
 22. | .0135668    .001148 |
 23. | .0148823   .0015108 |
 24. |  .018296   .0025264 |
     +---------------------+

. 
. * Re-Calculate CI
. gen risk0 = inv_est1*100
(141,287 missing values generated)

. gen lb0 = (inv_est1 - invnormal(0.975)*sq_var)*100
(141,287 missing values generated)

. gen ub0 = (inv_est1 + invnormal(0.975)*sq_var)*100
(141,287 missing values generated)

. 
. order lb ub, after(risk0)

. 
. 
. est restore fully
(results fully are active now)

. 
. * Adjusted absolute odds
. margins comorb_cat#male#agegroupA if sgtf==1, post asobserved

Predictive margins                              Number of obs     =     62,148
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  comorb_cat#|
        male#|
   agegroupA |
No comorb.. #|
          F #|
      0-<65  |   .0173961    .001576    11.04   0.000     .0143072     .020485
No comorb.. #|
          F #|
     65-<75  |   .0153071   .0017849     8.58   0.000     .0118086    .0188055
No comorb.. #|
          F #|
     75-<85  |   .0167883   .0021611     7.77   0.000     .0125526    .0210241
No comorb.. #|
          F #|
        85+  |   .0206299   .0032828     6.28   0.000     .0141957    .0270641
No comorb.. #|
          M #|
      0-<65  |    .017612   .0015947    11.04   0.000     .0144865    .0207375
No comorb.. #|
          M #|
     65-<75  |   .0154974   .0018062     8.58   0.000     .0119574    .0190375
No comorb.. #|
          M #|
     75-<85  |   .0169968    .002187     7.77   0.000     .0127103    .0212833
No comorb.. #|
          M #|
        85+  |   .0208851   .0033208     6.29   0.000     .0143764    .0273938
1 comorbi.. #|
          F #|
      0-<65  |   .0156152    .000925    16.88   0.000     .0138022    .0174281
1 comorbi.. #|
          F #|
     65-<75  |    .013737   .0012894    10.65   0.000     .0112097    .0162642
1 comorbi.. #|
          F #|
     75-<85  |   .0150686   .0016463     9.15   0.000     .0118419    .0182954
1 comorbi.. #|
          F #|
        85+  |   .0185243   .0026714     6.93   0.000     .0132885      .02376
1 comorbi.. #|
          M #|
      0-<65  |   .0158093   .0009392    16.83   0.000     .0139684    .0176502
1 comorbi.. #|
          M #|
     65-<75  |   .0139081   .0013066    10.64   0.000     .0113471     .016469
1 comorbi.. #|
          M #|
     75-<85  |   .0152561   .0016679     9.15   0.000     .0119871    .0185251
1 comorbi.. #|
          M #|
        85+  |   .0187539   .0027039     6.94   0.000     .0134544    .0240534
2+ comorb.. #|
          F #|
      0-<65  |   .0148969   .0006445    23.11   0.000     .0136337    .0161602
2+ comorb.. #|
          F #|
     65-<75  |    .013104   .0011075    11.83   0.000     .0109333    .0152746
2+ comorb.. #|
          F #|
     75-<85  |   .0143752   .0014572     9.87   0.000     .0115192    .0172312
2+ comorb.. #|
          F #|
        85+  |   .0176747   .0024419     7.24   0.000     .0128886    .0224608
2+ comorb.. #|
          M #|
      0-<65  |   .0150823   .0006591    22.88   0.000     .0137905    .0163741
2+ comorb.. #|
          M #|
     65-<75  |   .0132673   .0011238    11.81   0.000     .0110646      .01547
2+ comorb.. #|
          M #|
     75-<85  |   .0145542   .0014777     9.85   0.000      .011658    .0174503
2+ comorb.. #|
          M #|
        85+  |    .017894   .0024728     7.24   0.000     .0130474    .0227405
------------------------------------------------------------------------------

. 
. * Save odds estimates
. matrix est1 = e(b)

. matrix inv_estx = est1'

. svmat inv_estx

. 
. * Save SE estimates
. matrix var1 = e(V)

. matrix diag_var1 = vecdiag(var1)

. matrix inv_varx = diag_var1'

. svmat inv_varx

. gen sq_varx = sqrt(inv_varx1)
(141,287 missing values generated)

. 
. noi disp "CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE"
CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE

. list inv_estx1 sq_varx in 1/24

     +---------------------+
     | inv_e~x1    sq_varx |
     |---------------------|
  1. | .0173961    .001576 |
  2. | .0153071   .0017849 |
  3. | .0167883   .0021611 |
  4. | .0206299   .0032828 |
  5. |  .017612   .0015947 |
     |---------------------|
  6. | .0154974   .0018062 |
  7. | .0169968    .002187 |
  8. | .0208851   .0033208 |
  9. | .0156152    .000925 |
 10. |  .013737   .0012894 |
     |---------------------|
 11. | .0150686   .0016463 |
 12. | .0185243   .0026714 |
 13. | .0158093   .0009392 |
 14. | .0139081   .0013066 |
 15. | .0152561   .0016679 |
     |---------------------|
 16. | .0187539   .0027039 |
 17. | .0148969   .0006445 |
 18. | .0131039   .0011075 |
 19. | .0143752   .0014572 |
 20. | .0176747   .0024419 |
     |---------------------|
 21. | .0150823   .0006591 |
 22. | .0132673   .0011238 |
 23. | .0145542   .0014777 |
 24. |  .017894   .0024728 |
     +---------------------+

. 
. * Re-Calculate CI
. gen risk1 = inv_estx1*100
(141,287 missing values generated)

. gen lb1 = (inv_estx1 - invnormal(0.975)*sq_varx)*100
(141,287 missing values generated)

. gen ub1 = (inv_estx1 + invnormal(0.975)*sq_varx)*100
(141,287 missing values generated)

. 
. order lb1 ub1, after(risk1)

. 
. 
. gen risk_labels = "Female: 0-<65" in 1
(141,310 missing values generated)

. replace risk_labels = "65-<75" in 2
(1 real change made)

. replace risk_labels = "75-<85" in 3
(1 real change made)

. replace risk_labels = "85+" in 4
(1 real change made)

. 
. replace risk_labels = "Male: 0-<65" in 5
(1 real change made)

. replace risk_labels = "65-<75" in 6
(1 real change made)

. replace risk_labels = "75-<85" in 7
(1 real change made)

. replace risk_labels = "85+" in 8
(1 real change made)

. 
. replace risk_labels = "Female: 0-<65" in 9
(1 real change made)

. replace risk_labels = "65-<75" in 10
(1 real change made)

. replace risk_labels = "75-<85" in 11
(1 real change made)

. replace risk_labels = "85+" in 12
(1 real change made)

. 
. replace risk_labels = "Male: 0-<65" in 13
(1 real change made)

. replace risk_labels = "65-<75" in 14
(1 real change made)

. replace risk_labels = "75-<85" in 15
(1 real change made)

. replace risk_labels = "85+" in 16
(1 real change made)

. 
. replace risk_labels = "Female: 0-<65" in 17
(1 real change made)

. replace risk_labels = "65-<75" in 18
(1 real change made)

. replace risk_labels = "75-<85" in 19
(1 real change made)

. replace risk_labels = "85+" in 20
(1 real change made)

. 
. replace risk_labels = "Male: 0-<65" in 21
(1 real change made)

. replace risk_labels = "65-<75" in 22
(1 real change made)

. replace risk_labels = "75-<85" in 23
(1 real change made)

. replace risk_labels = "85+" in 24
(1 real change made)

. 
. 
. ***********************************
. /* Output table of absolute risk */
. ***********************************
. 
. cap file close tablecontent

. 
. file open tablecontent using ./output/table3_abs_risk.txt, write text replace
(note: file ./output/table3_abs_risk.txt not found)

. 
. file write tablecontent ("Table 3: Absolute risk of death by 28-days") _n _n

. 
. file write tablecontent ("Comorbidities/Sex/Age group")         _tab ///
>                                                 ("non-VOC (95% CI)")         
>                    _tab ///
>                                                 ("VOC (95% CI)")             
>                            _n

. 
. forvalues i=1/24 {
  2.         
.         preserve
  3.                 keep if _n == `i'
  4.                 if inlist(`i',5,13,21) {
  5.                         file write tablecontent _n
  6.                 }
  7.                 if `i'==1 {
  8.                         file write tablecontent _n ("No Comorbidities") _n
  9.                 }
 10.                 if `i'==9 {
 11.                         file write tablecontent _n ("1 Comorbidity") _n
 12.                 }
 13.                 if `i'==17 {
 14.                         file write tablecontent _n ("2+ Comorbidities") _n
 15.                 }
 16.                 file write tablecontent %9s (risk_labels) _tab %4.2f (risk
> 0) (" (") %4.2f (lb0) ("-") %4.2f (ub0) (")") _tab %4.2f (risk1) (" (") %4.2f
>  (lb1) ("-") %4.2f (ub1) (")") _n
 17.         restore
 18. 
. }
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)
(141,310 observations deleted)

. 
. file close tablecontent

. 
. 
. * Risks as balanced
. est restore fully
(results fully are active now)

. margins sgtf comorb_cat#male#agegroupA if sgtf==0, post asbalanced

Adjusted predictions                            Number of obs     =     61,874
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               agegroupA        (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth2             (asbalanced)
               smoke_nomiss2    (asbalanced)
               obese4cat        (asbalanced)
               hh_total_cat     (asbalanced)
               region           (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)
               home_bin         (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0151936    .003688     4.12   0.000     .0079653    .0224219
             |
  comorb_cat#|
        male#|
   agegroupA |
No comorb.. #|
          F #|
      0-<65  |    .016277   .0040952     3.97   0.000     .0082505    .0243035
No comorb.. #|
          F #|
     65-<75  |   .0143199   .0037562     3.81   0.000     .0069579    .0216819
No comorb.. #|
          F #|
     75-<85  |   .0157075   .0042121     3.73   0.000      .007452    .0239631
No comorb.. #|
          F #|
        85+  |   .0193079   .0054657     3.53   0.000     .0085954    .0300204
No comorb.. #|
          M #|
      0-<65  |   .0164793   .0041449     3.98   0.000     .0083554    .0246032
No comorb.. #|
          M #|
     65-<75  |   .0144982   .0038019     3.81   0.000     .0070467    .0219498
No comorb.. #|
          M #|
     75-<85  |   .0159029   .0042633     3.73   0.000     .0075471    .0242587
No comorb.. #|
          M #|
        85+  |   .0195471   .0055309     3.53   0.000     .0087067    .0303875
1 comorbi.. #|
          F #|
      0-<65  |   .0146085     .00354     4.13   0.000     .0076702    .0215468
1 comorbi.. #|
          F #|
     65-<75  |   .0128494   .0032536     3.95   0.000     .0064725    .0192263
1 comorbi.. #|
          F #|
     75-<85  |   .0140966   .0036593     3.85   0.000     .0069245    .0212687
1 comorbi.. #|
          F #|
        85+  |   .0173342    .004771     3.63   0.000     .0079833    .0266851
1 comorbi.. #|
          M #|
      0-<65  |   .0147904   .0035839     4.13   0.000      .007766    .0218147
1 comorbi.. #|
          M #|
     65-<75  |   .0130097    .003294     3.95   0.000     .0065536    .0194657
1 comorbi.. #|
          M #|
     75-<85  |   .0142722   .0037046     3.85   0.000     .0070112    .0215332
1 comorbi.. #|
          M #|
        85+  |   .0175494    .004829     3.63   0.000     .0080848     .027014
2+ comorb.. #|
          F #|
      0-<65  |   .0139358   .0033336     4.18   0.000      .007402    .0204695
2+ comorb.. #|
          F #|
     65-<75  |   .0122567    .003066     4.00   0.000     .0062473     .018266
2+ comorb.. #|
          F #|
     75-<85  |   .0134471    .003451     3.90   0.000     .0066833    .0202109
2+ comorb.. #|
          F #|
        85+  |    .016538   .0045047     3.67   0.000     .0077089    .0253672
2+ comorb.. #|
          M #|
      0-<65  |   .0141094   .0033755     4.18   0.000     .0074934    .0207253
2+ comorb.. #|
          M #|
     65-<75  |   .0124096   .0031046     4.00   0.000     .0063248    .0184945
2+ comorb.. #|
          M #|
     75-<85  |   .0136147   .0034942     3.90   0.000     .0067662    .0204633
2+ comorb.. #|
          M #|
        85+  |   .0167435   .0045601     3.67   0.000     .0078059    .0256812
------------------------------------------------------------------------------

. 
. est restore fully
(results fully are active now)

. margins sgtf comorb_cat#male#agegroupA if sgtf==1, post asbalanced

Adjusted predictions                            Number of obs     =     62,148
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               agegroupA        (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth2             (asbalanced)
               smoke_nomiss2    (asbalanced)
               obese4cat        (asbalanced)
               hh_total_cat     (asbalanced)
               region           (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)
               home_bin         (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .0148673   .0036118     4.12   0.000     .0077884    .0219462
             |
  comorb_cat#|
        male#|
   agegroupA |
No comorb.. #|
          F #|
      0-<65  |    .016277   .0040952     3.97   0.000     .0082505    .0243035
No comorb.. #|
          F #|
     65-<75  |   .0143199   .0037562     3.81   0.000     .0069579    .0216819
No comorb.. #|
          F #|
     75-<85  |   .0157075   .0042121     3.73   0.000      .007452    .0239631
No comorb.. #|
          F #|
        85+  |   .0193079   .0054657     3.53   0.000     .0085954    .0300204
No comorb.. #|
          M #|
      0-<65  |   .0164793   .0041449     3.98   0.000     .0083554    .0246032
No comorb.. #|
          M #|
     65-<75  |   .0144982   .0038019     3.81   0.000     .0070467    .0219498
No comorb.. #|
          M #|
     75-<85  |   .0159029   .0042633     3.73   0.000     .0075471    .0242587
No comorb.. #|
          M #|
        85+  |   .0195471   .0055309     3.53   0.000     .0087067    .0303875
1 comorbi.. #|
          F #|
      0-<65  |   .0146085     .00354     4.13   0.000     .0076702    .0215468
1 comorbi.. #|
          F #|
     65-<75  |   .0128494   .0032536     3.95   0.000     .0064725    .0192263
1 comorbi.. #|
          F #|
     75-<85  |   .0140966   .0036593     3.85   0.000     .0069245    .0212687
1 comorbi.. #|
          F #|
        85+  |   .0173342    .004771     3.63   0.000     .0079833    .0266851
1 comorbi.. #|
          M #|
      0-<65  |   .0147904   .0035839     4.13   0.000      .007766    .0218147
1 comorbi.. #|
          M #|
     65-<75  |   .0130097    .003294     3.95   0.000     .0065536    .0194657
1 comorbi.. #|
          M #|
     75-<85  |   .0142722   .0037046     3.85   0.000     .0070112    .0215332
1 comorbi.. #|
          M #|
        85+  |   .0175494    .004829     3.63   0.000     .0080848     .027014
2+ comorb.. #|
          F #|
      0-<65  |   .0139358   .0033336     4.18   0.000      .007402    .0204695
2+ comorb.. #|
          F #|
     65-<75  |   .0122567    .003066     4.00   0.000     .0062473     .018266
2+ comorb.. #|
          F #|
     75-<85  |   .0134471    .003451     3.90   0.000     .0066833    .0202109
2+ comorb.. #|
          F #|
        85+  |    .016538   .0045047     3.67   0.000     .0077089    .0253672
2+ comorb.. #|
          M #|
      0-<65  |   .0141094   .0033755     4.18   0.000     .0074934    .0207253
2+ comorb.. #|
          M #|
     65-<75  |   .0124096   .0031046     4.00   0.000     .0063248    .0184945
2+ comorb.. #|
          M #|
     75-<85  |   .0136147   .0034942     3.90   0.000     .0067662    .0204633
2+ comorb.. #|
          M #|
        85+  |   .0167435   .0045601     3.67   0.000     .0078059    .0256812
------------------------------------------------------------------------------

. 
. 
. 
. ***********************
. /* Subgroup analyses */
. ***********************
. 
. /* Fully adjusted OR - age grouped, cat hh size */
. 
. glm risk_28 i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib
> 1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.901  
Iteration 1:   log likelihood =  -9830.049  
Iteration 2:   log likelihood = -9809.4222  
Iteration 3:   log likelihood = -9809.4032  
Iteration 4:   log likelihood = -9809.4032  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,984
                                                  Scale parameter =          1
Deviance         =  19618.80638                   (1/df) Deviance =   .1582366
Pearson          =  124052.3788                   (1/df) Pearson  =   1.000552

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588009
Log likelihood   = -9809.403191                   BIC             =   -1434492

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9781993   .0452364    -0.48   0.634      .893437    1.071003
             |
   agegroupA |
      0-<65  |    1.13893   .0933697     1.59   0.113      .969874    1.337453
     75-<85  |   1.098449   .1362829     0.76   0.449     .8613363    1.400836
        85+  |   1.355183   .2125688     1.94   0.053     .9965104    1.842953
             |
        male |
          M  |   1.012637     .04683     0.27   0.786     .9248883     1.10871
             |
         imd |
          2  |   1.018909   .0667625     0.29   0.775     .8961106    1.158535
          3  |   .8190723   .0570463    -2.87   0.004     .7145592    .9388718
          4  |   .9993827   .0657271    -0.01   0.993     .8785172    1.136877
5 most de..  |   1.022953    .084458     0.27   0.783     .8701175    1.202633
             |
        eth2 |
      Other  |   .9653356   .0599766    -0.57   0.570      .854659    1.090345
    Missing  |   .9780776   .0543608    -0.40   0.690     .8771305    1.090642
             |
smoke_nomi~2 |
     Former  |   1.000067   .0666558     0.00   0.999     .8775977    1.139627
             |
   obese4cat |
Obese I ..)  |   1.124225   .0718893     1.83   0.067     .9917968    1.274336
Obese II..)  |   1.004217   .0664337     0.06   0.949     .8820976    1.143243
Obese II..)  |   1.050798   .0634747     0.82   0.412     .9334727    1.182871
             |
hh_total_cat |
        3-5  |   .9823025   .0454483    -0.39   0.700     .8971449    1.075543
       6-10  |   .7493832   .5337477    -0.41   0.685     .1855394    3.026716
             |
      region |
     London  |   1.067352   .0932956     0.75   0.456     .8993019    1.266805
 North East  |   1.095553   .1094225     0.91   0.361     .9007753    1.332449
 North West  |   1.024624   .1040122     0.24   0.811      .839763    1.250179
 South East  |    1.19323   .1167379     1.81   0.071      .985027    1.445441
 South West  |   1.105736   .1100725     1.01   0.313     .9097399    1.343959
West Midl..  |    1.07781   .1081291     0.75   0.455     .8854159    1.312011
Yorkshire..  |   1.127261   .1118583     1.21   0.227     .9280248    1.369271
             |
rural_urban5 |
Urban min..  |   .9175611   .0978182    -0.81   0.420     .7445453    1.130782
Urban cit..  |   1.077421   .0961409     0.84   0.403     .9045461    1.283336
Rural tow..  |    1.03627   .0930216     0.40   0.691     .8690889    1.235611
Rural vil..  |   1.010144   .0831745     0.12   0.902     .8595988    1.187054
             |
  comorb_cat |
1 comorbi..  |   .8959745   .0885685    -1.11   0.266     .7381643    1.087523
2+ comorb..  |   .8541307   .0767896    -1.75   0.079     .7161403     1.01871
             |
  start_week |
23Nov-29Nov  |   1.164527   .0971788     1.83   0.068     .9888207    1.371455
30Nov-06Dec  |   1.126689    .095512     1.41   0.159     .9542139    1.330339
07Dec-13Dec  |   1.019748   .0890386     0.22   0.823     .8593509    1.210082
14Dec-20Dec  |   1.095578   .0955915     1.05   0.295     .9233664    1.299907
21Dec-27Dec  |    1.12687   .0990472     1.36   0.174     .9485421    1.338723
28Dec-04Jan  |   1.112387   .1086147     1.09   0.275     .9186362    1.347002
             |
    home_bin |
  Care home  |   1.074547   .0675389     1.14   0.253     .9500015    1.215419
       _cons |   .0132776   .0023088   -24.85   0.000     .0094429    .0186694
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_no_int

. 
. * Constant VOC effect over subgroups
. lincom 1.sgtf, eform

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9781993   .0452364    -0.48   0.634      .893437    1.071003
------------------------------------------------------------------------------

. 
. 
. 
. /* Age group */
. glm risk_28 i.sgtf##ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 i
> b1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.799  
Iteration 1:   log likelihood = -9829.5118  
Iteration 2:   log likelihood = -9808.5427  
Iteration 3:   log likelihood = -9808.5242  
Iteration 4:   log likelihood = -9808.5242  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,981
                                                  Scale parameter =          1
Deviance         =  19617.04846                   (1/df) Deviance =   .1582262
Pearson          =  124046.6309                   (1/df) Pearson  =   1.000529

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588351
Log likelihood   = -9808.524229                   BIC             =   -1434459

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.001148   .1560445     0.01   0.994     .7376069    1.358849
             |
   agegroupA |
      0-<65  |   1.143371   .1329008     1.15   0.249     .9104312    1.435911
     75-<85  |   1.248858   .2123258     1.31   0.191     .8949428    1.742733
        85+  |   1.387283    .305957     1.48   0.138     .9004047    2.137433
             |
        sgtf#|
   agegroupA |
  VOC#0-<65  |   .9923359   .1627011    -0.05   0.963     .7196108    1.368421
 VOC#75-<85  |   .7626657   .1900448    -1.09   0.277     .4679803    1.242913
    VOC#85+  |   .9539963   .2993362    -0.15   0.881       .51578    1.764529
             |
        male |
          M  |   1.012353    .046818     0.27   0.791     .9246277    1.108402
             |
         imd |
          2  |   1.018884   .0667617     0.29   0.775     .8960872    1.158508
          3  |   .8190124   .0570428    -2.87   0.004     .7145058    .9388046
          4  |   .9993822   .0657278    -0.01   0.993     .8785155    1.136878
5 most de..  |    1.02278   .0844452     0.27   0.785     .8699677    1.202433
             |
        eth2 |
      Other  |   .9649579   .0599544    -0.57   0.566     .8543226    1.089921
    Missing  |   .9782989   .0543741    -0.39   0.693     .8773271    1.090892
             |
smoke_nomi~2 |
     Former  |   1.000035   .0666543     0.00   1.000      .877568    1.139592
             |
   obese4cat |
Obese I ..)  |   1.124448   .0719045     1.83   0.067     .9919921    1.274591
Obese II..)  |   1.004105   .0664277     0.06   0.951     .8819966    1.143119
Obese II..)  |   1.051003     .06349     0.82   0.410     .9336494    1.183107
             |
hh_total_cat |
        3-5  |   .9821115   .0454401    -0.39   0.696     .8969693    1.075335
       6-10  |   .7493607   .5337347    -0.41   0.685     .1855324    3.026649
             |
      region |
     London  |   1.067464   .0933062     0.75   0.455      .899395     1.26694
 North East  |   1.095971   .1094659     0.92   0.359     .9011166    1.332961
 North West  |   1.024978   .1040494     0.24   0.808     .8400511    1.250613
 South East  |   1.193322   .1167487     1.81   0.071     .9850998    1.445556
 South West  |   1.105883   .1100886     1.01   0.312     .9098582    1.344141
West Midl..  |   1.077957   .1081454     0.75   0.454     .8855335    1.312193
Yorkshire..  |   1.127663   .1118997     1.21   0.226     .9283535    1.369763
             |
rural_urban5 |
Urban min..  |   .9181382    .097882    -0.80   0.423     .7450101    1.131498
Urban cit..  |   1.077967   .0961911     0.84   0.400     .9050022     1.28399
Rural tow..  |   1.036423   .0930362     0.40   0.690     .8692154    1.235795
Rural vil..  |   1.010581   .0832117     0.13   0.898     .8599691    1.187571
             |
  comorb_cat |
1 comorbi..  |     .89636   .0886084    -1.11   0.268      .738479    1.087995
2+ comorb..  |    .854272   .0768033    -1.75   0.080     .7162571    1.018881
             |
  start_week |
23Nov-29Nov  |   1.164263   .0971589     1.82   0.068     .9885927    1.371149
30Nov-06Dec  |   1.126819   .0955243     1.41   0.159     .9543216    1.330495
07Dec-13Dec  |   1.019454   .0890161     0.22   0.825     .8590981    1.209741
14Dec-20Dec  |   1.095562    .095591     1.05   0.296     .9233515     1.29989
21Dec-27Dec  |   1.126915   .0990518     1.36   0.174     .9485789    1.338778
28Dec-04Jan  |   1.112345   .1086119     1.09   0.276     .9185994    1.346954
             |
    home_bin |
  Care home  |   1.074407   .0675315     1.14   0.254     .9498758    1.215265
       _cons |   .0131187   .0024862   -22.87   0.000     .0090484    .0190198
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_ageX

. 
. lrtest e_no_int e_ageX

Likelihood-ratio test                                 LR chi2(3)  =      1.76
(Assumption: e_no_int nested in e_ageX)               Prob > chi2 =    0.6241

. 
. * Age group VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                            // 0-<65

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.001148   .1560445     0.01   0.994     .7376069    1.358849
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.agegroupA, eform       // 65-<75

 ( 1)  [risk_28]1.sgtf + [risk_28]1o.sgtf#2b.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.001148   .1560445     0.01   0.994     .7376069    1.358849
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.agegroupA, eform       // 75-<85

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7635409   .1484528    -1.39   0.165      .521598    1.117709
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.agegroupA, eform       // 85+

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9550911   .2600844    -0.17   0.866     .5600811    1.628691
------------------------------------------------------------------------------

. 
. 
. 
. /* Ethnicity */
. glm risk_28 i.sgtf##ib1.eth2 ib0.comorb_cat ib2.agegroupA i.male ib1.imd ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib1.start_
> week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.881  
Iteration 1:   log likelihood =  -9829.944  
Iteration 2:   log likelihood = -9809.2487  
Iteration 3:   log likelihood = -9809.2299  
Iteration 4:   log likelihood = -9809.2299  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,982
                                                  Scale parameter =          1
Deviance         =  19618.45976                   (1/df) Deviance =   .1582364
Pearson          =  124052.0316                   (1/df) Pearson  =   1.000565

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588304
Log likelihood   = -9809.229882                   BIC             =   -1434469

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.000065   .0613593     0.00   0.999     .8867527    1.127857
             |
        eth2 |
      Other  |   .9988139   .0870487    -0.01   0.989     .8419776    1.184864
    Missing  |   .9967619   .0777588    -0.04   0.967     .8554369    1.161435
             |
   sgtf#eth2 |
  VOC#Other  |   .9335291   .1160196    -0.55   0.580     .7317117    1.191011
VOC#Missing  |   .9624961   .1070128    -0.34   0.731     .7740343    1.196845
             |
  comorb_cat |
1 comorbi..  |   .8960919   .0885806    -1.11   0.267     .7382602    1.087666
2+ comorb..  |   .8541012   .0767873    -1.75   0.079     .7161149    1.018676
             |
   agegroupA |
      0-<65  |    1.13897   .0933734     1.59   0.112     .9699079    1.337502
     75-<85  |   1.098292   .1362644     0.76   0.450     .8612113    1.400638
        85+  |   1.355367   .2125985     1.94   0.053      .996644    1.843205
             |
        male |
          M  |   1.012676   .0468323     0.27   0.785     .9249231    1.108754
             |
         imd |
          2  |   1.018793   .0667556     0.28   0.776     .8960074    1.158404
          3  |   .8189705   .0570398    -2.87   0.004     .7144693    .9387565
          4  |   .9992811   .0657208    -0.01   0.991     .8784272    1.136762
5 most de..  |   1.022951   .0844578     0.27   0.783     .8701159    1.202631
             |
smoke_nomi~2 |
     Former  |    1.00013    .066661     0.00   0.998      .877651    1.139701
             |
   obese4cat |
Obese I ..)  |   1.124262    .071892     1.83   0.067     .9918283    1.274378
Obese II..)  |   1.004161   .0664302     0.06   0.950     .8820482     1.14318
Obese II..)  |   1.050812   .0634757     0.82   0.412     .9334847    1.182887
             |
hh_total_cat |
        3-5  |   .9822929   .0454479    -0.39   0.699     .8971361    1.075533
       6-10  |   .7493042    .533693    -0.41   0.685     .1855191     3.02641
             |
      region |
     London  |   1.067447    .093305     0.75   0.455     .8993802    1.266921
 North East  |   1.095712   .1094396     0.92   0.360     .9009039    1.332644
 North West  |   1.024603   .1040122     0.24   0.811     .8397423    1.250158
 South East  |   1.193585   .1167744     1.81   0.070     .9853171    1.445875
 South West  |   1.105784   .1100776     1.01   0.312     .9097782    1.344017
West Midl..  |   1.077821   .1081312     0.75   0.455     .8854231    1.312026
Yorkshire..  |   1.127436   .1118765     1.21   0.227      .928168    1.369486
             |
rural_urban5 |
Urban min..  |   .9175532   .0978177    -0.81   0.420     .7445384    1.130773
Urban cit..  |   1.077557   .0961547     0.84   0.403     .9046578    1.283502
Rural tow..  |   1.036476   .0930414     0.40   0.690     .8692593    1.235859
Rural vil..  |   1.010479   .0832048     0.13   0.899     .8598796    1.187454
             |
  start_week |
23Nov-29Nov  |   1.164435   .0971714     1.82   0.068     .9887417    1.371347
30Nov-06Dec  |   1.126707   .0955142     1.41   0.159     .9542278    1.330362
07Dec-13Dec  |   1.019706   .0890354     0.22   0.823     .8593154    1.210034
14Dec-20Dec  |   1.095631   .0955967     1.05   0.295     .9234108    1.299972
21Dec-27Dec  |   1.127001   .0990591     1.36   0.174     .9486518     1.33888
28Dec-04Jan  |   1.112255   .1086036     1.09   0.276     .9185243    1.346846
             |
    home_bin |
  Care home  |   1.074681    .067548     1.15   0.252     .9501188    1.215573
       _cons |   .0131283   .0022992   -24.74   0.000     .0093139    .0185047
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_ethX

. 
. * Test for interaction
. lrtest e_no_int e_ethX

Likelihood-ratio test                                 LR chi2(2)  =      0.35
(Assumption: e_no_int nested in e_ethX)               Prob > chi2 =    0.8409

. 
. * Ethnicity VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                    // White

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.000065   .0613593     0.00   0.999     .8867527    1.127857
------------------------------------------------------------------------------

. *lincom 1.sgtf + 1.sgtf#2.eth5, eform   // S Asian
. *lincom 1.sgtf + 1.sgtf#3.eth5, eform   // Black
. *lincom 1.sgtf + 1.sgtf#4.eth5, eform   // Mixed
. lincom 1.sgtf + 1.sgtf#5.eth2, eform    // Other

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.eth2 = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9335898   .1009038    -0.64   0.525     .7553652    1.153866
------------------------------------------------------------------------------

. *lincom 1.sgtf + 1.sgtf#6.eth2, eform   // Missing
. 
. 
. 
. /* Comorbidities */
. glm risk_28 i.sgtf##ib0.comorb_cat ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib1.start_
> week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.669  
Iteration 1:   log likelihood = -9828.8336  
Iteration 2:   log likelihood = -9807.4822  
Iteration 3:   log likelihood = -9807.4653  
Iteration 4:   log likelihood = -9807.4653  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,982
                                                  Scale parameter =          1
Deviance         =  19614.93064                   (1/df) Deviance =   .1582079
Pearson          =  124046.6455                   (1/df) Pearson  =   1.000521

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588019
Log likelihood   = -9807.465319                   BIC             =   -1434473

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9376807   .1605679    -0.38   0.707     .6703409    1.311639
             |
  comorb_cat |
1 comorbi..  |   .8029905   .1124582    -1.57   0.117     .6102394    1.056624
2+ comorb..  |   .8566636   .1077351    -1.23   0.219     .6695177    1.096121
             |
        sgtf#|
  comorb_cat |
        VOC #|
1 comorbi..  |   1.239279   .2451987     1.08   0.278     .8409179    1.826351
        VOC #|
2+ comorb..  |   .9935592   .1786912    -0.04   0.971      .698402    1.413455
             |
   agegroupA |
      0-<65  |   1.138044   .0932995     1.58   0.115     .9691155    1.336419
     75-<85  |   1.096953   .1361017     0.75   0.456     .8601564    1.398939
        85+  |   1.353027   .2122366     1.93   0.054     .9949161    1.840037
             |
        male |
          M  |   1.012716   .0468344     0.27   0.785     .9249594    1.108798
             |
         imd |
          2  |   1.018924   .0667654     0.29   0.775     .8961207    1.158556
          3  |   .8184327   .0570037    -2.88   0.004     .7139979    .9381429
          4  |    .998826   .0656932    -0.02   0.986     .8780232     1.13625
5 most de..  |   1.023136    .084475     0.28   0.782     .8702698    1.202853
             |
        eth2 |
      Other  |   .9648354    .059947    -0.58   0.565     .8542136    1.089783
    Missing  |   .9776653   .0543392    -0.41   0.684     .8767584    1.090186
             |
smoke_nomi~2 |
     Former  |    1.00052   .0666876     0.01   0.994     .8779924    1.140147
             |
   obese4cat |
Obese I ..)  |   1.123778   .0718627     1.82   0.068     .9913991    1.273834
Obese II..)  |   1.003554   .0663916     0.05   0.957     .8815123    1.142492
Obese II..)  |   1.050592   .0634634     0.82   0.414     .9332871    1.182641
             |
hh_total_cat |
        3-5  |   .9827186    .045469    -0.38   0.706     .8975224    1.076002
       6-10  |   .7505434   .5345815    -0.40   0.687     .1858231    3.031461
             |
      region |
     London  |    1.06759   .0933188     0.75   0.454      .899498    1.267093
 North East  |   1.095742   .1094436     0.92   0.360     .9009269    1.332683
 North West  |   1.025097   .1040625     0.24   0.807     .8401471    1.250761
 South East  |   1.193727   .1167892     1.81   0.070     .9854328    1.446049
 South West  |   1.105936   .1100942     1.01   0.312      .909901    1.344206
West Midl..  |   1.078899   .1082416     0.76   0.449     .8863049    1.313344
Yorkshire..  |   1.127148   .1118492     1.21   0.228     .9279284    1.369139
             |
rural_urban5 |
Urban min..  |   .9169566   .0977561    -0.81   0.416      .744051    1.130043
Urban cit..  |   1.077867    .096183     0.84   0.401      .904917    1.283873
Rural tow..  |   1.036237   .0930207     0.40   0.692     .8690579    1.235577
Rural vil..  |   1.009879   .0831542     0.12   0.905     .8593717    1.186747
             |
  start_week |
23Nov-29Nov  |   1.165067    .097226     1.83   0.067     .9892757    1.372096
30Nov-06Dec  |   1.126773   .0955225     1.41   0.159     .9542791    1.330446
07Dec-13Dec  |   1.020367   .0890952     0.23   0.817     .8598692    1.210823
14Dec-20Dec  |   1.096108   .0956401     1.05   0.293     .9238094    1.300542
21Dec-27Dec  |   1.127049   .0990646     1.36   0.174     .9486903     1.33894
28Dec-04Jan  |   1.113086   .1086877     1.10   0.273     .9192063     1.34786
             |
    home_bin |
  Care home  |   1.075123   .0675771     1.15   0.249     .9505081    1.216076
       _cons |    .013565   .0025977   -22.46   0.000       .00932    .0197434
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_comorbX

. 
. * Test for interaction
. lrtest e_no_int e_comorbX

Likelihood-ratio test                                 LR chi2(2)  =      3.88
(Assumption: e_no_int nested in e_comorbX)            Prob > chi2 =    0.1440

. 
. * Comorbidities VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                            // no comorbs

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9376807   .1605679    -0.38   0.707     .6703409    1.311639
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.comorb_cat, eform      // 1 comorb

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#1.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.162048   .1151905     1.52   0.130     .9568563    1.411241
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.comorb_cat, eform      // 2+ comorbs

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9316413    .051215    -1.29   0.198     .8364803    1.037628
------------------------------------------------------------------------------

. 
. 
. 
. /* IMD */
. glm risk_28 i.sgtf##ib1.imd ib2.agegroupA i.male ib1.eth2 ib1.smoke_nomiss2 i
> b1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.731  
Iteration 1:   log likelihood = -9829.1507  
Iteration 2:   log likelihood = -9807.9152  
Iteration 3:   log likelihood = -9807.8937  
Iteration 4:   log likelihood = -9807.8937  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,980
                                                  Scale parameter =          1
Deviance         =  19615.78745                   (1/df) Deviance =   .1582174
Pearson          =   124040.182                   (1/df) Pearson  =   1.000485

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588411
Log likelihood   = -9807.893725                   BIC             =   -1434448

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.047656    .087237     0.56   0.576     .8898983    1.233381
             |
         imd |
          2  |   1.018003   .0953747     0.19   0.849      .847231    1.223197
          3  |   .8964763   .0870541    -1.13   0.260     .7411075    1.084417
          4  |   1.042808     .09727     0.45   0.653     .8685743    1.251993
5 most de..  |    1.12363   .1280839     1.02   0.307      .898657    1.404924
             |
    sgtf#imd |
      VOC#2  |   1.002609   .1314218     0.02   0.984     .7754549    1.296305
      VOC#3  |   .8320235    .116063    -1.32   0.187     .6329908    1.093639
      VOC#4  |   .9191077   .1209113    -0.64   0.521     .7102126    1.189445
        VOC #|
5 most de..  |   .8244893   .1364858    -1.17   0.244     .5960426    1.140493
             |
   agegroupA |
      0-<65  |   1.138624   .0933459     1.58   0.113     .9696119    1.337097
     75-<85  |   1.098049   .1362351     0.75   0.451     .8610195     1.40033
        85+  |   1.353013   .2122346     1.93   0.054     .9949061    1.840018
             |
        male |
          M  |   1.012817   .0468395     0.28   0.783     .9250511     1.10891
             |
        eth2 |
      Other  |    .965124   .0599648    -0.57   0.568     .8544694    1.090108
    Missing  |   .9782776   .0543734    -0.40   0.693     .8773073    1.090869
             |
smoke_nomi~2 |
     Former  |    1.00054   .0666895     0.01   0.994     .8780091    1.140171
             |
   obese4cat |
Obese I ..)  |   1.123968    .071874     1.83   0.068     .9915684    1.274047
Obese II..)  |   1.004034   .0664242     0.06   0.951      .881932     1.14304
Obese II..)  |   1.050473   .0634568     0.82   0.415     .9331805    1.182508
             |
hh_total_cat |
        3-5  |   .9822011   .0454457    -0.39   0.698     .8970486    1.075437
       6-10  |    .745498   .5309941    -0.41   0.680     .1845709    3.011132
             |
      region |
     London  |   1.067095   .0932751     0.74   0.458     .8990817    1.266505
 North East  |   1.095589   .1094301     0.91   0.361     .9007987    1.332502
 North West  |   1.025163   .1040704     0.24   0.807     .8401991    1.250844
 South East  |   1.194208   .1168384     1.81   0.070     .9858265    1.446637
 South West  |   1.105405   .1100414     1.01   0.314     .9094646    1.343561
West Midl..  |   1.077973   .1081471     0.75   0.454     .8855469    1.312213
Yorkshire..  |   1.127662   .1119007     1.21   0.226     .9283507    1.369764
             |
rural_urban5 |
Urban min..  |   .9179481   .0978614    -0.80   0.422     .7448564    1.131263
Urban cit..  |    1.07727   .0961293     0.83   0.404     .9044165    1.283161
Rural tow..  |    1.03613   .0930108     0.40   0.693     .8689689    1.235448
Rural vil..  |   1.010261   .0831854     0.12   0.901     .8596971    1.187195
             |
  comorb_cat |
1 comorbi..  |   .8957117   .0885458    -1.11   0.265     .7379425    1.087211
2+ comorb..  |   .8534878    .076736    -1.76   0.078     .7155943    1.017953
             |
  start_week |
23Nov-29Nov  |   1.165219   .0972401     1.83   0.067     .9894022    1.372278
30Nov-06Dec  |   1.126852   .0955295     1.41   0.159     .9543462     1.33054
07Dec-13Dec  |   1.020127    .089075     0.23   0.819     .8596651     1.21054
14Dec-20Dec  |   1.095677   .0956019     1.05   0.295     .9234475    1.300029
21Dec-27Dec  |   1.126984   .0990596     1.36   0.174     .9486341    1.338864
28Dec-04Jan  |   1.112921   .1086691     1.10   0.273     .9190733    1.347653
             |
    home_bin |
  Care home  |   1.074274   .0675237     1.14   0.254     .9497572    1.215115
       _cons |   .0128318   .0022788   -24.53   0.000     .0090598    .0181741
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_imdX

. 
. * Test for interaction
. lrtest e_no_int e_imdX

Likelihood-ratio test                                 LR chi2(4)  =      3.02
(Assumption: e_no_int nested in e_imdX)               Prob > chi2 =    0.5547

. 
. * IMD VOC vs. non-VOC OR
. lincom 1.sgtf, eform                            // 1 least deprived

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.047656    .087237     0.56   0.576     .8898983    1.233381
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.imd, eform     // 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.05039    .106337     0.49   0.627     .8613481    1.280922
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.imd, eform     // 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8716748   .0975544    -1.23   0.220     .6999892    1.085469
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.imd, eform     // 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9629091   .0980764    -0.37   0.711     .7886545    1.175666
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.imd, eform     // 5 most deprived

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8637815   .1235814    -1.02   0.306     .6525628    1.143367
------------------------------------------------------------------------------

. 
. 
. 
. /* Epi week */
. glm risk_28 i.sgtf##ib1.start_week ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.442  
Iteration 1:   log likelihood = -9827.6567  
Iteration 2:   log likelihood = -9805.6471  
Iteration 3:   log likelihood = -9805.6306  
Iteration 4:   log likelihood = -9805.6306  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,978
                                                  Scale parameter =          1
Deviance         =  19611.26124                   (1/df) Deviance =   .1581834
Pearson          =  124017.6389                   (1/df) Pearson  =    1.00032

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588368
Log likelihood   = -9805.630618                   BIC             =   -1434429

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9123766   .1142585    -0.73   0.464     .7138003    1.166196
             |
  start_week |
23Nov-29Nov  |   1.231242   .1413138     1.81   0.070     .9832138    1.541837
30Nov-06Dec  |   1.080257   .1286972     0.65   0.517     .8553002    1.364381
07Dec-13Dec  |   .9807336   .1196634    -0.16   0.873     .7721335    1.245689
14Dec-20Dec  |   .9359714   .1179521    -0.53   0.600     .7311278    1.198207
21Dec-27Dec  |   1.106052     .13597     0.82   0.412     .8692305    1.407395
28Dec-04Jan  |   1.021177   .1414134     0.15   0.880     .7784416    1.339603
             |
        sgtf#|
  start_week |
        VOC #|
23Nov-29Nov  |   .8859484   .1482202    -0.72   0.469     .6382655    1.229746
        VOC #|
30Nov-06Dec  |   1.088527   .1845953     0.50   0.617     .7807104    1.517708
        VOC #|
07Dec-13Dec  |   1.082117   .1890117     0.45   0.651     .7684152    1.523885
        VOC #|
14Dec-20Dec  |    1.35594   .2372844     1.74   0.082     .9622397    1.910722
        VOC #|
21Dec-27Dec  |   1.038334   .1825681     0.21   0.831     .7356516    1.465555
        VOC #|
28Dec-04Jan  |   1.187095   .2319012     0.88   0.380     .8094714    1.740881
             |
   agegroupA |
      0-<65  |   1.139641   .0934336     1.59   0.111       .97047    1.338301
     75-<85  |    1.09855      .1363     0.76   0.449     .8614079    1.400976
        85+  |   1.355345   .2126067     1.94   0.053     .9966114    1.843206
             |
        male |
          M  |   1.012559   .0468288     0.27   0.787     .9248134    1.108631
             |
         imd |
          2  |   1.018906    .066766     0.29   0.775     .8961021     1.15854
          3  |    .818894   .0570365    -2.87   0.004     .7143992    .9386731
          4  |    .999787   .0657569    -0.00   0.997     .8788669    1.137344
5 most de..  |   1.024055   .0845563     0.29   0.773     .8710433    1.203947
             |
        eth2 |
      Other  |   .9649014   .0599523    -0.58   0.565     .8542701     1.08986
    Missing  |    .978397   .0543813    -0.39   0.694      .877412    1.091005
             |
smoke_nomi~2 |
     Former  |   1.000124   .0666626     0.00   0.999     .8776419    1.139698
             |
   obese4cat |
Obese I ..)  |   1.124698   .0719249     1.84   0.066     .9922046    1.274884
Obese II..)  |   1.004095   .0664277     0.06   0.951     .8819872    1.143109
Obese II..)  |   1.050338   .0634513     0.81   0.416     .9330561    1.182362
             |
hh_total_cat |
        3-5  |   .9819832   .0454359    -0.39   0.694     .8968491    1.075199
       6-10  |   .7540231   .5370823    -0.40   0.692     .1866738    3.045692
             |
      region |
     London  |   1.066293   .0932076     0.73   0.463      .898402    1.265559
 North East  |    1.09489   .1093613     0.91   0.364     .9002216    1.331654
 North West  |   1.025126   .1040684     0.24   0.807     .8401659    1.250804
 South East  |   1.192104   .1166347     1.80   0.072     .9840863    1.444093
 South West  |   1.104422   .1099468     1.00   0.318     .9086505    1.342374
West Midl..  |   1.077489   .1081041     0.74   0.457     .8851408    1.311637
Yorkshire..  |   1.126538    .111793     1.20   0.230     .9274191    1.368408
             |
rural_urban5 |
Urban min..  |    .916349   .0976953    -0.82   0.413     .7435518    1.129303
Urban cit..  |    1.07664   .0960756     0.83   0.408      .903883    1.282415
Rural tow..  |   1.035363   .0929442     0.39   0.699     .8683214    1.234539
Rural vil..  |   1.009051   .0830884     0.11   0.913     .8586631    1.185779
             |
  comorb_cat |
1 comorbi..  |   .8964495   .0886225    -1.11   0.269     .7385442    1.088116
2+ comorb..  |   .8544351   .0768236    -1.75   0.080     .7163846    1.019089
             |
    home_bin |
  Care home  |   1.075255    .067587     1.15   0.248     .9506219    1.216229
       _cons |   .0137511   .0025136   -23.45   0.000     .0096105    .0196757
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_weekX

. 
. * Test for interaction
. lrtest e_no_int e_weekX

Likelihood-ratio test                                 LR chi2(6)  =      7.55
(Assumption: e_no_int nested in e_weekX)              Prob > chi2 =    0.2734

. 
. * Epi week VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                            // week 1

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9123766   .1142585    -0.73   0.464     .7138003    1.166196
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.start_week, eform      // week 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8083186     .08967    -1.92   0.055     .6503624    1.004638
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.start_week, eform      // week 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9931462   .1135708    -0.06   0.952     .7937329    1.242659
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.start_week, eform      // week 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9872978   .1202144    -0.10   0.916     .7776874    1.253405
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.start_week, eform      // week 5

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.237128   .1512257     1.74   0.082     .9735633    1.572045
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.start_week, eform      // week 6

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9473519   .1169268    -0.44   0.661     .7437926    1.206621
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.start_week, eform      // week 7

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.083077   .1623837     0.53   0.595     .8073103    1.453043
------------------------------------------------------------------------------

. 
. 
. 
. /* NHS region */
. 
. /*
> glm risk_28 i.sgtf i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week i.region, ///
>                         family(bin) link(log) eform
>                         
> est store e_region
> */
. 
. glm risk_28 i.sgtf##i.region ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_
> nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -15696.422  
Iteration 1:   log likelihood = -9827.5287  
Iteration 2:   log likelihood = -9805.3019  
Iteration 3:   log likelihood =  -9805.284  
Iteration 4:   log likelihood =  -9805.284  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,977
                                                  Scale parameter =          1
Deviance         =  19610.56791                   (1/df) Deviance =   .1581791
Pearson          =  124086.0711                   (1/df) Pearson  =    1.00088

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588474
Log likelihood   = -9805.283953                   BIC             =   -1434418

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .7699787   .1118613    -1.80   0.072     .5791852    1.023623
             |
      region |
     London  |   .9816523   .1162864    -0.16   0.876     .7782596      1.2382
 North East  |    .940819   .1300107    -0.44   0.659     .7175951    1.233482
 North West  |   .9588198   .1321761    -0.31   0.760     .7318066    1.256254
 South East  |   .9715713   .1330006    -0.21   0.833     .7429366    1.270567
 South West  |   1.024132   .1392644     0.18   0.861     .7845256    1.336918
West Midl..  |   .8652163   .1220415    -1.03   0.305      .656236    1.140747
Yorkshire..  |   .9983584   .1360506    -0.01   0.990     .7643452    1.304017
             |
 sgtf#region |
 VOC#London  |   1.197361   .2103439     1.03   0.305      .848579      1.6895
        VOC #|
 North East  |   1.374638   .2756213     1.59   0.113     .9279367    2.036377
        VOC #|
 North West  |   1.154578   .2354126     0.70   0.481     .7742257    1.721785
        VOC #|
 South East  |   1.521742   .2992495     2.14   0.033     1.035029    2.237325
        VOC #|
 South West  |   1.181325   .2360854     0.83   0.404     .7984696    1.747754
        VOC #|
West Midl..  |   1.563896    .315419     2.22   0.027     1.053248    2.322122
        VOC #|
Yorkshire..  |   1.292974   .2575426     1.29   0.197     .8750689    1.910458
             |
   agegroupA |
      0-<65  |   1.137661   .0932705     1.57   0.116     .9687856    1.335975
     75-<85  |   1.097258   .1361406     0.75   0.454     .8603935     1.39933
        85+  |   1.352483   .2121592     1.92   0.054     .9945048    1.839318
             |
        male |
          M  |   1.012777   .0468398     0.27   0.784     .9250105    1.108871
             |
         imd |
          2  |   1.018578   .0667441     0.28   0.779     .8958142    1.158166
          3  |   .8185729   .0570158    -2.87   0.004     .7141161    .9383089
          4  |   .9988278   .0656941    -0.02   0.986     .8780235    1.136253
5 most de..  |   1.021815    .084372     0.26   0.794     .8691364    1.201314
             |
        eth2 |
      Other  |    .964599   .0599351    -0.58   0.562     .8539995    1.089522
    Missing  |   .9779399   .0543568    -0.40   0.688     .8770005    1.090497
             |
smoke_nomi~2 |
     Former  |   .9996016   .0666279    -0.01   0.995     .8771837    1.139104
             |
   obese4cat |
Obese I ..)  |   1.124339   .0719006     1.83   0.067     .9918897    1.274474
Obese II..)  |   1.004258   .0664403     0.06   0.949     .8821266    1.143298
Obese II..)  |   1.050639   .0634694     0.82   0.414     .9333238    1.182701
             |
hh_total_cat |
        3-5  |   .9826098   .0454663    -0.38   0.705     .8974188    1.075888
       6-10  |   .7525231   .5359995    -0.40   0.690     .1863093     3.03952
             |
rural_urban5 |
Urban min..  |    .916575   .0977198    -0.82   0.414     .7437345    1.129583
Urban cit..  |   1.077795   .0961832     0.84   0.401     .9048457    1.283802
Rural tow..  |   1.035153   .0929292     0.38   0.700     .8681389    1.234297
Rural vil..  |   1.009302   .0831116     0.11   0.910     .8588721     1.18608
             |
  comorb_cat |
1 comorbi..  |   .8960093   .0885772    -1.11   0.267     .7381845    1.087577
2+ comorb..  |   .8535556   .0767437    -1.76   0.078     .7156485    1.018038
             |
  start_week |
23Nov-29Nov  |   1.164027   .0971412     1.82   0.069     .9883888    1.370875
30Nov-06Dec  |   1.127046   .0955469     1.41   0.158     .9545085    1.330771
07Dec-13Dec  |   1.020097   .0890732     0.23   0.820     .8596388    1.210506
14Dec-20Dec  |    1.09447   .0954988     1.03   0.301     .9224265    1.298602
21Dec-27Dec  |    1.12583   .0989608     1.35   0.178     .9476589      1.3375
28Dec-04Jan  |   1.112129   .1085946     1.09   0.276     .9184155    1.346702
             |
    home_bin |
  Care home  |   1.073229    .067461     1.12   0.261     .9488283     1.21394
       _cons |   .0149057   .0027437   -22.85   0.000     .0103914    .0213812
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_regionX

. 
. * Test for interaction
. lrtest e_no_int e_regionX

Likelihood-ratio test                                 LR chi2(7)  =      8.24
(Assumption: e_no_int nested in e_regionX)            Prob > chi2 =    0.3120

. 
. * NHS region VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                    // East

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7699787   .1118613    -1.80   0.072     .5791852    1.023623
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.region, eform  // East mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1o.sgtf#1b.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7699787   .1118613    -1.80   0.072     .5791852    1.023623
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.region, eform  // London

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9219428   .0910656    -0.82   0.411     .7596717    1.118876
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.region, eform  // North E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.058442   .1462655     0.41   0.681     .8073091    1.387695
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.region, eform  // North W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8890004   .1271853    -0.82   0.411     .6716212    1.176737
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.region, eform  // South E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.171708   .1552835     1.20   0.232     .9036745    1.519243
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.region, eform  // South W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9095949   .1248346    -0.69   0.490     .6950682    1.190333
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.region, eform  // West mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.204166   .1684684     1.33   0.184      .915376    1.584067
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#8.region, eform  // Yorks & Hum

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#8.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9955625   .1356688    -0.03   0.974     .7622059    1.300363
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3 i.home
> _bin, ///
>                         family(bin) link(logit) eform

Iteration 0:   log likelihood = -17791.902  
Iteration 1:   log likelihood = -11064.581  
Iteration 2:   log likelihood = -11043.096  
Iteration 3:   log likelihood = -11043.054  
Iteration 4:   log likelihood = -11043.054  

Generalized linear models                         Number of obs   =    141,311
Optimization     : ML                             Residual df     =    141,298
                                                  Scale parameter =          1
Deviance         =  22086.10788                   (1/df) Deviance =   .1563087
Pearson          =  141300.3994                   (1/df) Pearson  =   1.000017

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1564783
Log likelihood   = -11043.05394                   BIC             =   -1653527

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9807675   .0428212    -0.44   0.656     .9003303    1.068391
             |
  comorb_cat |
1 comorbi..  |   .9298715   .0880439    -0.77   0.443     .7723743    1.119484
2+ comorb..  |   .8915309   .0769528    -1.33   0.183     .7527741    1.055864
             |
         imd |
          2  |   1.014165   .0626685     0.23   0.820     .8984833     1.14474
          3  |   .8010974    .052919    -3.36   0.001     .7038117    .9118306
          4  |   1.006458   .0622316     0.10   0.917     .8915875    1.136128
5 most de..  |   1.002865   .0784007     0.04   0.971     .8603964    1.168925
             |
smoke_nomi~2 |
     Former  |   .9698192   .0616447    -0.48   0.630     .8562208    1.098489
        age1 |   .9968141    .004512    -0.70   0.481     .9880099    1.005697
        age2 |   1.011663    .014931     0.79   0.432     .9828177    1.041354
        age3 |   .9686394   .0404198    -0.76   0.445      .892571    1.051191
             |
    home_bin |
  Care home  |   1.056674   .0630873     0.92   0.356     .9399855    1.187848
       _cons |   .0147802   .0037082   -16.80   0.000      .009039    .0241679
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. * Age grouped
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 ib2.agegroupA i.home_
> bin, ///
>                         family(bin) link(logit) eform

Iteration 0:   log likelihood = -17791.814  
Iteration 1:   log likelihood = -11064.117  
Iteration 2:   log likelihood = -11042.358  
Iteration 3:   log likelihood = -11042.317  
Iteration 4:   log likelihood = -11042.317  

Generalized linear models                         Number of obs   =    141,311
Optimization     : ML                             Residual df     =    141,298
                                                  Scale parameter =          1
Deviance         =  22084.63473                   (1/df) Deviance =   .1562983
Pearson          =  141305.8987                   (1/df) Pearson  =   1.000056

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1564679
Log likelihood   = -11042.31737                   BIC             =   -1653529

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9809101   .0428278    -0.44   0.659     .9004605    1.068547
             |
  comorb_cat |
1 comorbi..  |   .9308358    .088137    -0.76   0.449     .7731723     1.12065
2+ comorb..  |   .8921271   .0770049    -1.32   0.186     .7532764    1.056572
             |
         imd |
          2  |   1.014249   .0626746     0.23   0.819     .8985559    1.144837
          3  |    .801453    .052943    -3.35   0.001     .7041232    .9122364
          4  |   1.006807   .0622543     0.11   0.913     .8918945    1.136525
5 most de..  |    1.00317    .078426     0.04   0.968     .8606555    1.169284
             |
smoke_nomi~2 |
     Former  |    .969968   .0616547    -0.48   0.631     .8563512    1.098659
             |
   agegroupA |
      0-<65  |   1.069946   .0808153     0.90   0.371     .9227172    1.240666
     75-<85  |   1.067438   .1228618     0.57   0.571     .8518631    1.337568
        85+  |   1.242259   .1846411     1.46   0.144     .9283149    1.662375
             |
    home_bin |
  Care home  |   1.056356    .063069     0.92   0.358     .9397013    1.187492
       _cons |   .0164881   .0018957   -35.70   0.000     .0131614    .0206557
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. * With region
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 ib2.agegroupA i.home_
> bin i.region, ///
>                         family(bin) link(logit) eform

Iteration 0:   log likelihood = -16071.086  
Iteration 1:   log likelihood = -10070.584  
Iteration 2:   log likelihood = -10051.948  
Iteration 3:   log likelihood = -10051.919  
Iteration 4:   log likelihood = -10051.919  

Generalized linear models                         Number of obs   =    126,948
Optimization     : ML                             Residual df     =    126,928
                                                  Scale parameter =          1
Deviance         =  20103.83835                   (1/df) Deviance =   .1583877
Pearson          =  126940.6966                   (1/df) Pearson  =     1.0001

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1586779
Log likelihood   = -10051.91918                   BIC             =   -1471495

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9760045   .0445909    -0.53   0.595     .8924067    1.067434
             |
  comorb_cat |
1 comorbi..  |   .9015106    .088694    -1.05   0.292     .7434066    1.093239
2+ comorb..  |   .8714412    .077967    -1.54   0.124      .731277    1.038471
             |
         imd |
          2  |   1.005807   .0650874     0.09   0.929     .8859963    1.141819
          3  |   .8079938   .0556212    -3.10   0.002     .7060126    .9247058
          4  |   .9935135   .0644313    -0.10   0.920     .8749267    1.128174
5 most de..  |   1.004911   .0821636     0.06   0.952     .8561144     1.17957
             |
smoke_nomi~2 |
     Former  |   .9966704   .0656711    -0.05   0.960      .875922    1.134064
             |
   agegroupA |
      0-<65  |   1.131371   .0914114     1.53   0.127     .9656742      1.3255
     75-<85  |   1.079678   .1327864     0.62   0.533     .8484135    1.373982
        85+  |   1.367695   .2109052     2.03   0.042      1.01095    1.850328
             |
    home_bin |
  Care home  |   1.081729   .0670432     1.27   0.205      .957994    1.221445
             |
      region |
     London  |    1.05733   .0913737     0.65   0.519     .8925866     1.25248
 North East  |   1.086157   .1072798     0.84   0.403     .8949923    1.318153
 North West  |   1.020244   .1023935     0.20   0.842     .8380616     1.24203
 South East  |   1.206381   .1162038     1.95   0.051     .9988332    1.457054
 South West  |   1.107952   .1088435     1.04   0.297     .9139034    1.343203
West Midl..  |   1.085267   .1073056     0.83   0.408     .8940756    1.317344
Yorkshire..  |   1.121184   .1100313     1.17   0.244     .9249994    1.358979
             |
       _cons |   .0150706   .0020881   -30.28   0.000     .0114866    .0197729
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_logit_models.log
  log type:  text
 closed on:  18 Feb 2021, 16:41:39
-------------------------------------------------------------------------------
