-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_logit_models.log
  log type:  text
 opened on:  16 Mar 2021, 22:07:56

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 25 Feb 2021)

. 
. * DROP MISSING UTLA
. noi di "DROPPING MISSING UTLA DATA"
DROPPING MISSING UTLA DATA

. drop if utla_group==""
(37 observations deleted)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,027 observations deleted)

. 
. noi di "SUBSETTING ON 28-DAY RISK POPULATION"
SUBSETTING ON 28-DAY RISK POPULATION

. keep if risk_pop==1
(0 observations deleted)

. 
. tab sgtf risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

        SGTF |    28-day outcome
  (exposure) |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    73,145      1,128 |    74,273 
             |     98.48       1.52 |    100.00 
-------------+----------------------+----------
         VOC |    73,401      1,106 |    74,507 
             |     98.52       1.48 |    100.00 
-------------+----------------------+----------
       Total |   146,546      2,234 |   148,780 
             |     98.50       1.50 |    100.00 

. 
. 
. 
. *******************
. /* Unadjusted OR */
. *******************
. 
. glm risk_28 i.sgtf, family(bin) link(logit) eform

Iteration 0:   log likelihood = -18707.402  
Iteration 1:   log likelihood = -11616.057  
Iteration 2:   log likelihood = -11596.895  
Iteration 3:   log likelihood = -11596.835  
Iteration 4:   log likelihood = -11596.835  

Generalized linear models                         Number of obs   =    148,780
Optimization     : ML                             Residual df     =    148,778
                                                  Scale parameter =          1
Deviance         =  23193.67039                   (1/df) Deviance =   .1558945
Pearson          =       148780                   (1/df) Pearson  =   1.000013

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1559193
Log likelihood   = -11596.83519                   BIC             =   -1748786

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9770768   .0416604    -0.54   0.587     .8987427    1.062238
       _cons |   .0154214   .0004627  -139.05   0.000     .0145407    .0163555
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. * Absolute odds
. margins sgtf

Adjusted predictions                            Number of obs     =    148,780
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0151872   .0004487    33.84   0.000     .0143077    .0160667
        VOC  |   .0148442    .000443    33.51   0.000     .0139759    .0157126
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted OR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 household_size i.home_bin ///
>                         i.region ib1.rural_urban5 ib1.start_week age1 age2 ag
> e3 ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12672.598  
Iteration 1:   log likelihood = -7937.1994  
Iteration 2:   log likelihood = -7920.3796  
Iteration 3:   log likelihood = -7920.3523  
Iteration 4:   log likelihood = -7920.3523  

Generalized linear models                         Number of obs   =    100,118
Optimization     : ML                             Residual df     =    100,087
                                                  Scale parameter =          1
Deviance         =  15840.70466                   (1/df) Deviance =   .1582694
Pearson          =  100121.8345                   (1/df) Pearson  =   1.000348

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1588396
Log likelihood   =  -7920.35233                   BIC             =   -1136571

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9724734   .0500441    -0.54   0.588      .879173    1.075675
             |
        male |
          M  |   1.071342   .0551335     1.34   0.181     .9685531    1.185039
             |
         imd |
          2  |   1.008401   .0732844     0.12   0.908     .8745267    1.162769
          3  |   .7915522   .0616798    -3.00   0.003      .679441    .9221624
          4  |   .9891007   .0720798    -0.15   0.880     .8574523    1.140962
5 most de..  |   1.000602   .0922971     0.01   0.995     .8351132    1.198885
             |
        eth2 |
      Other  |   .9582779   .0575317    -0.71   0.478     .8518993     1.07794
household_~e |   .9700271   .0240714    -1.23   0.220      .923977    1.018372
             |
    home_bin |
  Care home  |   1.076814   .0751857     1.06   0.289     .9390913    1.234735
             |
      region |
     London  |   1.004114    .095257     0.04   0.965     .8337433    1.209299
 North East  |   1.034696   .1126477     0.31   0.754      .835877    1.280807
 North West  |   .9666051   .1069405    -0.31   0.759     .7781733    1.200665
 South East  |   1.082535   .1161365     0.74   0.460     .8772498    1.335859
 South West  |   .9851677   .1084972    -0.14   0.892     .7939018    1.222513
West Midl..  |   .9749958   .1077104    -0.23   0.819     .7851782    1.210702
Yorkshire..  |   1.037951    .113008     0.34   0.732     .8384963    1.284849
             |
rural_urban5 |
Urban min..  |   .8799209   .1028222    -1.09   0.274     .6998055    1.106394
Urban cit..  |   .9825941   .0962355    -0.18   0.858     .8109746    1.190532
Rural tow..  |   .9465582   .0932057    -0.56   0.577     .7804251    1.148057
Rural vil..  |   .9644345   .0862566    -0.40   0.686      .809363    1.149217
             |
  start_week |
23Nov-29Nov  |   1.222373   .1172103     2.09   0.036     1.012941    1.475106
30Nov-06Dec  |   1.114429   .1099689     1.10   0.272     .9184551    1.352218
07Dec-13Dec  |   1.100908   .1096483     0.97   0.334     .9056767    1.338225
14Dec-20Dec  |   1.173774   .1173082     1.60   0.109     .9649712    1.427757
21Dec-27Dec  |   1.135357   .1158633     1.24   0.214     .9295382    1.386748
28Dec-03Jan  |   1.238416   .1253575     2.11   0.035     1.015558     1.51018
04Jan-11Jan  |   .7207348   .1833342    -1.29   0.198     .4377785    1.186579
             |
        age1 |   .9991854   .0053598    -0.15   0.879     .9887354    1.009746
        age2 |   1.003446   .0174849     0.20   0.844     .9697544    1.038307
        age3 |   .9922484   .0488098    -0.16   0.874     .9010499    1.092677
       _cons |    .014807   .0046671   -13.37   0.000     .0079831     .027464
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted OR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 ib1.hh_total_cat i.home_bin ///
>                         i.region ib1.rural_urban5 ib1.start_week ib2.agegroup
> A ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12364.023  
Iteration 1:   log likelihood = -7730.2382  
Iteration 2:   log likelihood = -7713.0272  
Iteration 3:   log likelihood = -7712.9958  
Iteration 4:   log likelihood = -7712.9957  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,765
                                                  Scale parameter =          1
Deviance         =  15425.99149                   (1/df) Deviance =   .1577864
Pearson          =  97830.63728                   (1/df) Pearson  =   1.000671

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1583892
Log likelihood   = -7712.995747                   BIC             =   -1107957

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9732201   .0507649    -0.52   0.603     .8786398    1.077981
             |
        male |
          M  |   1.073792   .0560129     1.36   0.172     .9694347    1.189384
             |
         imd |
          2  |   1.015463   .0749656     0.21   0.835     .8786682    1.173554
          3  |   .8111921   .0638575    -2.66   0.008      .695211    .9465223
          4  |   .9927668   .0735709    -0.10   0.922     .8585535    1.147961
5 most de..  |   1.024656   .0954014     0.26   0.794     .8537416    1.229787
             |
        eth2 |
      Other  |   .9649918   .0586188    -0.59   0.557      .856677    1.087002
             |
hh_total_cat |
        3-5  |   .9566067   .0499133    -0.85   0.395     .8636144    1.059612
       6-10  |   .4766705   .4788647    -0.74   0.461     .0665424    3.414585
             |
    home_bin |
  Care home  |   1.069152   .0758339     0.94   0.346     .9303888    1.228611
             |
      region |
     London  |   1.012526   .0973567     0.13   0.897      .838612    1.222506
 North East  |   1.047637   .1154232     0.42   0.673     .8441695    1.300145
 North West  |   .9701618   .1088117    -0.27   0.787     .7787083    1.208686
 South East  |   1.072948   .1170804     0.65   0.519     .8663542    1.328808
 South West  |   .9783101   .1095532    -0.20   0.845     .7855199    1.218417
West Midl..  |   .9744212   .1092965    -0.23   0.817     .7821161     1.21401
Yorkshire..  |    1.04122   .1148833     0.37   0.714     .8387353    1.292588
             |
rural_urban5 |
Urban min..  |   .8748305   .1036363    -1.13   0.259     .6935645    1.103471
Urban cit..  |   .9877401   .0979317    -0.12   0.901     .8132956    1.199601
Rural tow..  |   .9527239   .0949231    -0.49   0.627     .7837164    1.158178
Rural vil..  |   .9587527   .0869101    -0.46   0.642     .8026864    1.145163
             |
  start_week |
23Nov-29Nov  |   1.233692   .1199724     2.16   0.031     1.019601    1.492737
30Nov-06Dec  |   1.114976   .1117647     1.09   0.278     .9160971    1.357031
07Dec-13Dec  |   1.095226   .1109623     0.90   0.369     .8979763    1.335805
14Dec-20Dec  |   1.191236   .1205878     1.73   0.084     .9768575     1.45266
21Dec-27Dec  |   1.160658   .1197073     1.44   0.149     .9482297    1.420676
28Dec-03Jan  |   1.231954   .1269348     2.02   0.043     1.006678    1.507642
04Jan-11Jan  |   .7436999   .1894445    -1.16   0.245     .4514078    1.225255
             |
   agegroupA |
      0-<65  |   1.106762    .101447     1.11   0.268      .924767    1.324575
     75-<85  |   1.136859   .1561524     0.93   0.350     .8685416    1.488068
        85+  |   1.444946   .2472982     2.15   0.032     1.033168    2.020842
             |
       _cons |     .01313   .0021865   -26.02   0.000     .0094737    .0181974
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. ***********************************************************
. /* Fully adjusted OR - age as spline, continuous hh size */
. ***********************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.obese4cat ho
> usehold_size ///
>                         i.region ib1.rural_urban5 ib0.comorb_cat ib1.start_we
> ek age1 age2 age3 i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12672.329  
Iteration 1:   log likelihood =  -7935.802  
Iteration 2:   log likelihood = -7918.1927  
Iteration 3:   log likelihood = -7918.1667  
Iteration 4:   log likelihood = -7918.1667  

Generalized linear models                         Number of obs   =    100,118
Optimization     : ML                             Residual df     =    100,081
                                                  Scale parameter =          1
Deviance         =  15836.33333                   (1/df) Deviance =   .1582352
Pearson          =  100137.3302                   (1/df) Pearson  =   1.000563

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1589158
Log likelihood   = -7918.166664                   BIC             =   -1136507

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9725016   .0500494    -0.54   0.588     .8791916    1.075715
             |
        male |
          M  |   1.071267   .0551344     1.34   0.181     .9684774    1.184967
             |
         imd |
          2  |    1.00899   .0733316     0.12   0.902     .8750303    1.163458
          3  |   .7916306   .0616879    -3.00   0.003     .6795048    .9222583
          4  |   .9895092   .0721127    -0.14   0.885     .8578013     1.14144
5 most de..  |    1.00115   .0923507     0.01   0.990      .835565    1.199549
             |
        eth2 |
      Other  |   .9587997   .0575668    -0.70   0.483     .8523566    1.078536
             |
smoke_nomi~2 |
     Former  |    .982855   .0730111    -0.23   0.816     .8496854    1.136896
             |
   obese4cat |
Obese I ..)  |   1.078978   .0775955     1.06   0.291     .9371255    1.242303
Obese II..)  |   1.029878   .0750276     0.40   0.686     .8928425    1.187946
Obese II..)  |    1.03519   .0695983     0.51   0.607     .9073854    1.180996
             |
household_~e |   .9702164   .0240816    -1.22   0.223      .924147    1.018582
             |
      region |
     London  |   1.003453   .0951994     0.04   0.971     .8331862    1.208515
 North East  |   1.034565   .1126406     0.31   0.755     .8357592    1.280661
 North West  |   .9667311   .1069577    -0.31   0.760     .7782695     1.20083
 South East  |   1.082302   .1161151     0.74   0.461     .8770554     1.33558
 South West  |   .9846839   .1084485    -0.14   0.889     .7935046    1.221924
West Midl..  |   .9752436   .1077421    -0.23   0.820      .785371     1.21102
Yorkshire..  |    1.03781   .1129976     0.34   0.733     .8383746    1.284687
             |
rural_urban5 |
Urban min..  |   .8793007    .102754    -1.10   0.271     .6993057    1.105625
Urban cit..  |   .9825263   .0962335    -0.18   0.857     .8109111    1.190461
Rural tow..  |   .9468228   .0932349    -0.55   0.579     .7806382    1.148385
Rural vil..  |   .9649859   .0863112    -0.40   0.690     .8098171    1.149887
             |
  comorb_cat |
1 comorbi..  |   .8379447   .0915282    -1.62   0.106     .6764553    1.037986
2+ comorb..  |   .8365066     .08244    -1.81   0.070     .6895744    1.014746
             |
  start_week |
23Nov-29Nov  |    1.22193   .1171756     2.09   0.037     1.012561     1.47459
30Nov-06Dec  |     1.1155   .1100791     1.11   0.268     .9193313    1.353529
07Dec-13Dec  |   1.100879   .1096533     0.96   0.335     .9056401    1.338209
14Dec-20Dec  |   1.174602   .1174005     1.61   0.107     .9656366    1.428787
21Dec-27Dec  |    1.13641   .1159803     1.25   0.210     .9303851    1.388057
28Dec-03Jan  |   1.238098   .1253346     2.11   0.035     1.015282    1.509814
04Jan-11Jan  |   .7199709   .1831458    -1.29   0.197     .4373073     1.18534
             |
        age1 |   .9992201   .0053604    -0.15   0.884     .9887689    1.009782
        age2 |   1.003358   .0174841     0.19   0.847     .9696687    1.038218
        age3 |   .9924593   .0488196    -0.15   0.878     .9012424    1.092908
             |
    home_bin |
  Care home  |   1.076982   .0752034     1.06   0.288     .9392278    1.234941
       _cons |   .0170547   .0056224   -12.35   0.000     .0089378     .032543
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. **************************************************
. /* Fully adjusted OR - age grouped, cat hh size */
. **************************************************
. 
. glm risk_28 i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib
> 1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.717  
Iteration 1:   log likelihood = -7728.6489  
Iteration 2:   log likelihood =  -7710.547  
Iteration 3:   log likelihood = -7710.5164  
Iteration 4:   log likelihood = -7710.5164  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,759
                                                  Scale parameter =          1
Deviance         =  15421.03278                   (1/df) Deviance =   .1577454
Pearson          =  97840.89207                   (1/df) Pearson  =   1.000838

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1584612
Log likelihood   = -7710.516392                   BIC             =   -1107893

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9732538    .050771    -0.52   0.603     .8786625    1.078028
             |
   agegroupA |
      0-<65  |    1.10511   .1013037     1.09   0.276     .9233729    1.322616
     75-<85  |   1.135206   .1559367     0.92   0.356     .8672619    1.485934
        85+  |   1.441284   .2466924     2.14   0.033     1.030521    2.015777
             |
        male |
          M  |   1.073691   .0560132     1.36   0.173      .969333    1.189283
             |
         imd |
          2  |   1.016079   .0750161     0.22   0.829     .8791933    1.174278
          3  |    .811307   .0638691    -2.66   0.008     .6953052    .9466619
          4  |   .9930916   .0735983    -0.09   0.925     .8588285    1.148344
5 most de..  |   1.025247   .0954601     0.27   0.789     .8542277    1.230505
             |
        eth2 |
      Other  |   .9656549   .0586632    -0.58   0.565     .8572583    1.087758
             |
smoke_nomi~2 |
     Former  |   .9890368    .074366    -0.15   0.883     .8535134    1.146079
             |
   obese4cat |
Obese I ..)  |   1.074897   .0784886     0.99   0.323     .9315636    1.240285
Obese II..)  |   1.037143   .0764617     0.49   0.621     .8976051    1.198373
Obese II..)  |    1.03942   .0708202     0.57   0.570     .9094842     1.18792
             |
hh_total_cat |
        3-5  |    .957018   .0499369    -0.84   0.400     .8639819    1.060072
       6-10  |   .4743631   .4765593    -0.74   0.458     .0662169    3.398234
             |
      region |
     London  |   1.011694   .0972822     0.12   0.904     .8379144    1.221515
 North East  |   1.047555   .1154231     0.42   0.673     .8440897    1.300065
 North West  |    .970657   .1088715    -0.27   0.791     .7790991    1.209313
 South East  |   1.072763    .117064     0.64   0.520     .8661987    1.328588
 South West  |   .9778872   .1095109    -0.20   0.842     .7851724    1.217902
West Midl..  |   .9745478   .1093153    -0.23   0.818     .7822105    1.214179
Yorkshire..  |   1.040872   .1148502     0.36   0.717     .8384468    1.292169
             |
rural_urban5 |
Urban min..  |   .8742989   .1035774    -1.13   0.257     .6931366    1.102811
Urban cit..  |   .9879831   .0979605    -0.12   0.903     .8134882    1.199908
Rural tow..  |   .9533273   .0949869    -0.48   0.631     .7842069     1.15892
Rural vil..  |   .9595601   .0869894    -0.46   0.649     .8033523    1.146142
             |
  comorb_cat |
1 comorbi..  |   .8326598   .0914445    -1.67   0.095     .6714085    1.032639
2+ comorb..  |    .818277   .0811009    -2.02   0.043     .6738081     .993721
             |
  start_week |
23Nov-29Nov  |   1.233137   .1199268     2.15   0.031     1.019129    1.492085
30Nov-06Dec  |   1.116121   .1118842     1.10   0.273       .91703    1.358435
07Dec-13Dec  |   1.095157   .1109639     0.90   0.370     .8979059    1.335741
14Dec-20Dec  |   1.191809   .1206557     1.73   0.083     .9773114    1.453383
21Dec-27Dec  |   1.161509   .1198045     1.45   0.147     .9489095     1.42174
28Dec-03Jan  |   1.231781   .1269263     2.02   0.043     1.006522    1.507453
04Jan-11Jan  |   .7428417   .1892335    -1.17   0.243     .4508779    1.223865
             |
    home_bin |
  Care home  |   1.069248   .0758472     0.94   0.345     .9304619    1.228736
       _cons |   .0153426   .0029559   -21.68   0.000     .0105173    .0223816
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. est store fully

. 
. * Adjusted absolute risks
. margins comorb_cat#male#agegroupA if sgtf==0, post asobserved

Predictive margins                              Number of obs     =     48,695
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  comorb_cat#|
        male#|
   agegroupA |
No comorb.. #|
          F #|
      0-<65  |   .0179056   .0017929     9.99   0.000     .0143916    .0214196
No comorb.. #|
          F #|
     65-<75  |   .0162307   .0020988     7.73   0.000     .0121171    .0203442
No comorb.. #|
          F #|
     75-<85  |   .0183841    .002605     7.06   0.000     .0132783    .0234899
No comorb.. #|
          F #|
        85+  |   .0232238    .004013     5.79   0.000     .0153585    .0310891
No comorb.. #|
          M #|
      0-<65  |   .0191993   .0019125    10.04   0.000     .0154508    .0229478
No comorb.. #|
          M #|
     65-<75  |   .0174055   .0022431     7.76   0.000     .0130092    .0218019
No comorb.. #|
          M #|
     75-<85  |   .0197117   .0027815     7.09   0.000     .0142601    .0251632
No comorb.. #|
          M #|
        85+  |   .0248918   .0042841     5.81   0.000     .0164952    .0332885
1 comorbi.. #|
          F #|
      0-<65  |   .0149549   .0010091    14.82   0.000     .0129771    .0169326
1 comorbi.. #|
          F #|
     65-<75  |   .0135521   .0014317     9.47   0.000     .0107461    .0163581
1 comorbi.. #|
          F #|
     75-<85  |   .0153558    .001865     8.23   0.000     .0117004    .0190112
1 comorbi.. #|
          F #|
        85+  |   .0194143    .003055     6.35   0.000     .0134265     .025402
1 comorbi.. #|
          M #|
      0-<65  |   .0160389   .0010758    14.91   0.000     .0139305    .0181474
1 comorbi.. #|
          M #|
     65-<75  |    .014536   .0015312     9.49   0.000     .0115348    .0175371
1 comorbi.. #|
          M #|
     75-<85  |   .0164684   .0019924     8.27   0.000     .0125634    .0203734
1 comorbi.. #|
          M #|
        85+  |   .0208146   .0032638     6.38   0.000     .0144177    .0272116
2+ comorb.. #|
          F #|
      0-<65  |   .0147004   .0007209    20.39   0.000     .0132875    .0161133
2+ comorb.. #|
          F #|
     65-<75  |   .0133212     .00126    10.57   0.000     .0108517    .0157907
2+ comorb.. #|
          F #|
     75-<85  |   .0150946   .0016922     8.92   0.000     .0117779    .0184113
2+ comorb.. #|
          F #|
        85+  |   .0190854   .0028606     6.67   0.000     .0134787    .0246922
2+ comorb.. #|
          M #|
      0-<65  |   .0157663   .0007672    20.55   0.000     .0142625    .0172701
2+ comorb.. #|
          M #|
     65-<75  |   .0142885    .001348    10.60   0.000     .0116465    .0169306
2+ comorb.. #|
          M #|
     75-<85  |   .0161886   .0018079     8.95   0.000     .0126452     .019732
2+ comorb.. #|
          M #|
        85+  |   .0204626   .0030565     6.69   0.000     .0144719    .0264532
------------------------------------------------------------------------------

. 
. * Save risk estimates
. matrix est = e(b)

. matrix inv_est = est'

. svmat inv_est

. 
. * Save SE estimates
. matrix var = e(V)

. matrix diag_var = vecdiag(var)

. matrix inv_var = diag_var'

. svmat inv_var

. gen sq_var = sqrt(inv_var1)
(148,756 missing values generated)

. 
. noi disp "CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE"
CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE

. list inv_est1 sq_var in 1/24

     +---------------------+
     | inv_est1     sq_var |
     |---------------------|
  1. | .0179056   .0017929 |
  2. | .0162307   .0020988 |
  3. | .0183841    .002605 |
  4. | .0232238    .004013 |
  5. | .0191993   .0019125 |
     |---------------------|
  6. | .0174055   .0022431 |
  7. | .0197117   .0027815 |
  8. | .0248918   .0042841 |
  9. | .0149549   .0010091 |
 10. | .0135521   .0014317 |
     |---------------------|
 11. | .0153558    .001865 |
 12. | .0194143    .003055 |
 13. | .0160389   .0010758 |
 14. |  .014536   .0015312 |
 15. | .0164684   .0019924 |
     |---------------------|
 16. | .0208146   .0032638 |
 17. | .0147004   .0007209 |
 18. | .0133212     .00126 |
 19. | .0150946   .0016922 |
 20. | .0190854   .0028606 |
     |---------------------|
 21. | .0157663   .0007672 |
 22. | .0142885    .001348 |
 23. | .0161886   .0018079 |
 24. | .0204626   .0030565 |
     +---------------------+

. 
. * Re-Calculate CI
. gen risk0 = inv_est1*100
(148,756 missing values generated)

. gen lb0 = (inv_est1 - invnormal(0.975)*sq_var)*100
(148,756 missing values generated)

. gen ub0 = (inv_est1 + invnormal(0.975)*sq_var)*100
(148,756 missing values generated)

. 
. order lb ub, after(risk0)

. 
. 
. est restore fully
(results fully are active now)

. 
. * Adjusted absolute risks
. margins comorb_cat#male#agegroupA if sgtf==1, post asobserved

Predictive margins                              Number of obs     =     49,102
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  comorb_cat#|
        male#|
   agegroupA |
No comorb.. #|
          F #|
      0-<65  |   .0174289   .0017464     9.98   0.000     .0140059    .0208519
No comorb.. #|
          F #|
     65-<75  |   .0157978   .0020437     7.73   0.000     .0117922    .0198034
No comorb.. #|
          F #|
     75-<85  |   .0178949   .0025365     7.06   0.000     .0129235    .0228663
No comorb.. #|
          F #|
        85+  |   .0226088   .0039093     5.78   0.000     .0149467    .0302709
No comorb.. #|
          M #|
      0-<65  |   .0186888   .0018639    10.03   0.000     .0150356     .022342
No comorb.. #|
          M #|
     65-<75  |   .0169419   .0021849     7.75   0.000     .0126596    .0212242
No comorb.. #|
          M #|
     75-<85  |   .0191878    .002709     7.08   0.000     .0138783    .0244974
No comorb.. #|
          M #|
        85+  |   .0242338   .0041744     5.81   0.000     .0160522    .0324154
1 comorbi.. #|
          F #|
      0-<65  |   .0145555   .0009873    14.74   0.000     .0126205    .0164905
1 comorbi.. #|
          F #|
     65-<75  |   .0131897   .0013963     9.45   0.000      .010453    .0159264
1 comorbi.. #|
          F #|
     75-<85  |   .0149459   .0018179     8.22   0.000     .0113829     .018509
1 comorbi.. #|
          F #|
        85+  |   .0188982   .0029778     6.35   0.000     .0130618    .0247346
1 comorbi.. #|
          M #|
      0-<65  |   .0156111   .0010536    14.82   0.000     .0135462     .017676
1 comorbi.. #|
          M #|
     65-<75  |   .0141477    .001494     9.47   0.000     .0112194    .0170759
1 comorbi.. #|
          M #|
     75-<85  |   .0160293   .0019427     8.25   0.000     .0122217    .0198369
1 comorbi.. #|
          M #|
        85+  |   .0202621   .0031821     6.37   0.000     .0140253    .0264989
2+ comorb.. #|
          F #|
      0-<65  |   .0143078   .0007043    20.31   0.000     .0129273    .0156882
2+ comorb.. #|
          F #|
     65-<75  |   .0129649   .0012275    10.56   0.000     .0105591    .0153707
2+ comorb.. #|
          F #|
     75-<85  |   .0146916    .001648     8.92   0.000     .0114617    .0179215
2+ comorb.. #|
          F #|
        85+  |   .0185779   .0027868     6.67   0.000     .0131158      .02404
2+ comorb.. #|
          M #|
      0-<65  |   .0153457    .000751    20.43   0.000     .0138738    .0168175
2+ comorb.. #|
          M #|
     65-<75  |   .0139067   .0013139    10.58   0.000     .0113315     .016482
2+ comorb.. #|
          M #|
     75-<85  |   .0157569   .0017613     8.95   0.000     .0123049    .0192089
2+ comorb.. #|
          M #|
        85+  |   .0199192   .0029784     6.69   0.000     .0140816    .0257568
------------------------------------------------------------------------------

. 
. * Save risk estimates
. matrix est1 = e(b)

. matrix inv_estx = est1'

. svmat inv_estx

. 
. * Save SE estimates
. matrix var1 = e(V)

. matrix diag_var1 = vecdiag(var1)

. matrix inv_varx = diag_var1'

. svmat inv_varx

. gen sq_varx = sqrt(inv_varx1)
(148,756 missing values generated)

. 
. noi disp "CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE"
CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE

. list inv_estx1 sq_varx in 1/24

     +---------------------+
     | inv_e~x1    sq_varx |
     |---------------------|
  1. | .0174289   .0017464 |
  2. | .0157978   .0020437 |
  3. | .0178949   .0025365 |
  4. | .0226088   .0039093 |
  5. | .0186888   .0018639 |
     |---------------------|
  6. | .0169419   .0021849 |
  7. | .0191878    .002709 |
  8. | .0242338   .0041744 |
  9. | .0145555   .0009873 |
 10. | .0131897   .0013963 |
     |---------------------|
 11. | .0149459   .0018179 |
 12. | .0188982   .0029778 |
 13. | .0156111   .0010536 |
 14. | .0141477    .001494 |
 15. | .0160293   .0019427 |
     |---------------------|
 16. | .0202621   .0031821 |
 17. | .0143078   .0007043 |
 18. | .0129649   .0012275 |
 19. | .0146916    .001648 |
 20. | .0185779   .0027868 |
     |---------------------|
 21. | .0153457    .000751 |
 22. | .0139067   .0013139 |
 23. | .0157569   .0017613 |
 24. | .0199192   .0029784 |
     +---------------------+

. 
. * Re-Calculate CI
. gen risk1 = inv_estx1*100
(148,756 missing values generated)

. gen lb1 = (inv_estx1 - invnormal(0.975)*sq_varx)*100
(148,756 missing values generated)

. gen ub1 = (inv_estx1 + invnormal(0.975)*sq_varx)*100
(148,756 missing values generated)

. 
. order lb1 ub1, after(risk1)

. 
. 
. * Adjusted risk difference
. est restore fully
(results fully are active now)

. 
. margins comorb_cat#male#agegroupA, dydx(sgtf) post asobserved

Average marginal effects                        Number of obs     =     97,797
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
dy/dx w.r.t. : 1.sgtf

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
0.sgtf       |  (base outcome)
-------------+----------------------------------------------------------------
1.sgtf       |
  comorb_cat#|
        male#|
   agegroupA |
No comorb.. #|
          F #|
      0-<65  |  -.0004703   .0009061    -0.52   0.604    -.0022463    .0013057
No comorb.. #|
          F #|
     65-<75  |  -.0004271   .0008235    -0.52   0.604    -.0020411     .001187
No comorb.. #|
          F #|
     75-<85  |  -.0004827   .0009312    -0.52   0.604    -.0023077    .0013424
No comorb.. #|
          F #|
        85+  |  -.0006067    .001172    -0.52   0.605    -.0029037    .0016902
No comorb.. #|
          M #|
      0-<65  |  -.0005037   .0009703    -0.52   0.604    -.0024054    .0013981
No comorb.. #|
          M #|
     65-<75  |  -.0004574    .000882    -0.52   0.604    -.0021862    .0012713
No comorb.. #|
          M #|
     75-<85  |  -.0005168    .000997    -0.52   0.604     -.002471    .0014373
No comorb.. #|
          M #|
        85+  |  -.0006492   .0012539    -0.52   0.605    -.0031068    .0018084
1 comorbi.. #|
          F #|
      0-<65  |   -.000394   .0007584    -0.52   0.603    -.0018804    .0010924
1 comorbi.. #|
          F #|
     65-<75  |  -.0003575   .0006888    -0.52   0.604    -.0017076    .0009925
1 comorbi.. #|
          F #|
     75-<85  |  -.0004044   .0007795    -0.52   0.604    -.0019322    .0011234
1 comorbi.. #|
          F #|
        85+  |  -.0005092   .0009827    -0.52   0.604    -.0024352    .0014169
1 comorbi.. #|
          M #|
      0-<65  |  -.0004221   .0008124    -0.52   0.603    -.0020144    .0011703
1 comorbi.. #|
          M #|
     65-<75  |  -.0003831   .0007381    -0.52   0.604    -.0018297    .0010635
1 comorbi.. #|
          M #|
     75-<85  |  -.0004332    .000835    -0.52   0.604    -.0020697    .0012033
1 comorbi.. #|
          M #|
        85+  |  -.0005451    .001052    -0.52   0.604     -.002607    .0015168
2+ comorb.. #|
          F #|
      0-<65  |  -.0003874   .0007456    -0.52   0.603    -.0018487    .0010739
2+ comorb.. #|
          F #|
     65-<75  |  -.0003515   .0006771    -0.52   0.604    -.0016787    .0009757
2+ comorb.. #|
          F #|
     75-<85  |  -.0003976   .0007663    -0.52   0.604    -.0018996    .0011043
2+ comorb.. #|
          F #|
        85+  |  -.0005007   .0009662    -0.52   0.604    -.0023945     .001393
2+ comorb.. #|
          M #|
      0-<65  |   -.000415   .0007987    -0.52   0.603    -.0019805    .0011505
2+ comorb.. #|
          M #|
     65-<75  |  -.0003767   .0007256    -0.52   0.604    -.0017988    .0010454
2+ comorb.. #|
          M #|
     75-<85  |   -.000426   .0008209    -0.52   0.604    -.0020349     .001183
2+ comorb.. #|
          M #|
        85+  |  -.0005361   .0010344    -0.52   0.604    -.0025635    .0014913
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. * Save risk estimates
. matrix diff = e(b)

. matrix diff = diff[1, 25..48]

. matrix inv_diff = diff'

. svmat inv_diff

. 
. * Save SE estimates
. matrix dvar = e(V)

. matrix diag_dvar = vecdiag(dvar)

. matrix inv_dvar = diag_dvar'

. matrix inv_dvar = inv_dvar[25..48,1]

. svmat inv_dvar

. gen sq_dvar = sqrt(inv_dvar1)
(148,756 missing values generated)

. 
. noi disp "CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE"
CHECK MARGINS ARE CORRECTLY CALCULATED TO MATCH ABOVE

. list inv_diff1 sq_dvar in 1/24

     +----------------------+
     | inv_diff1    sq_dvar |
     |----------------------|
  1. | -.0004703   .0009061 |
  2. | -.0004271   .0008235 |
  3. | -.0004827   .0009312 |
  4. | -.0006067    .001172 |
  5. | -.0005037   .0009703 |
     |----------------------|
  6. | -.0004574    .000882 |
  7. | -.0005168    .000997 |
  8. | -.0006492   .0012539 |
  9. |  -.000394   .0007584 |
 10. | -.0003575   .0006888 |
     |----------------------|
 11. | -.0004044   .0007795 |
 12. | -.0005092   .0009827 |
 13. | -.0004221   .0008124 |
 14. | -.0003831   .0007381 |
 15. | -.0004332    .000835 |
     |----------------------|
 16. | -.0005451    .001052 |
 17. | -.0003874   .0007456 |
 18. | -.0003515   .0006771 |
 19. | -.0003976   .0007663 |
 20. | -.0005007   .0009662 |
     |----------------------|
 21. |  -.000415   .0007987 |
 22. | -.0003767   .0007256 |
 23. |  -.000426   .0008209 |
 24. | -.0005361   .0010344 |
     +----------------------+

. 
. * Re-Calculate CI
. gen diff1 = inv_diff1*100
(148,756 missing values generated)

. gen dlb = (inv_diff1 - invnormal(0.975)*sq_dvar)*100
(148,756 missing values generated)

. gen dub = (inv_diff1 + invnormal(0.975)*sq_dvar)*100
(148,756 missing values generated)

. 
. order dlb dub, after(diff1)

. 
. 
. gen risk_labels = "Female: 0-<65" in 1
(148,779 missing values generated)

. replace risk_labels = "65-<75" in 2
(1 real change made)

. replace risk_labels = "75-<85" in 3
(1 real change made)

. replace risk_labels = "85+" in 4
(1 real change made)

. 
. replace risk_labels = "Male: 0-<65" in 5
(1 real change made)

. replace risk_labels = "65-<75" in 6
(1 real change made)

. replace risk_labels = "75-<85" in 7
(1 real change made)

. replace risk_labels = "85+" in 8
(1 real change made)

. 
. replace risk_labels = "Female: 0-<65" in 9
(1 real change made)

. replace risk_labels = "65-<75" in 10
(1 real change made)

. replace risk_labels = "75-<85" in 11
(1 real change made)

. replace risk_labels = "85+" in 12
(1 real change made)

. 
. replace risk_labels = "Male: 0-<65" in 13
(1 real change made)

. replace risk_labels = "65-<75" in 14
(1 real change made)

. replace risk_labels = "75-<85" in 15
(1 real change made)

. replace risk_labels = "85+" in 16
(1 real change made)

. 
. replace risk_labels = "Female: 0-<65" in 17
(1 real change made)

. replace risk_labels = "65-<75" in 18
(1 real change made)

. replace risk_labels = "75-<85" in 19
(1 real change made)

. replace risk_labels = "85+" in 20
(1 real change made)

. 
. replace risk_labels = "Male: 0-<65" in 21
(1 real change made)

. replace risk_labels = "65-<75" in 22
(1 real change made)

. replace risk_labels = "75-<85" in 23
(1 real change made)

. replace risk_labels = "85+" in 24
(1 real change made)

. 
. 
. 
. ***********************************
. /* Output table of absolute risk */
. ***********************************
. 
. cap file close tablecontent

. 
. file open tablecontent using ./output/table3_abs_risk.txt, write text replace
(note: file ./output/table3_abs_risk.txt not found)

. 
. file write tablecontent ("Table 3: Absolute risk of death by 28-days") _n _n

. 
. file write tablecontent ("Comorbidities/Sex/Age group")         _tab ///
>                                                 ("non-VOC (95% CI)")         
>                    _tab ///
>                                                 ("VOC (95% CI)")             
>                            _tab ///
>                                                 ("Diff (95% CI)")            
>                            _n

. 
. forvalues i=1/24 {
  2.         
.         preserve
  3.                 keep if _n == `i'
  4.                 if inlist(`i',5,13,21) {
  5.                         file write tablecontent _n
  6.                 }
  7.                 if `i'==1 {
  8.                         file write tablecontent _n ("No Comorbidities") _n
  9.                 }
 10.                 if `i'==9 {
 11.                         file write tablecontent _n ("1 Comorbidity") _n
 12.                 }
 13.                 if `i'==17 {
 14.                         file write tablecontent _n ("2+ Comorbidities") _n
 15.                 }
 16.                 file write tablecontent %9s (risk_labels) _tab %4.2f (risk
> 0) (" (") %4.2f (lb0) ("-") %4.2f (ub0) (")") _tab %4.2f (risk1) (" (") %4.2f
>  (lb1) ("-") %4.2f (ub1) (")") _tab %4.2f (diff1) (" (") %4.2f (dlb) ("-") %4
> .2f (dub) (")") _n
 17.         restore
 18. 
. }
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)
(148,779 observations deleted)

. 
. file close tablecontent

. 
. 
. * Risks as balanced
. est restore fully
(results fully are active now)

. margins comorb_cat#male#agegroupA, post asbalanced over(sgtf) grand

Adjusted predictions                            Number of obs     =     97,797
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : sgtf
at           : 0.sgtf
                   sgtf             (asbalanced)
                   agegroupA        (asbalanced)
                   male             (asbalanced)
                   imd              (asbalanced)
                   eth2             (asbalanced)
                   smoke_nomiss2    (asbalanced)
                   obese4cat        (asbalanced)
                   hh_total_cat     (asbalanced)
                   region           (asbalanced)
                   rural_urban5     (asbalanced)
                   comorb_cat       (asbalanced)
                   start_week       (asbalanced)
                   home_bin         (asbalanced)
               1.sgtf
                   sgtf             (asbalanced)
                   agegroupA        (asbalanced)
                   male             (asbalanced)
                   imd              (asbalanced)
                   eth2             (asbalanced)
                   smoke_nomiss2    (asbalanced)
                   obese4cat        (asbalanced)
                   hh_total_cat     (asbalanced)
                   region           (asbalanced)
                   rural_urban5     (asbalanced)
                   comorb_cat       (asbalanced)
                   start_week       (asbalanced)
                   home_bin         (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf#|
  comorb_cat#|
        male#|
   agegroupA |
    non-VOC #|
No comorb.. #|
          F #|
      0-<65  |   .0136123    .004739     2.87   0.004      .004324    .0229007
    non-VOC #|
No comorb.. #|
          F #|
     65-<75  |   .0123336   .0044137     2.79   0.005     .0036829    .0209843
    non-VOC #|
No comorb.. #|
          F #|
     75-<85  |   .0139779   .0050673     2.76   0.006     .0040461    .0239097
    non-VOC #|
No comorb.. #|
          F #|
        85+  |     .01768   .0066279     2.67   0.008     .0046896    .0306704
    non-VOC #|
No comorb.. #|
          M #|
      0-<65  |   .0146008   .0050771     2.88   0.004     .0046499    .0245517
    non-VOC #|
No comorb.. #|
          M #|
     65-<75  |   .0132304   .0047295     2.80   0.005     .0039607    .0225001
    non-VOC #|
No comorb.. #|
          M #|
     75-<85  |   .0149925   .0054278     2.76   0.006     .0043541    .0256308
    non-VOC #|
No comorb.. #|
          M #|
        85+  |   .0189581   .0070951     2.67   0.008     .0050521    .0328642
    non-VOC #|
1 comorbi.. #|
          F #|
      0-<65  |   .0113603   .0038734     2.93   0.003     .0037686     .018952
    non-VOC #|
1 comorbi.. #|
          F #|
     65-<75  |   .0102909   .0036087     2.85   0.004     .0032179    .0173639
    non-VOC #|
1 comorbi.. #|
          F #|
     75-<85  |   .0116661   .0041512     2.81   0.005       .00353    .0198022
    non-VOC #|
1 comorbi.. #|
          F #|
        85+  |   .0147651   .0054461     2.71   0.007     .0040908    .0254393
    non-VOC #|
1 comorbi.. #|
          M #|
      0-<65  |   .0121873   .0041516     2.94   0.003     .0040503    .0203242
    non-VOC #|
1 comorbi.. #|
          M #|
     65-<75  |   .0110409   .0038686     2.85   0.004     .0034585    .0186233
    non-VOC #|
1 comorbi.. #|
          M #|
     75-<85  |    .012515   .0044485     2.81   0.005     .0037961    .0212339
    non-VOC #|
1 comorbi.. #|
          M #|
        85+  |   .0158359   .0058332     2.71   0.007     .0044031    .0272687
    non-VOC #|
2+ comorb.. #|
          F #|
      0-<65  |   .0111663    .003773     2.96   0.003     .0037713    .0185612
    non-VOC #|
2+ comorb.. #|
          F #|
     65-<75  |    .010115   .0035159     2.88   0.004     .0032239     .017006
    non-VOC #|
2+ comorb.. #|
          F #|
     75-<85  |   .0114669    .004046     2.83   0.005     .0035368     .019397
    non-VOC #|
2+ comorb.. #|
          F #|
        85+  |   .0145138   .0053095     2.73   0.006     .0041074    .0249201
    non-VOC #|
2+ comorb.. #|
          M #|
      0-<65  |   .0119793   .0040443     2.96   0.003     .0040525     .019906
    non-VOC #|
2+ comorb.. #|
          M #|
     65-<75  |   .0108523   .0037694     2.88   0.004     .0034644    .0182401
    non-VOC #|
2+ comorb.. #|
          M #|
     75-<85  |   .0123015   .0043362     2.84   0.005     .0038027    .0208002
    non-VOC #|
2+ comorb.. #|
          M #|
        85+  |   .0155666   .0056872     2.74   0.006     .0044199    .0267134
        VOC #|
No comorb.. #|
          F #|
      0-<65  |   .0132531   .0046169     2.87   0.004     .0042042     .022302
        VOC #|
No comorb.. #|
          F #|
     65-<75  |   .0120077   .0042995     2.79   0.005     .0035808    .0204345
        VOC #|
No comorb.. #|
          F #|
     75-<85  |   .0136091   .0049365     2.76   0.006     .0039338    .0232844
        VOC #|
No comorb.. #|
          F #|
        85+  |   .0172153   .0064581     2.67   0.008     .0045576    .0298729
        VOC #|
No comorb.. #|
          M #|
      0-<65  |   .0142158   .0049466     2.87   0.004     .0045206     .023911
        VOC #|
No comorb.. #|
          M #|
     65-<75  |   .0128811   .0046075     2.80   0.005     .0038506    .0219117
        VOC #|
No comorb.. #|
          M #|
     75-<85  |   .0145973   .0052881     2.76   0.006     .0042329    .0249617
        VOC #|
No comorb.. #|
          M #|
        85+  |   .0184604    .006914     2.67   0.008     .0049093    .0320116
        VOC #|
1 comorbi.. #|
          F #|
      0-<65  |   .0110598   .0037738     2.93   0.003     .0036634    .0184563
        VOC #|
1 comorbi.. #|
          F #|
     65-<75  |   .0100184   .0035156     2.85   0.004      .003128    .0169089
        VOC #|
1 comorbi.. #|
          F #|
     75-<85  |   .0113576   .0040441     2.81   0.005     .0034313    .0192839
        VOC #|
1 comorbi.. #|
          F #|
        85+  |   .0143759   .0053066     2.71   0.007     .0039751    .0247767
        VOC #|
1 comorbi.. #|
          M #|
      0-<65  |   .0118652   .0040451     2.93   0.003     .0039368    .0197935
        VOC #|
1 comorbi.. #|
          M #|
     65-<75  |   .0107488    .003769     2.85   0.004     .0033616    .0181359
        VOC #|
1 comorbi.. #|
          M #|
     75-<85  |   .0121844   .0043341     2.81   0.005     .0036897     .020679
        VOC #|
1 comorbi.. #|
          M #|
        85+  |   .0154189   .0056842     2.71   0.007      .004278    .0265598
        VOC #|
2+ comorb.. #|
          F #|
      0-<65  |   .0108709   .0036755     2.96   0.003      .003667    .0180747
        VOC #|
2+ comorb.. #|
          F #|
     65-<75  |   .0098471   .0034247     2.88   0.004     .0031347    .0165595
        VOC #|
2+ comorb.. #|
          F #|
     75-<85  |   .0111636   .0039412     2.83   0.005     .0034389    .0188883
        VOC #|
2+ comorb.. #|
          F #|
        85+  |   .0141311   .0051729     2.73   0.006     .0039924    .0242697
        VOC #|
2+ comorb.. #|
          M #|
      0-<65  |   .0116626   .0039402     2.96   0.003       .00394    .0193852
        VOC #|
2+ comorb.. #|
          M #|
     65-<75  |   .0105651   .0036719     2.88   0.004     .0033682    .0177619
        VOC #|
2+ comorb.. #|
          M #|
     75-<85  |   .0119764   .0042242     2.84   0.005     .0036972    .0202557
        VOC #|
2+ comorb.. #|
          M #|
        85+  |   .0151566   .0055414     2.74   0.006     .0042956    .0260176
             |
        sgtf |
    non-VOC  |   .0130312    .004424     2.95   0.003     .0043603    .0217022
        VOC  |   .0126871   .0043102     2.94   0.003     .0042393     .021135
------------------------------------------------------------------------------

. 
. est restore fully
(results fully are active now)

. margins comorb_cat#male#agegroupA, post over(sgtf) grand

Predictive margins                              Number of obs     =     97,797
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : sgtf

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf#|
  comorb_cat#|
        male#|
   agegroupA |
    non-VOC #|
No comorb.. #|
          F #|
      0-<65  |   .0179056   .0017929     9.99   0.000     .0143916    .0214196
    non-VOC #|
No comorb.. #|
          F #|
     65-<75  |   .0162307   .0020988     7.73   0.000     .0121171    .0203442
    non-VOC #|
No comorb.. #|
          F #|
     75-<85  |   .0183841    .002605     7.06   0.000     .0132783    .0234899
    non-VOC #|
No comorb.. #|
          F #|
        85+  |   .0232238    .004013     5.79   0.000     .0153585    .0310891
    non-VOC #|
No comorb.. #|
          M #|
      0-<65  |   .0191993   .0019125    10.04   0.000     .0154508    .0229478
    non-VOC #|
No comorb.. #|
          M #|
     65-<75  |   .0174055   .0022431     7.76   0.000     .0130092    .0218019
    non-VOC #|
No comorb.. #|
          M #|
     75-<85  |   .0197117   .0027815     7.09   0.000     .0142601    .0251632
    non-VOC #|
No comorb.. #|
          M #|
        85+  |   .0248918   .0042841     5.81   0.000     .0164952    .0332885
    non-VOC #|
1 comorbi.. #|
          F #|
      0-<65  |   .0149549   .0010091    14.82   0.000     .0129771    .0169326
    non-VOC #|
1 comorbi.. #|
          F #|
     65-<75  |   .0135521   .0014317     9.47   0.000     .0107461    .0163581
    non-VOC #|
1 comorbi.. #|
          F #|
     75-<85  |   .0153558    .001865     8.23   0.000     .0117004    .0190112
    non-VOC #|
1 comorbi.. #|
          F #|
        85+  |   .0194143    .003055     6.35   0.000     .0134265     .025402
    non-VOC #|
1 comorbi.. #|
          M #|
      0-<65  |   .0160389   .0010758    14.91   0.000     .0139305    .0181474
    non-VOC #|
1 comorbi.. #|
          M #|
     65-<75  |    .014536   .0015312     9.49   0.000     .0115348    .0175371
    non-VOC #|
1 comorbi.. #|
          M #|
     75-<85  |   .0164684   .0019924     8.27   0.000     .0125634    .0203734
    non-VOC #|
1 comorbi.. #|
          M #|
        85+  |   .0208146   .0032638     6.38   0.000     .0144177    .0272116
    non-VOC #|
2+ comorb.. #|
          F #|
      0-<65  |   .0147004   .0007209    20.39   0.000     .0132875    .0161133
    non-VOC #|
2+ comorb.. #|
          F #|
     65-<75  |   .0133212     .00126    10.57   0.000     .0108517    .0157907
    non-VOC #|
2+ comorb.. #|
          F #|
     75-<85  |   .0150946   .0016922     8.92   0.000     .0117779    .0184113
    non-VOC #|
2+ comorb.. #|
          F #|
        85+  |   .0190854   .0028606     6.67   0.000     .0134787    .0246922
    non-VOC #|
2+ comorb.. #|
          M #|
      0-<65  |   .0157663   .0007672    20.55   0.000     .0142625    .0172701
    non-VOC #|
2+ comorb.. #|
          M #|
     65-<75  |   .0142885    .001348    10.60   0.000     .0116465    .0169306
    non-VOC #|
2+ comorb.. #|
          M #|
     75-<85  |   .0161886   .0018079     8.95   0.000     .0126452     .019732
    non-VOC #|
2+ comorb.. #|
          M #|
        85+  |   .0204626   .0030565     6.69   0.000     .0144719    .0264532
        VOC #|
No comorb.. #|
          F #|
      0-<65  |   .0174289   .0017464     9.98   0.000     .0140059    .0208519
        VOC #|
No comorb.. #|
          F #|
     65-<75  |   .0157978   .0020437     7.73   0.000     .0117922    .0198034
        VOC #|
No comorb.. #|
          F #|
     75-<85  |   .0178949   .0025365     7.06   0.000     .0129235    .0228663
        VOC #|
No comorb.. #|
          F #|
        85+  |   .0226088   .0039093     5.78   0.000     .0149467    .0302709
        VOC #|
No comorb.. #|
          M #|
      0-<65  |   .0186888   .0018639    10.03   0.000     .0150356     .022342
        VOC #|
No comorb.. #|
          M #|
     65-<75  |   .0169419   .0021849     7.75   0.000     .0126596    .0212242
        VOC #|
No comorb.. #|
          M #|
     75-<85  |   .0191878    .002709     7.08   0.000     .0138783    .0244974
        VOC #|
No comorb.. #|
          M #|
        85+  |   .0242338   .0041744     5.81   0.000     .0160522    .0324154
        VOC #|
1 comorbi.. #|
          F #|
      0-<65  |   .0145555   .0009873    14.74   0.000     .0126205    .0164905
        VOC #|
1 comorbi.. #|
          F #|
     65-<75  |   .0131897   .0013963     9.45   0.000      .010453    .0159264
        VOC #|
1 comorbi.. #|
          F #|
     75-<85  |   .0149459   .0018179     8.22   0.000     .0113829     .018509
        VOC #|
1 comorbi.. #|
          F #|
        85+  |   .0188982   .0029778     6.35   0.000     .0130618    .0247346
        VOC #|
1 comorbi.. #|
          M #|
      0-<65  |   .0156111   .0010536    14.82   0.000     .0135462     .017676
        VOC #|
1 comorbi.. #|
          M #|
     65-<75  |   .0141477    .001494     9.47   0.000     .0112194    .0170759
        VOC #|
1 comorbi.. #|
          M #|
     75-<85  |   .0160293   .0019427     8.25   0.000     .0122217    .0198369
        VOC #|
1 comorbi.. #|
          M #|
        85+  |   .0202621   .0031821     6.37   0.000     .0140253    .0264989
        VOC #|
2+ comorb.. #|
          F #|
      0-<65  |   .0143078   .0007043    20.31   0.000     .0129273    .0156882
        VOC #|
2+ comorb.. #|
          F #|
     65-<75  |   .0129649   .0012275    10.56   0.000     .0105591    .0153707
        VOC #|
2+ comorb.. #|
          F #|
     75-<85  |   .0146916    .001648     8.92   0.000     .0114617    .0179215
        VOC #|
2+ comorb.. #|
          F #|
        85+  |   .0185779   .0027868     6.67   0.000     .0131158      .02404
        VOC #|
2+ comorb.. #|
          M #|
      0-<65  |   .0153457    .000751    20.43   0.000     .0138738    .0168175
        VOC #|
2+ comorb.. #|
          M #|
     65-<75  |   .0139067   .0013139    10.58   0.000     .0113315     .016482
        VOC #|
2+ comorb.. #|
          M #|
     75-<85  |   .0157569   .0017613     8.95   0.000     .0123049    .0192089
        VOC #|
2+ comorb.. #|
          M #|
        85+  |   .0199192   .0029784     6.69   0.000     .0140816    .0257568
             |
        sgtf |
    non-VOC  |   .0154841   .0005594    27.68   0.000     .0143877    .0165806
        VOC  |   .0150707   .0005497    27.42   0.000     .0139933    .0161481
------------------------------------------------------------------------------

. 
. 
. 
. ***********************
. /* Subgroup analyses */
. ***********************
. 
. /* Fully adjusted OR - age grouped, cat hh size */
. 
. glm risk_28 i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib
> 1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.717  
Iteration 1:   log likelihood = -7728.6489  
Iteration 2:   log likelihood =  -7710.547  
Iteration 3:   log likelihood = -7710.5164  
Iteration 4:   log likelihood = -7710.5164  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,759
                                                  Scale parameter =          1
Deviance         =  15421.03278                   (1/df) Deviance =   .1577454
Pearson          =  97840.89207                   (1/df) Pearson  =   1.000838

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1584612
Log likelihood   = -7710.516392                   BIC             =   -1107893

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9732538    .050771    -0.52   0.603     .8786625    1.078028
             |
   agegroupA |
      0-<65  |    1.10511   .1013037     1.09   0.276     .9233729    1.322616
     75-<85  |   1.135206   .1559367     0.92   0.356     .8672619    1.485934
        85+  |   1.441284   .2466924     2.14   0.033     1.030521    2.015777
             |
        male |
          M  |   1.073691   .0560132     1.36   0.173      .969333    1.189283
             |
         imd |
          2  |   1.016079   .0750161     0.22   0.829     .8791933    1.174278
          3  |    .811307   .0638691    -2.66   0.008     .6953052    .9466619
          4  |   .9930916   .0735983    -0.09   0.925     .8588285    1.148344
5 most de..  |   1.025247   .0954601     0.27   0.789     .8542277    1.230505
             |
        eth2 |
      Other  |   .9656549   .0586632    -0.58   0.565     .8572583    1.087758
             |
smoke_nomi~2 |
     Former  |   .9890368    .074366    -0.15   0.883     .8535134    1.146079
             |
   obese4cat |
Obese I ..)  |   1.074897   .0784886     0.99   0.323     .9315636    1.240285
Obese II..)  |   1.037143   .0764617     0.49   0.621     .8976051    1.198373
Obese II..)  |    1.03942   .0708202     0.57   0.570     .9094842     1.18792
             |
hh_total_cat |
        3-5  |    .957018   .0499369    -0.84   0.400     .8639819    1.060072
       6-10  |   .4743631   .4765593    -0.74   0.458     .0662169    3.398234
             |
      region |
     London  |   1.011694   .0972822     0.12   0.904     .8379144    1.221515
 North East  |   1.047555   .1154231     0.42   0.673     .8440897    1.300065
 North West  |    .970657   .1088715    -0.27   0.791     .7790991    1.209313
 South East  |   1.072763    .117064     0.64   0.520     .8661987    1.328588
 South West  |   .9778872   .1095109    -0.20   0.842     .7851724    1.217902
West Midl..  |   .9745478   .1093153    -0.23   0.818     .7822105    1.214179
Yorkshire..  |   1.040872   .1148502     0.36   0.717     .8384468    1.292169
             |
rural_urban5 |
Urban min..  |   .8742989   .1035774    -1.13   0.257     .6931366    1.102811
Urban cit..  |   .9879831   .0979605    -0.12   0.903     .8134882    1.199908
Rural tow..  |   .9533273   .0949869    -0.48   0.631     .7842069     1.15892
Rural vil..  |   .9595601   .0869894    -0.46   0.649     .8033523    1.146142
             |
  comorb_cat |
1 comorbi..  |   .8326598   .0914445    -1.67   0.095     .6714085    1.032639
2+ comorb..  |    .818277   .0811009    -2.02   0.043     .6738081     .993721
             |
  start_week |
23Nov-29Nov  |   1.233137   .1199268     2.15   0.031     1.019129    1.492085
30Nov-06Dec  |   1.116121   .1118842     1.10   0.273       .91703    1.358435
07Dec-13Dec  |   1.095157   .1109639     0.90   0.370     .8979059    1.335741
14Dec-20Dec  |   1.191809   .1206557     1.73   0.083     .9773114    1.453383
21Dec-27Dec  |   1.161509   .1198045     1.45   0.147     .9489095     1.42174
28Dec-03Jan  |   1.231781   .1269263     2.02   0.043     1.006522    1.507453
04Jan-11Jan  |   .7428417   .1892335    -1.17   0.243     .4508779    1.223865
             |
    home_bin |
  Care home  |   1.069248   .0758472     0.94   0.345     .9304619    1.228736
       _cons |   .0153426   .0029559   -21.68   0.000     .0105173    .0223816
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_no_int

. 
. * Constant VOC effect over subgroups
. lincom 1.sgtf, eform

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9732538    .050771    -0.52   0.603     .8786625    1.078028
------------------------------------------------------------------------------

. 
. 
. 
. /* Age group */
. glm risk_28 i.sgtf##ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 i
> b1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood =   -12363.6  
Iteration 1:   log likelihood = -7728.0358  
Iteration 2:   log likelihood = -7709.5707  
Iteration 3:   log likelihood =   -7709.54  
Iteration 4:   log likelihood =   -7709.54  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,756
                                                  Scale parameter =          1
Deviance         =  15419.07999                   (1/df) Deviance =   .1577303
Pearson          =  97840.54019                   (1/df) Pearson  =   1.000865

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1585026
Log likelihood   = -7709.539997                   BIC             =   -1107861

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9027617   .1572627    -0.59   0.557     .6416412    1.270147
             |
   agegroupA |
      0-<65  |   1.050355   .1335769     0.39   0.699     .8186269    1.347678
     75-<85  |   1.236972   .2297047     1.15   0.252     .8595918    1.780029
        85+  |   1.407465   .3362425     1.43   0.153     .8812235    2.247963
             |
        sgtf#|
   agegroupA |
  VOC#0-<65  |   1.109204   .2035311     0.56   0.572     .7741439    1.589281
 VOC#75-<85  |   .8289177   .2290059    -0.68   0.497     .4823354    1.424537
    VOC#85+  |   1.050275   .3596867     0.14   0.886      .536776    2.055007
             |
        male |
          M  |   1.073153   .0559873     1.35   0.176     .9688436    1.188692
             |
         imd |
          2  |    1.01625   .0750297     0.22   0.827     .8793392    1.174478
          3  |   .8114097   .0638788    -2.65   0.008     .6953905    .9467855
          4  |   .9932337   .0736104    -0.09   0.927     .8589488    1.148512
5 most de..  |   1.025101   .0954493     0.27   0.790      .854102    1.230337
             |
        eth2 |
      Other  |   .9650748   .0586301    -0.59   0.558     .8567397    1.087109
             |
smoke_nomi~2 |
     Former  |   .9891281   .0743742    -0.15   0.884     .8535899    1.146188
             |
   obese4cat |
Obese I ..)  |   1.075055   .0785012     0.99   0.322     .9316985    1.240469
Obese II..)  |     1.0367   .0764306     0.49   0.625     .8972186    1.197865
Obese II..)  |   1.039539   .0708301     0.57   0.569     .9095851     1.18806
             |
hh_total_cat |
        3-5  |   .9568217   .0499275    -0.85   0.398     .8638032    1.059857
       6-10  |   .4744797   .4766826    -0.74   0.458     .0662314    3.399156
             |
      region |
     London  |   1.011669   .0972811     0.12   0.904     .8378913    1.221488
 North East  |   1.047751   .1154463     0.42   0.672     .8442456    1.300313
 North West  |   .9712425   .1089392    -0.26   0.795     .7795659    1.210048
 South East  |    1.07267   .1170556     0.64   0.520     .8661207    1.328476
 South West  |   .9778244    .109506    -0.20   0.841     .7851186    1.217829
West Midl..  |   .9743899   .1092996    -0.23   0.817     .7820806    1.213987
Yorkshire..  |   1.041051   .1148714     0.36   0.715     .8385886    1.292394
             |
rural_urban5 |
Urban min..  |   .8747183   .1036299    -1.13   0.259     .6934647    1.103347
Urban cit..  |    .988563    .098021    -0.12   0.908     .8139607    1.200619
Rural tow..  |   .9534356   .0949999    -0.48   0.632     .7842924    1.159057
Rural vil..  |   .9600706   .0870382    -0.45   0.653     .8037757    1.146757
             |
  comorb_cat |
1 comorbi..  |   .8329199   .0914747    -1.66   0.096     .6716156    1.032965
2+ comorb..  |   .8185942   .0811341    -2.02   0.043     .6740665    .9941104
             |
  start_week |
23Nov-29Nov  |   1.232335   .1198532     2.15   0.032     1.018459    1.491126
30Nov-06Dec  |   1.116042    .111878     1.10   0.273      .916962    1.358343
07Dec-13Dec  |   1.094147   .1108684     0.89   0.375     .8970664    1.334525
14Dec-20Dec  |   1.191506   .1206268     1.73   0.083     .9770605    1.453018
21Dec-27Dec  |   1.161444   .1197995     1.45   0.147     .9488542    1.421665
28Dec-03Jan  |   1.231999   .1269516     2.02   0.043     1.006696    1.507727
04Jan-11Jan  |   .7436673   .1894473    -1.16   0.245     .4513749    1.225237
             |
    home_bin |
  Care home  |   1.068799   .0758173     0.94   0.348     .9300672    1.228224
       _cons |   .0159143   .0033159   -19.87   0.000     .0105787    .0239412
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_ageX

. 
. lrtest e_no_int e_ageX

Likelihood-ratio test                                 LR chi2(3)  =      1.95
(Assumption: e_no_int nested in e_ageX)               Prob > chi2 =    0.5823

. 
. * Age group VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                            // 0-<65

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9027617   .1572627    -0.59   0.557     .6416412    1.270147
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.agegroupA, eform       // 65-<75

 ( 1)  [risk_28]1.sgtf + [risk_28]1o.sgtf#2b.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9027617   .1572627    -0.59   0.557     .6416412    1.270147
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.agegroupA, eform       // 75-<85

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7483152   .1604762    -1.35   0.176     .4915235    1.139265
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.agegroupA, eform       // 85+

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9481484   .2795594    -0.18   0.857     .5319875    1.689862
------------------------------------------------------------------------------

. 
. 
. 
. /* Ethnicity */
. glm risk_28 i.sgtf##ib1.eth2 ib0.comorb_cat ib2.agegroupA i.male ib1.imd ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib1.start_
> week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.698  
Iteration 1:   log likelihood = -7728.5456  
Iteration 2:   log likelihood = -7710.3738  
Iteration 3:   log likelihood = -7710.3434  
Iteration 4:   log likelihood = -7710.3434  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,758
                                                  Scale parameter =          1
Deviance         =  15420.68674                   (1/df) Deviance =   .1577435
Pearson          =  97838.44495                   (1/df) Pearson  =   1.000823

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1584781
Log likelihood   = -7710.343372                   BIC             =   -1107882

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9903575   .0594059    -0.16   0.872      .880508    1.113912
             |
        eth2 |
      Other  |   1.000354   .0850527     0.00   0.997     .8468025    1.181748
             |
   sgtf#eth2 |
  VOC#Other  |   .9310144   .1131461    -0.59   0.556     .7336855    1.181416
             |
  comorb_cat |
1 comorbi..  |      .8328   .0914604    -1.67   0.096     .6715207    1.032814
2+ comorb..  |   .8182534   .0810988    -2.02   0.043     .6737883    .9936929
             |
   agegroupA |
      0-<65  |   1.105268   .1013187     1.09   0.275     .9235042    1.322806
     75-<85  |   1.134875   .1558922     0.92   0.357      .867007    1.485502
        85+  |   1.441517   .2467328     2.14   0.033     1.030686    2.016104
             |
        male |
          M  |    1.07369   .0560132     1.36   0.173     .9693323    1.189283
             |
         imd |
          2  |   1.015946   .0750067     0.21   0.830     .8790775    1.174125
          3  |   .8110867   .0638528    -2.66   0.008     .6951146    .9464075
          4  |   .9929937   .0735912    -0.09   0.924     .8587438    1.148231
5 most de..  |    1.02522   .0954575     0.27   0.789      .854205    1.230472
             |
smoke_nomi~2 |
     Former  |   .9891744   .0743769    -0.14   0.885     .8536312     1.14624
             |
   obese4cat |
Obese I ..)  |   1.074876   .0784872     0.99   0.323     .9315444     1.24026
Obese II..)  |   1.037103   .0764588     0.49   0.621     .8975698    1.198327
Obese II..)  |   1.039461   .0708232     0.57   0.570     .9095199    1.187968
             |
hh_total_cat |
        3-5  |   .9570751     .04994    -0.84   0.400     .8640332    1.060136
       6-10  |   .4740404   .4762367    -0.74   0.457     .0661714    3.395945
             |
      region |
     London  |   1.011606   .0972739     0.12   0.904     .8378409    1.221409
 North East  |   1.047799    .115451     0.42   0.672     .8442851    1.300371
 North West  |   .9704117   .1088449    -0.27   0.789     .7789008     1.20901
 South East  |   1.073043   .1170958     0.65   0.518     .8664224    1.328937
 South West  |   .9777847   .1094998    -0.20   0.841     .7850895    1.217776
West Midl..  |   .9743327    .109292    -0.23   0.817     .7820365    1.213913
Yorkshire..  |    1.04099   .1148638     0.36   0.716      .838541    1.292317
             |
rural_urban5 |
Urban min..  |   .8742814   .1035757    -1.13   0.257     .6931221     1.10279
Urban cit..  |   .9879655   .0979589    -0.12   0.903     .8134734    1.199887
Rural tow..  |   .9534143   .0949957    -0.48   0.632     .7842782    1.159026
Rural vil..  |   .9598449   .0870168    -0.45   0.651     .8035882    1.146486
             |
  start_week |
23Nov-29Nov  |   1.233053    .119919     2.15   0.031     1.019059    1.491984
30Nov-06Dec  |   1.116229   .1118954     1.10   0.273     .9171182    1.358568
07Dec-13Dec  |   1.095159   .1109642     0.90   0.370     .8979068    1.335743
14Dec-20Dec  |   1.191938   .1206693     1.73   0.083     .9774166    1.453542
21Dec-27Dec  |    1.16172   .1198267     1.45   0.146     .9490809    1.421999
28Dec-03Jan  |   1.231924   .1269416     2.02   0.043     1.006637    1.507629
04Jan-11Jan  |   .7431025   .1893007    -1.17   0.244     .4510352    1.224298
             |
    home_bin |
  Care home  |   1.069324   .0758527     0.94   0.345     .9305277    1.228824
       _cons |   .0152065   .0029391   -21.66   0.000     .0104114      .02221
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_ethX

. 
. * Test for interaction
. lrtest e_no_int e_ethX

Likelihood-ratio test                                 LR chi2(1)  =      0.35
(Assumption: e_no_int nested in e_ethX)               Prob > chi2 =    0.5564

. 
. * Ethnicity VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                    // White

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9903575   .0594059    -0.16   0.872      .880508    1.113912
------------------------------------------------------------------------------

. *lincom 1.sgtf + 1.sgtf#2.eth5, eform   // S Asian
. *lincom 1.sgtf + 1.sgtf#3.eth5, eform   // Black
. *lincom 1.sgtf + 1.sgtf#4.eth5, eform   // Mixed
. lincom 1.sgtf + 1.sgtf#5.eth2, eform    // Other

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.eth2 = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9220371   .0974545    -0.77   0.443      .749516    1.134269
------------------------------------------------------------------------------

. *lincom 1.sgtf + 1.sgtf#6.eth2, eform   // Missing
. 
. 
. 
. /* Comorbidities */
. glm risk_28 i.sgtf##ib0.comorb_cat ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib1.start_
> week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.589  
Iteration 1:   log likelihood = -7727.9876  
Iteration 2:   log likelihood = -7709.5381  
Iteration 3:   log likelihood = -7709.5063  
Iteration 4:   log likelihood = -7709.5063  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,757
                                                  Scale parameter =          1
Deviance         =  15419.01253                   (1/df) Deviance =    .157728
Pearson          =  97833.20278                   (1/df) Pearson  =    1.00078

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1584815
Log likelihood   = -7709.506265                   BIC             =   -1107872

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .8348704   .1576882    -0.96   0.339     .5765624    1.208904
             |
  comorb_cat |
1 comorbi..  |   .7257356   .1104203    -2.11   0.035     .5386027    .9778863
2+ comorb..  |   .7681968   .1040689    -1.95   0.052     .5890591    1.001812
             |
        sgtf#|
  comorb_cat |
        VOC #|
1 comorbi..  |   1.322334   .2911561     1.27   0.204     .8588566    2.035924
        VOC #|
2+ comorb..  |   1.141291   .2268415     0.66   0.506     .7730592    1.684923
             |
   agegroupA |
      0-<65  |   1.105191   .1013128     1.09   0.275     .9234382    1.322717
     75-<85  |   1.135144   .1559302     0.92   0.356     .8672108    1.485857
        85+  |   1.441105   .2466646     2.13   0.033     1.030388    2.015535
             |
        male |
          M  |   1.073835   .0560216     1.37   0.172      .969462    1.189446
             |
         imd |
          2  |   1.016254   .0750304     0.22   0.827     .8793423    1.174484
          3  |   .8108153   .0638325    -2.66   0.008     .6948803    .9460931
          4  |   .9930964   .0736021    -0.09   0.926     .8588269    1.148358
5 most de..  |   1.025742   .0955083     0.27   0.785     .8546364    1.231104
             |
        eth2 |
      Other  |   .9652951   .0586428    -0.58   0.561     .8569364    1.087356
             |
smoke_nomi~2 |
     Former  |    .989183   .0743779    -0.14   0.885     .8536379    1.146251
             |
   obese4cat |
Obese I ..)  |   1.074704   .0784763     0.99   0.324     .9313932    1.240066
Obese II..)  |   1.036433   .0764127     0.49   0.627     .8969845     1.19756
Obese II..)  |   1.039348   .0708165     0.57   0.571     .9094183     1.18784
             |
hh_total_cat |
        3-5  |   .9575375   .0499662    -0.83   0.406     .8644472    1.060653
       6-10  |   .4738994   .4761018    -0.74   0.457     .0661499    3.395029
             |
      region |
     London  |   1.012176   .0973308     0.13   0.900     .8383098    1.222102
 North East  |   1.047575   .1154277     0.42   0.673     .8441023    1.300096
 North West  |   .9712341   .1089386    -0.26   0.795     .7795587    1.210038
 South East  |   1.073445   .1171411     0.65   0.516     .8667451    1.329439
 South West  |   .9780429   .1095301    -0.20   0.843     .7852947      1.2181
West Midl..  |   .9745706   .1093199    -0.23   0.818     .7822256    1.214212
Yorkshire..  |   1.040976   .1148636     0.36   0.716     .8385278    1.292303
             |
rural_urban5 |
Urban min..  |   .8734455    .103479    -1.14   0.253     .6924559    1.101741
Urban cit..  |   .9879776   .0979625    -0.12   0.903     .8134794    1.199907
Rural tow..  |   .9532225   .0949782    -0.48   0.631     .7841179    1.158796
Rural vil..  |   .9592192   .0869601    -0.46   0.646     .8030643    1.145738
             |
  start_week |
23Nov-29Nov  |   1.233968    .120011     2.16   0.031      1.01981    1.493099
30Nov-06Dec  |   1.116505   .1119252     1.10   0.272     .9173415    1.358909
07Dec-13Dec  |   1.095893   .1110418     0.90   0.366     .8985032    1.336646
14Dec-20Dec  |   1.192441   .1207237     1.74   0.082      .977824    1.454164
21Dec-27Dec  |   1.161541   .1198096     1.45   0.147     .9489332    1.421784
28Dec-03Jan  |    1.23339    .127099     2.04   0.042     1.007826    1.509439
04Jan-11Jan  |   .7438984   .1895068    -1.16   0.246     .4515143     1.22562
             |
    home_bin |
  Care home  |   1.069634   .0758765     0.95   0.343     .9307944    1.229184
       _cons |   .0165025   .0034614   -19.57   0.000     .0109399    .0248936
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_comorbX

. 
. * Test for interaction
. lrtest e_no_int e_comorbX

Likelihood-ratio test                                 LR chi2(2)  =      2.02
(Assumption: e_no_int nested in e_comorbX)            Prob > chi2 =    0.3642

. 
. * Comorbidities VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                            // no comorbs

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8348704   .1576882    -0.96   0.339     .5765624    1.208904
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.comorb_cat, eform      // 1 comorb

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#1.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.103977   .1249485     0.87   0.382     .8843434     1.37816
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.comorb_cat, eform      // 2+ comorbs

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9528302   .0589754    -0.78   0.435     .8439766    1.075723
------------------------------------------------------------------------------

. 
. 
. 
. /* IMD */
. glm risk_28 i.sgtf##ib1.imd ib2.agegroupA i.male ib1.eth2 ib1.smoke_nomiss2 i
> b1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.485  
Iteration 1:   log likelihood = -7727.4274  
Iteration 2:   log likelihood = -7708.5374  
Iteration 3:   log likelihood = -7708.5036  
Iteration 4:   log likelihood = -7708.5036  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,755
                                                  Scale parameter =          1
Deviance         =  15417.00721                   (1/df) Deviance =   .1577107
Pearson          =  97804.62927                   (1/df) Pearson  =   1.000508

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1585019
Log likelihood   = -7708.503606                   BIC             =   -1107851

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.055862   .0989018     0.58   0.562      .878771    1.268641
             |
         imd |
          2  |    1.00404   .1066825     0.04   0.970     .8152824      1.2365
          3  |   .8985824   .0983407    -0.98   0.329     .7251078    1.113559
          4  |    1.04966   .1102672     0.46   0.645     .8543379    1.289638
5 most de..  |   1.166728   .1486352     1.21   0.226     .9089306    1.497643
             |
    sgtf#imd |
      VOC#2  |   1.023641   .1512393     0.16   0.874     .7662771    1.367445
      VOC#3  |   .8113765   .1280023    -1.32   0.185     .5955763     1.10537
      VOC#4  |   .8956988   .1327834    -0.74   0.457     .6698462    1.197702
        VOC #|
5 most de..  |   .7639631   .1429103    -1.44   0.150     .5294718    1.102305
             |
   agegroupA |
      0-<65  |   1.104054   .1012104     1.08   0.280     .9224849    1.321361
     75-<85  |   1.133611   .1557233     0.91   0.361     .8660342     1.48386
        85+  |   1.437548   .2460647     2.12   0.034     1.027833    2.010585
             |
        male |
          M  |   1.073932   .0560272     1.37   0.172     .9695484    1.189554
             |
        eth2 |
      Other  |   .9653552   .0586475    -0.58   0.562      .856988    1.087426
             |
smoke_nomi~2 |
     Former  |   .9897643   .0744236    -0.14   0.891     .8541364    1.146929
             |
   obese4cat |
Obese I ..)  |   1.074509   .0784623     0.98   0.325      .931224    1.239842
Obese II..)  |   1.036687   .0764313     0.49   0.625     .8972051    1.197854
Obese II..)  |   1.038736   .0707766     0.56   0.577     .9088799    1.187144
             |
hh_total_cat |
        3-5  |   .9570969   .0499433    -0.84   0.401     .8640492    1.060165
       6-10  |   .4709223   .4731197    -0.75   0.454     .0657318    3.373826
             |
      region |
     London  |   1.011076   .0972265     0.11   0.909      .837396    1.220777
 North East  |   1.046917   .1153601     0.42   0.677      .843564    1.299291
 North West  |   .9707182   .1088849    -0.26   0.791     .7791379    1.209406
 South East  |   1.073324   .1171295     0.65   0.517     .8666442    1.329292
 South West  |   .9767246   .1093853    -0.21   0.833     .7842318    1.216466
West Midl..  |   .9740777   .1092654    -0.23   0.815     .7818287      1.2136
Yorkshire..  |    1.04068   .1148332     0.36   0.718     .8382852     1.29194
             |
rural_urban5 |
Urban min..  |   .8748992   .1036526    -1.13   0.259     .6936063    1.103578
Urban cit..  |   .9877434    .097941    -0.12   0.901     .8132838    1.199627
Rural tow..  |   .9529891   .0949559    -0.48   0.629     .7839244    1.158515
Rural vil..  |   .9594831   .0869848    -0.46   0.648     .8032839    1.146055
             |
  comorb_cat |
1 comorbi..  |   .8323654   .0914169    -1.67   0.095     .6711636    1.032285
2+ comorb..  |   .8173627   .0810161    -2.03   0.042     .6730458    .9926246
             |
  start_week |
23Nov-29Nov  |   1.233908   .1200054     2.16   0.031      1.01976    1.493026
30Nov-06Dec  |   1.116065    .111884     1.10   0.273     .9169752     1.35838
07Dec-13Dec  |   1.095435   .1109984     0.90   0.368      .898123    1.336095
14Dec-20Dec  |   1.191414   .1206194     1.73   0.084     .9769822     1.45291
21Dec-27Dec  |   1.160993   .1197548     1.45   0.148     .9484831    1.421117
28Dec-03Jan  |   1.232364     .12699     2.03   0.043     1.006993    1.508176
04Jan-11Jan  |   .7434457   .1893912    -1.16   0.245     .4512398    1.224873
             |
    home_bin |
  Care home  |   1.069075   .0758391     0.94   0.346     .9303037    1.228546
       _cons |   .0147579   .0029045   -21.42   0.000     .0100346    .0217046
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_imdX

. 
. * Test for interaction
. lrtest e_no_int e_imdX

Likelihood-ratio test                                 LR chi2(4)  =      4.03
(Assumption: e_no_int nested in e_imdX)               Prob > chi2 =    0.4026

. 
. * IMD VOC vs. non-VOC OR
. lincom 1.sgtf, eform                            // 1 least deprived

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.055862   .0989018     0.58   0.562      .878771    1.268641
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.imd, eform     // 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.080824   .1234976     0.68   0.496     .8639619     1.35212
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.imd, eform     // 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8567017   .1087467    -1.22   0.223     .6680071    1.098698
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.imd, eform     // 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9457344   .1086805    -0.49   0.627     .7550089     1.18464
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.imd, eform     // 5 most deprived

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8066396   .1306105    -1.33   0.184     .5872914    1.107912
------------------------------------------------------------------------------

. 
. 
. 
. /* Epi week */
. glm risk_28 i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib
> 1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib2.start_weekA i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.989  
Iteration 1:   log likelihood = -7730.0811  
Iteration 2:   log likelihood = -7712.8914  
Iteration 3:   log likelihood = -7712.8584  
Iteration 4:   log likelihood = -7712.8584  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,760
                                                  Scale parameter =          1
Deviance         =   15425.7168                   (1/df) Deviance =   .1577917
Pearson          =  97836.34291                   (1/df) Pearson  =   1.000781

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1584887
Log likelihood   =   -7712.8584                   BIC             =   -1107900

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9728504   .0507486    -0.53   0.598     .8783007    1.077578
             |
   agegroupA |
      0-<65  |   1.105518   .1013381     1.09   0.274      .923719    1.323097
     75-<85  |   1.136808    .156151     0.93   0.351     .8684939    1.488015
        85+  |   1.442021   .2468103     2.14   0.032     1.031059    2.016785
             |
        male |
          M  |   1.073694   .0560121     1.36   0.173     .9693379    1.189284
             |
         imd |
          2  |   1.015276   .0749538     0.21   0.837     .8785029    1.173343
          3  |   .8106091   .0638118    -2.67   0.008     .6947111    .9458423
          4  |   .9926274   .0735616    -0.10   0.920     .8584311    1.147802
5 most de..  |   1.025141   .0954478     0.27   0.790     .8541436    1.230372
             |
        eth2 |
      Other  |   .9654399   .0586489    -0.58   0.563     .8570696    1.087513
             |
smoke_nomi~2 |
     Former  |   .9887423   .0743418    -0.15   0.880     .8532627    1.145733
             |
   obese4cat |
Obese I ..)  |   1.074893   .0784865     0.99   0.323     .9315635    1.240276
Obese II..)  |   1.037036   .0764518     0.49   0.622      .897516    1.198245
Obese II..)  |   1.040697   .0709031     0.59   0.558     .9106083     1.18937
             |
hh_total_cat |
        3-5  |    .957282   .0499493    -0.84   0.403     .8642227    1.060362
       6-10  |   .4766471   .4788523    -0.74   0.461     .0665361    3.414575
             |
      region |
     London  |   1.010603    .097174     0.11   0.913     .8370159     1.22019
 North East  |   1.046828   .1153401     0.42   0.678      .843509    1.299156
 North West  |   .9698065   .1087729    -0.27   0.785     .7784216    1.208246
 South East  |   1.072929   .1170792     0.65   0.519     .8663372    1.328786
 South West  |   .9774287   .1094567    -0.20   0.838     .7848087    1.217324
West Midl..  |   .9738201   .1092304    -0.24   0.813     .7816315    1.213264
Yorkshire..  |   1.039331   .1146752     0.35   0.727     .8372134    1.290244
             |
rural_urban5 |
Urban min..  |   .8747547   .1036288    -1.13   0.259     .6935021    1.103379
Urban cit..  |   .9879647   .0979563    -0.12   0.903     .8134767     1.19988
Rural tow..  |   .9526831     .09492    -0.49   0.627     .7836814     1.15813
Rural vil..  |   .9595687   .0869881    -0.46   0.649     .8033629    1.146147
             |
  comorb_cat |
1 comorbi..  |   .8323216    .091405    -1.67   0.095     .6711395    1.032214
2+ comorb..  |   .8180269    .081074    -2.03   0.043     .6736055    .9934122
             |
 start_weekA |
30Nov-06Dec  |   .9943047   .0826232    -0.07   0.945     .8448656    1.170176
07Dec-13Dec  |   .9756204   .0823344    -0.29   0.770     .8268874    1.151106
14Dec-20Dec  |   1.061741   .0894996     0.71   0.477       .90005     1.25248
21Dec-27Dec  |   1.034738   .0895822     0.39   0.693     .8732487    1.226092
28Dec-03Jan  |   1.097344   .0948688     1.07   0.283     .9263043    1.299965
04Jan-11Jan  |   .6617863   .1644529    -1.66   0.097     .4066263    1.077061
             |
    home_bin |
  Care home  |   1.069324   .0758503     0.94   0.345     .9305317    1.228818
       _cons |   .0172391   .0031752   -22.05   0.000     .0120153    .0247341
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_week

. 
. glm risk_28 i.sgtf##ib2.start_weekA ib2.agegroupA i.male ib1.imd ib1.eth2 ib1
> .smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.539  
Iteration 1:   log likelihood = -7727.6487  
Iteration 2:   log likelihood =  -7708.369  
Iteration 3:   log likelihood = -7708.1525  
Iteration 4:   log likelihood = -7708.1521  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,754
                                                  Scale parameter =          1
Deviance         =  15416.30425                   (1/df) Deviance =   .1577051
Pearson          =   97761.2016                   (1/df) Pearson  =   1.000074

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1585151
Log likelihood   = -7708.152127                   BIC             =   -1107841

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .8785235   .0845506    -1.35   0.178     .7274988      1.0609
             |
 start_weekA |
30Nov-06Dec  |   .9318177   .1090732    -0.60   0.546     .7407886    1.172108
07Dec-13Dec  |   .9269268   .1088463    -0.65   0.518     .7363619    1.166809
14Dec-20Dec  |   .9041307   .1105824    -0.82   0.410      .711414    1.149053
21Dec-27Dec  |   1.018512   .1220322     0.15   0.878      .805342    1.288108
28Dec-03Jan  |   .9820806   .1210692    -0.15   0.883     .7712807    1.250494
04Jan-11Jan  |   .9613602   .2762271    -0.14   0.891     .5474077    1.688346
             |
        sgtf#|
 start_weekA |
        VOC #|
30Nov-06Dec  |   1.141761   .1898561     0.80   0.425     .8242036    1.581671
        VOC #|
07Dec-13Dec  |   1.111178   .1876771     0.62   0.533     .7980243    1.547215
        VOC #|
14Dec-20Dec  |   1.370956   .2319262     1.87   0.062     .9840676    1.909952
        VOC #|
21Dec-27Dec  |   1.033496   .1791221     0.19   0.849     .7358368    1.451564
        VOC #|
28Dec-03Jan  |   1.249829   .2163387     1.29   0.198     .8902499    1.754644
        VOC #|
04Jan-11Jan  |   .3421182   .1990955    -1.84   0.065     .1093503    1.070366
             |
   agegroupA |
      0-<65  |   1.105517   .1013454     1.09   0.274     .9237064    1.323114
     75-<85  |   1.137372   .1562366     0.94   0.349      .868913    1.488775
        85+  |   1.443456   .2470777     2.14   0.032     1.032054    2.018852
             |
        male |
          M  |   1.073411   .0560017     1.36   0.175     .9690749     1.18898
             |
         imd |
          2  |    1.01577   .0749961     0.21   0.832     .8789204    1.173927
          3  |   .8106417    .063819    -2.67   0.008     .6947312     .945891
          4  |   .9927265   .0735733    -0.10   0.922     .8585094    1.147927
5 most de..  |    1.02655   .0955881     0.28   0.778      .855303    1.232085
             |
        eth2 |
      Other  |   .9654017   .0586494    -0.58   0.562     .8570309    1.087476
             |
smoke_nomi~2 |
     Former  |   .9884206    .074322    -0.15   0.877     .8529776     1.14537
             |
   obese4cat |
Obese I ..)  |    1.07581   .0785605     1.00   0.317     .9323463     1.24135
Obese II..)  |   1.037229   .0764688     0.50   0.620     .8976781    1.198475
Obese II..)  |   1.040643   .0709033     0.58   0.559     .9105546    1.189317
             |
hh_total_cat |
        3-5  |   .9577081   .0499753    -0.83   0.408     .8646007    1.060842
       6-10  |   .4798067   .4820387    -0.73   0.465     .0669738    3.437381
             |
      region |
     London  |   1.009688   .0970956     0.10   0.920     .8362423    1.219107
 North East  |   1.045582   .1152111     0.40   0.686     .8424913    1.297629
 North West  |   .9700259   .1088046    -0.27   0.786     .7785865    1.208537
 South East  |   1.071807   .1169694     0.64   0.525     .8654109    1.327427
 South West  |    .976789   .1093946    -0.21   0.834       .78428    1.216551
West Midl..  |   .9740287   .1092633    -0.23   0.815     .7817841    1.213547
Yorkshire..  |   1.038059   .1145451     0.34   0.735     .8361723    1.288689
             |
rural_urban5 |
Urban min..  |   .8736038   .1034997    -1.14   0.254     .6925783    1.101945
Urban cit..  |   .9871505   .0978803    -0.13   0.896     .8127987    1.198902
Rural tow..  |   .9514139   .0947992    -0.50   0.617     .7826282    1.156601
Rural vil..  |   .9587679   .0869198    -0.46   0.642     .8026855    1.145201
             |
  comorb_cat |
1 comorbi..  |   .8323683   .0914205    -1.67   0.095     .6711607    1.032297
2+ comorb..  |   .8175544   .0810362    -2.03   0.042     .6732019      .99286
             |
    home_bin |
  Care home  |   1.069662     .07588     0.95   0.342     .9308164     1.22922
       _cons |    .018138    .003412   -21.32   0.000     .0125448    .0262248
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_weekX

. 
. * Test for interaction
. lrtest e_no_int e_weekX

Likelihood-ratio test                                 LR chi2(5)  =      4.73
(Assumption: e_no_int nested in e_weekX)              Prob > chi2 =    0.4499

. 
. * Epi week VOC vs. non-VOC OR
. lincom 1.sgtf + 1.sgtf#2.start_week, eform      // week 1/2

 ( 1)  [risk_28]1.sgtf + [risk_28]1o.sgtf#2b.start_weekA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8785235   .0845506    -1.35   0.178     .7274988      1.0609
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.start_week, eform      // week 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.start_weekA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.003064   .1360274     0.02   0.982     .7689458    1.308464
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.start_week, eform      // week 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.start_weekA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9761956   .1354882    -0.17   0.862     .7436983    1.281377
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.start_week, eform      // week 5

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.start_weekA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.204417    .167559     1.34   0.181     .9169752    1.581964
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.start_week, eform      // week 6

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.start_weekA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9079508   .1308684    -0.67   0.503     .6845002    1.204345
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.start_week, eform      // week 7

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.start_weekA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.098004   .1579741     0.65   0.516     .8282056    1.455692
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#8.start_week, eform      // week 8

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#8.start_weekA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3005589      .1725    -2.09   0.036     .0975886    .9256789
------------------------------------------------------------------------------

. 
. 
. 
. /* NHS region */
. 
. /*
> glm risk_28 i.sgtf i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week i.region, ///
>                         family(bin) link(log) eform
>                         
> est store e_region
> */
. 
. glm risk_28 i.sgtf##i.region ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_
> nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week i.home_bin ///
>                         if eth2 != 6 ///
>                         , family(bin) link(logit) eform

Iteration 0:   log likelihood = -12363.228  
Iteration 1:   log likelihood = -7726.0724  
Iteration 2:   log likelihood = -7706.3269  
Iteration 3:   log likelihood = -7706.2972  
Iteration 4:   log likelihood = -7706.2972  

Generalized linear models                         Number of obs   =     97,797
Optimization     : ML                             Residual df     =     97,752
                                                  Scale parameter =          1
Deviance         =  15412.59439                   (1/df) Deviance =   .1576704
Pearson          =  97875.63308                   (1/df) Pearson  =   1.001265

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1585181
Log likelihood   = -7706.297194                   BIC             =   -1107821

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .7177706    .114201    -2.08   0.037     .5254787    .9804292
             |
      region |
     London  |   .9006406   .1164299    -0.81   0.418     .6990574    1.160353
 North East  |   .8806432   .1337969    -0.84   0.403     .6538471    1.186107
 North West  |   .8636672   .1312011    -0.96   0.335     .6412672    1.163199
 South East  |   .8876643   .1336187    -0.79   0.429     .6608741    1.192281
 South West  |   .8648901    .132251    -0.95   0.342     .6409188    1.167129
West Midl..  |   .7176763   .1146567    -2.08   0.038     .5247347    .9815613
Yorkshire..  |   .8934265   .1348909    -0.75   0.455     .6645737    1.201087
             |
 sgtf#region |
 VOC#London  |   1.287578   .2494641     1.30   0.192     .8807569     1.88231
        VOC #|
 North East  |   1.444608   .3201734     1.66   0.097     .9356111    2.230513
        VOC #|
 North West  |   1.288581    .290747     1.12   0.261     .8280417    2.005263
        VOC #|
 South East  |   1.490834   .3273065     1.82   0.069     .9695086    2.292488
        VOC #|
 South West  |   1.306058   .2941136     1.19   0.236     .8399991    2.030702
        VOC #|
West Midl..  |   1.852139   .4195351     2.72   0.007     1.188132    2.887237
        VOC #|
Yorkshire..  |   1.387021   .3077657     1.47   0.140     .8978634    2.142673
             |
   agegroupA |
      0-<65  |   1.103783   .1011894     1.08   0.281     .9222522    1.321045
     75-<85  |   1.133788   .1557495     0.91   0.361      .866167    1.484097
        85+  |   1.440162    .246521     2.13   0.033      1.02969    2.014265
             |
        male |
          M  |   1.073979   .0560333     1.37   0.171     .9695847    1.189614
             |
         imd |
          2  |   1.015799   .0750013     0.21   0.832     .8789406    1.173968
          3  |   .8111666   .0638642    -2.66   0.008     .6951745    .9465123
          4  |   .9931887   .0736117    -0.09   0.927     .8589021    1.148471
5 most de..  |   1.025244   .0954698     0.27   0.789     .8542085    1.230524
             |
        eth2 |
      Other  |   .9656224   .0586674    -0.58   0.565     .8572188    1.087735
             |
smoke_nomi~2 |
     Former  |   .9889389   .0743627    -0.15   0.882     .8534221    1.145975
             |
   obese4cat |
Obese I ..)  |   1.075096   .0785108     0.99   0.321     .9317225    1.240531
Obese II..)  |   1.037166   .0764687     0.49   0.621     .8976159    1.198412
Obese II..)  |   1.039704   .0708469     0.57   0.568     .9097193     1.18826
             |
hh_total_cat |
        3-5  |    .957155   .0499498    -0.84   0.401     .8640955    1.060237
       6-10  |   .4777951   .4800277    -0.74   0.462     .0666903    3.423108
             |
rural_urban5 |
Urban min..  |   .8727349   .1034013    -1.15   0.251     .6918824    1.100861
Urban cit..  |   .9871047   .0978878    -0.13   0.896     .8127415    1.198875
Rural tow..  |   .9513735   .0948046    -0.50   0.617     .7825799    1.156574
Rural vil..  |   .9578079     .08684    -0.48   0.634     .8018699    1.144071
             |
  comorb_cat |
1 comorbi..  |   .8319775   .0913783    -1.67   0.094     .6708445    1.031814
2+ comorb..  |   .8171613   .0809984    -2.04   0.042     .6728763    .9923853
             |
  start_week |
23Nov-29Nov  |   1.232605   .1198837     2.15   0.032     1.018675    1.491462
30Nov-06Dec  |   1.116295   .1119083     1.10   0.272     .9171629    1.358663
07Dec-13Dec  |   1.095569   .1110151     0.90   0.368     .8982281    1.336266
14Dec-20Dec  |   1.190452   .1205292     1.72   0.085     .9761818    1.451755
21Dec-27Dec  |   1.159793   .1196366     1.44   0.151     .9474934    1.419662
28Dec-03Jan  |   1.230302   .1267835     2.01   0.044     1.005298    1.505666
04Jan-11Jan  |   .7411645   .1888156    -1.18   0.240     .4498487    1.221132
             |
    home_bin |
  Care home  |   1.067825   .0757539     0.93   0.355       .92921    1.227118
       _cons |   .0177492   .0035996   -19.88   0.000     .0119276    .0264123
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.                         
. est store e_regionX

. 
. * Test for interaction
. lrtest e_no_int e_regionX

Likelihood-ratio test                                 LR chi2(7)  =      8.44
(Assumption: e_no_int nested in e_regionX)            Prob > chi2 =    0.2955

. 
. * NHS region VOC vs. non-VOC OR
. lincom 1.sgtf, eform                                    // East

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7177706    .114201    -2.08   0.037     .5254787    .9804292
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.region, eform  // East mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1o.sgtf#1b.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7177706    .114201    -2.08   0.037     .5254787    .9804292
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.region, eform  // London

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9241858   .1021823    -0.71   0.476     .7441259    1.147816
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.region, eform  // North E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.036897   .1599854     0.23   0.814     .7663052    1.403039
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.region, eform  // North W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9249057   .1479756    -0.49   0.626     .6759488    1.265555
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.region, eform  // South E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.070077   .1618764     0.45   0.654     .7955165    1.439398
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.region, eform  // South W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9374501   .1493952    -0.41   0.685     .6859584    1.281146
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.region, eform  // West mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.329411   .2143416     1.77   0.077     .9692135    1.823471
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#8.region, eform  // Yorks & Hum

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#8.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9955631   .1539834    -0.03   0.977      .735214    1.348105
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3 i.home
> _bin, ///
>                         family(bin) link(logit) eform

Iteration 0:   log likelihood = -18706.464  
Iteration 1:   log likelihood = -11611.088  
Iteration 2:   log likelihood = -11588.597  
Iteration 3:   log likelihood = -11588.552  
Iteration 4:   log likelihood = -11588.552  

Generalized linear models                         Number of obs   =    148,780
Optimization     : ML                             Residual df     =    148,767
                                                  Scale parameter =          1
Deviance         =  23177.10311                   (1/df) Deviance =   .1557947
Pearson          =  148768.4389                   (1/df) Pearson  =    1.00001

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1559558
Log likelihood   = -11588.55155                   BIC             =   -1748671

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9770618   .0416634    -0.54   0.586     .8987224     1.06223
             |
  comorb_cat |
1 comorbi..  |   .9374017   .0867214    -0.70   0.485       .78195    1.123757
2+ comorb..  |   .8956407   .0755536    -1.31   0.191     .7591524    1.056668
             |
         imd |
          2  |   1.020742   .0618979     0.34   0.735     .9063562    1.149563
          3  |   .8308736    .053381    -2.88   0.004      .732568    .9423713
          4  |   1.019212   .0616857     0.31   0.753     .9052059    1.147577
5 most de..  |   1.033997   .0785482     0.44   0.660     .8909585         1.2
             |
smoke_nomi~2 |
     Former  |    .965797   .0600414    -0.56   0.576     .8550048    1.090946
        age1 |      .9995   .0044298    -0.11   0.910     .9908554     1.00822
        age2 |   1.002462    .014447     0.17   0.864      .974543    1.031182
        age3 |   .9934304   .0404564    -0.16   0.871     .9172193    1.075974
             |
    home_bin |
  Care home  |   1.052552   .0614683     0.88   0.380     .9387157    1.180193
       _cons |    .016698   .0040947   -16.69   0.000      .010326    .0270019
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. * Age grouped
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 ib2.agegroupA i.home_
> bin, ///
>                         family(bin) link(logit) eform

Iteration 0:   log likelihood = -18706.281  
Iteration 1:   log likelihood = -11610.128  
Iteration 2:   log likelihood = -11587.035  
Iteration 3:   log likelihood = -11586.992  
Iteration 4:   log likelihood = -11586.992  

Generalized linear models                         Number of obs   =    148,780
Optimization     : ML                             Residual df     =    148,767
                                                  Scale parameter =          1
Deviance         =  23173.98474                   (1/df) Deviance =   .1557737
Pearson          =  148768.5847                   (1/df) Pearson  =   1.000011

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1559348
Log likelihood   = -11586.99237                   BIC             =   -1748674

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9771054   .0416658    -0.54   0.587     .8987615    1.062279
             |
  comorb_cat |
1 comorbi..  |   .9383791   .0868137    -0.69   0.492     .7827621    1.124933
2+ comorb..  |   .8963582   .0756149    -1.30   0.195     .7597593    1.057516
             |
         imd |
          2  |   1.020592   .0618897     0.34   0.737     .9062218    1.149397
          3  |   .8310453   .0533928    -2.88   0.004      .732718    .9425676
          4  |   1.019497   .0617044     0.32   0.750     .9054568    1.147901
5 most de..  |   1.034192   .0785645     0.44   0.658     .8911234     1.20023
             |
smoke_nomi~2 |
     Former  |   .9659483   .0600517    -0.56   0.577     .8551373    1.091118
             |
   agegroupA |
      0-<65  |   1.097258   .0817422     1.25   0.213     .9481939    1.269757
     75-<85  |   1.133377   .1268217     1.12   0.263     .9101801    1.411307
        85+  |   1.275349    .185491     1.67   0.094       .95902    1.696019
             |
    home_bin |
  Care home  |   1.052285   .0614537     0.87   0.383     .9384758    1.179896
       _cons |   .0157667   .0017798   -36.76   0.000     .0126373    .0196711
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. * With region
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 ib2.agegroupA i.home_
> bin i.region, ///
>                         family(bin) link(logit) eform

Iteration 0:   log likelihood =  -16892.06  
Iteration 1:   log likelihood = -10559.636  
Iteration 2:   log likelihood = -10540.026  
Iteration 3:   log likelihood = -10539.993  
Iteration 4:   log likelihood = -10539.993  

Generalized linear models                         Number of obs   =    133,667
Optimization     : ML                             Residual df     =    133,647
                                                  Scale parameter =          1
Deviance         =  21079.98617                   (1/df) Deviance =   .1577288
Pearson          =  133647.9331                   (1/df) Pearson  =   1.000007

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u/(1-u))             [Logit]

                                                  AIC             =   .1580045
Log likelihood   = -10539.99308                   BIC             =   -1556370

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9682513   .0432265    -0.72   0.470     .8871297    1.056791
             |
  comorb_cat |
1 comorbi..  |   .9132868   .0879043    -0.94   0.346     .7562731    1.102899
2+ comorb..  |   .8783308   .0769278    -1.48   0.139     .7397865    1.042821
             |
         imd |
          2  |   1.009763   .0641214     0.15   0.878     .8915932    1.143594
          3  |   .8339759   .0558782    -2.71   0.007      .731343    .9510117
          4  |    1.00282   .0636785     0.04   0.965     .8854671    1.135727
5 most de..  |   1.031068   .0820004     0.38   0.700     .8822494    1.204988
             |
smoke_nomi~2 |
     Former  |   .9957821    .064097    -0.07   0.948     .8777559    1.129679
             |
   agegroupA |
      0-<65  |   1.154518   .0918613     1.81   0.071     .9878094     1.34936
     75-<85  |   1.144885   .1367302     1.13   0.257     .9059523    1.446833
        85+  |   1.379093   .2091368     2.12   0.034     1.024497    1.856422
             |
    home_bin |
  Care home  |   1.075184   .0652642     1.19   0.232     .9545849     1.21102
             |
      region |
     London  |   1.057956   .0889918     0.67   0.503     .8971546    1.247578
 North East  |    1.07034   .1032406     0.70   0.481     .8859689     1.29308
 North West  |   1.021532   .0997206     0.22   0.827     .8436433     1.23693
 South East  |    1.18106   .1111814     1.77   0.077     .9820697     1.42037
 South West  |   1.101577   .1054878     1.01   0.312     .9130685    1.329005
West Midl..  |   1.071571   .1034658     0.72   0.474      .886815    1.294819
Yorkshire..  |   1.091816   .1048734     0.91   0.360     .9044573    1.317986
             |
       _cons |   .0146087   .0019821   -31.15   0.000     .0111976     .019059
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_logit_models.log
  log type:  text
 closed on:  16 Mar 2021, 22:23:33
-------------------------------------------------------------------------------
