-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_risk_models.log
  log type:  text
 opened on:  13 Feb 2021, 17:31:23

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 13 Feb 2021)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,035 observations deleted)

. 
. noi di "SUBSETTING ON 28-DAY RISK POPULATION"
SUBSETTING ON 28-DAY RISK POPULATION

. keep if risk_pop==1
(7,498 observations deleted)

. 
. tab sgtf risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

        SGTF |    28-day outcome
  (exposure) |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    69,407      1,073 |    70,480 
             |     98.48       1.52 |    100.00 
-------------+----------------------+----------
         VOC |    69,773      1,058 |    70,831 
             |     98.51       1.49 |    100.00 
-------------+----------------------+----------
       Total |   139,180      2,131 |   141,311 
             |     98.49       1.51 |    100.00 

. 
. 
. *******************
. /* Unadjusted RR */
. *******************
. 
. glm risk_28 i.sgtf, family(bin) link(log) eform

Iteration 0:   log likelihood = -22799.209  
Iteration 1:   log likelihood = -11074.196  
Iteration 2:   log likelihood = -11053.094  
Iteration 3:   log likelihood = -11052.959  
Iteration 4:   log likelihood = -11052.959  

Generalized linear models                         Number of obs   =    141,311
Optimization     : ML                             Residual df     =    141,309
                                                  Scale parameter =          1
Deviance         =  22105.91762                   (1/df) Deviance =   .1564367
Pearson          =  141310.9997                   (1/df) Pearson  =   1.000014

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1564628
Log likelihood   = -11052.95881                   BIC             =   -1653638

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9811343   .0421869    -0.44   0.658     .9018377    1.067403
       _cons |   .0152242   .0004612  -138.14   0.000     .0143465    .0161555
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. * Absolute risk
. margins sgtf

Adjusted predictions                            Number of obs     =    141,311
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0152242   .0004612    33.01   0.000     .0143202    .0161281
        VOC  |    .014937   .0004558    32.77   0.000     .0140437    .0158303
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted RR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 household_size ///
>                         i.region ib1.rural_urban5 ib1.start_week age1 age2 ag
> e3, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -20611.359  
Iteration 1:   log likelihood = -10075.913  
Iteration 2:   log likelihood = -10051.982  
Iteration 3:   log likelihood = -10051.713  
Iteration 4:   log likelihood = -10051.713  

Generalized linear models                         Number of obs   =    126,948
Optimization     : ML                             Residual df     =    126,918
                                                  Scale parameter =          1
Deviance         =  20103.42624                   (1/df) Deviance =    .158397
Pearson          =  126920.0093                   (1/df) Pearson  =   1.000016

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1588322
Log likelihood   = -10051.71312                   BIC             =   -1471378

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9766786   .0439318    -0.52   0.600     .8942602    1.066693
             |
        male |
          M  |   1.014062   .0456127     0.31   0.756     .9284899     1.10752
             |
         imd |
          2  |   1.005716   .0640328     0.09   0.929     .8877287    1.139385
          3  |   .8097728   .0549595    -3.11   0.002     .7089114    .9249845
          4  |   .9920435   .0633076    -0.13   0.900      .875409    1.124218
5 most de..  |   1.003622   .0807384     0.04   0.964     .8572229    1.175025
             |
        eth2 |
      Other  |   .9584847   .0579251    -0.70   0.483     .8514196    1.079013
    Missing  |   .9621739   .0521845    -0.71   0.477     .8651428    1.070088
             |
household_~e |   .9971081    .021584    -0.13   0.894     .9556891    1.040322
             |
      region |
     London  |   1.057745   .0900768     0.66   0.510     .8951452    1.249881
 North East  |   1.085245   .1055892     0.84   0.400      .896829    1.313244
 North West  |   1.019094   .1007986     0.19   0.848     .8395026    1.237106
 South East  |   1.202361   .1140052     1.94   0.052     .9984491    1.447918
 South West  |   1.107035    .107117     1.05   0.293     .9157957    1.338208
West Midl..  |   1.084026   .1055861     0.83   0.407     .8956355    1.312044
Yorkshire..  |    1.11989    .108242     1.17   0.241     .9266229    1.353466
             |
rural_urban5 |
Urban min..  |   .9290382   .0961016    -0.71   0.477     .7585488    1.137846
Urban cit..  |   1.071103   .0928707     0.79   0.428     .9037062    1.269508
Rural tow..  |   1.021704   .0893117     0.25   0.806     .8608311    1.212642
Rural vil..  |   1.008694   .0807085     0.11   0.914     .8622876    1.179958
             |
  start_week |
23Nov-29Nov  |   1.158809   .0941796     1.81   0.070     .9881715    1.358912
30Nov-06Dec  |    1.12752   .0929495     1.46   0.145     .9592983    1.325241
07Dec-13Dec  |   1.024702   .0870457     0.29   0.774     .8675418    1.210333
14Dec-20Dec  |   1.091133   .0927426     1.03   0.305     .9236944    1.288923
21Dec-27Dec  |   1.111136    .095369     1.23   0.220     .9390926    1.314698
28Dec-04Jan  |   1.126103   .1065674     1.25   0.209     .9354611    1.355597
             |
        age1 |   .9972433   .0046279    -0.59   0.552     .9882139    1.006355
        age2 |   1.008162   .0152974     0.54   0.592     .9786214    1.038595
        age3 |   .9783646   .0420467    -0.51   0.611     .8993299    1.064345
       _cons |   .0119637    .003285   -16.12   0.000     .0069847    .0204921
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =    126,948
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0155183   .0004911    31.60   0.000     .0145558    .0164808
        VOC  |   .0151564   .0004844    31.29   0.000     .0142069    .0161058
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =    126,948
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth2             (asbalanced)
               region           (asbalanced)
               rural_urban5     (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0151946   .0005703    26.64   0.000     .0140768    .0163124
        VOC  |   .0148402   .0005612    26.44   0.000     .0137403    .0159402
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted RR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 ib1.hh_total_cat ///
>                         i.region ib1.rural_urban5 ib1.start_week ib2.agegroup
> A, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -20131.046  
Iteration 1:   log likelihood =  -9837.474  
Iteration 2:   log likelihood = -9813.8353  
Iteration 3:   log likelihood = -9813.5558  
Iteration 4:   log likelihood = -9813.5558  

Generalized linear models                         Number of obs   =    124,022
Optimization     : ML                             Residual df     =    123,991
                                                  Scale parameter =          1
Deviance         =  19627.11162                   (1/df) Deviance =   .1582946
Pearson          =  124020.5532                   (1/df) Pearson  =   1.000238

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =    .158755
Log likelihood   = -9813.555812                   BIC             =   -1434566

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9786077   .0445478    -0.48   0.635     .8950774    1.069933
             |
        male |
          M  |   1.012417   .0460862     0.27   0.786     .9260018    1.106896
             |
         imd |
          2  |   1.017975   .0656199     0.28   0.782     .8971557    1.155066
          3  |   .8211875    .056382    -2.87   0.004     .7177937    .9394747
          4  |   .9985429   .0646188    -0.02   0.982     .8795952    1.133576
5 most de..  |   1.022398   .0830374     0.27   0.785     .8719406    1.198818
             |
        eth2 |
      Other  |   .9649627   .0590291    -0.58   0.560     .8559343    1.087879
    Missing  |   .9780112   .0535104    -0.41   0.684     .8785604    1.088719
             |
hh_total_cat |
        3-5  |   .9819371   .0447213    -0.40   0.689     .8980833     1.07362
       6-10  |   .7564137   .5322318    -0.40   0.692     .1904726    3.003906
             |
      region |
     London  |   1.067072   .0918992     0.75   0.451     .9013347    1.263286
 North East  |   1.093815   .1076019     0.91   0.362      .902004    1.326414
 North West  |   1.023305   .1023641     0.23   0.818     .8411184    1.244954
 South East  |   1.190257   .1146273     1.81   0.071      .985521    1.437525
 South West  |   1.105056   .1083414     1.02   0.308     .9118666    1.339175
West Midl..  |   1.076557   .1063919     0.75   0.455     .8869848    1.306646
Yorkshire..  |   1.125316   .1099616     1.21   0.227     .9291768    1.362858
             |
rural_urban5 |
Urban min..  |   .9191942   .0965562    -0.80   0.422      .748158    1.129331
Urban cit..  |   1.075332   .0944519     0.83   0.408     .9052678    1.277344
Rural tow..  |   1.035291    .091497     0.39   0.695     .8706326    1.231091
Rural vil..  |   1.009004   .0818073     0.11   0.912      .860755    1.182785
             |
  start_week |
23Nov-29Nov  |    1.16318   .0955773     1.84   0.066     .9901576    1.366436
30Nov-06Dec  |   1.123597   .0938129     1.40   0.163     .9539837    1.323367
07Dec-13Dec  |   1.019287   .0877093     0.22   0.824     .8610948    1.206541
14Dec-20Dec  |   1.093778   .0940067     1.04   0.297     .9242115    1.294456
21Dec-27Dec  |   1.124321   .0973238     1.35   0.176     .9488732    1.332208
28Dec-04Jan  |   1.111251   .1068498     1.10   0.273     .9203793    1.341707
             |
   agegroupA |
      0-<65  |   1.138104   .0919948     1.60   0.110     .9713546    1.333478
     75-<85  |   1.097855   .1342119     0.76   0.445     .8639457    1.395095
        85+  |    1.35136   .2082635     1.95   0.051      .999054    1.827903
             |
       _cons |   .0119832   .0017634   -30.07   0.000     .0089808    .0159894
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =    124,022
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |    .015494   .0004964    31.21   0.000      .014521    .0164669
        VOC  |   .0151625   .0004902    30.93   0.000     .0142017    .0161234
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =    124,022
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth2             (asbalanced)
               hh_total_cat     (asbalanced)
               region           (asbalanced)
               rural_urban5     (asbalanced)
               start_week       (asbalanced)
               agegroupA        (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0140544   .0033733     4.17   0.000     .0074428     .020666
        VOC  |   .0137537   .0033027     4.16   0.000     .0072806    .0202268
------------------------------------------------------------------------------

. 
. 
. 
. ***********************************************************
. /* Fully adjusted RR - age as spline, continuous hh size */
. ***********************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib1.obese4cat ho
> usehold_size ///
>                         i.region ib1.rural_urban5 ib0.comorb_cat ib1.start_we
> ek age1 age2 age3, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -3650.7523  
Iteration 1:   log likelihood = -1749.6461  
Iteration 2:   log likelihood = -1744.6933  
Iteration 3:   log likelihood = -1744.5811  
Iteration 4:   log likelihood =  -1744.581  

Generalized linear models                         Number of obs   =     22,839
Optimization     : ML                             Residual df     =     22,803
                                                  Scale parameter =          1
Deviance         =  3489.162069                   (1/df) Deviance =   .1530133
Pearson          =  22815.19597                   (1/df) Pearson  =   1.000535

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1559246
Log likelihood   = -1744.581035                   BIC             =  -225366.9

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9847768   .1065366    -0.14   0.887     .7966211    1.217373
             |
        male |
          M  |   .9758661   .1056207    -0.23   0.821     .7893367    1.206474
             |
         imd |
          2  |   1.063924    .165293     0.40   0.690     .7846326    1.442629
          3  |    .844902   .1406359    -1.01   0.311     .6097079    1.170822
          4  |   1.049562   .1630871     0.31   0.756     .7740046    1.423223
5 most de..  |   1.302663   .2362635     1.46   0.145     .9129562    1.858721
             |
        eth2 |
      Other  |   .9128814   .1358557    -0.61   0.540      .681927    1.222055
    Missing  |   1.018461   .1311134     0.14   0.887     .7913405    1.310767
             |
smoke_nomi~2 |
     Former  |   1.183308   .1623323     1.23   0.220     .9043273    1.548353
             |
   obese4cat |
Obese I ..)  |   1.226586   .1781456     1.41   0.160     .9227246    1.630511
Obese II..)  |   1.107415   .1672376     0.68   0.499     .8236929    1.488866
Obese II..)  |   .9489617   .1405594    -0.35   0.724     .7098546    1.268609
             |
household_~e |   .9803877   .0511464    -0.38   0.704     .8850973    1.085937
             |
      region |
     London  |   .8637726   .1703956    -0.74   0.458     .5867913    1.271496
 North East  |    .919354   .2112511    -0.37   0.714     .5859922     1.44236
 North West  |   .7898496   .1877885    -0.99   0.321     .4956433    1.258692
 South East  |   .9701811   .2167378    -0.14   0.892     .6261739    1.503179
 South West  |   1.020048   .2264186     0.09   0.929     .6602081    1.576016
West Midl..  |   1.031172   .2274007     0.14   0.889     .6692969    1.588706
Yorkshire..  |   1.081056   .2369367     0.36   0.722     .7035406    1.661144
             |
rural_urban5 |
Urban min..  |   1.502419   .3531165     1.73   0.083     .9478323      2.3815
Urban cit..  |   1.242076   .2670581     1.01   0.313     .8149516    1.893061
Rural tow..  |   1.084772   .2385648     0.37   0.711     .7049218    1.669307
Rural vil..  |   1.055645    .213265     0.27   0.789     .7104857    1.568486
             |
  comorb_cat |
1 comorbi..  |   .9602667    .227589    -0.17   0.864     .6034649     1.52803
2+ comorb..  |   .9195268   .1992448    -0.39   0.699     .6013461    1.406062
             |
  start_week |
23Nov-29Nov  |   .8819607   .1717909    -0.64   0.519     .6020737    1.291959
30Nov-06Dec  |   .9817386   .1875383    -0.10   0.923     .6751396    1.427572
07Dec-13Dec  |   .8591533   .1699837    -0.77   0.443     .5829888    1.266138
14Dec-20Dec  |   1.027428   .1962439     0.14   0.887     .7065901    1.493947
21Dec-27Dec  |   .9165665   .1867134    -0.43   0.669     .6148456     1.36635
28Dec-04Jan  |    .938754   .2085928    -0.28   0.776      .607314    1.451076
             |
        age1 |   1.002501   .0116882     0.21   0.830      .979852    1.025673
        age2 |   1.008284   .0375063     0.22   0.824     .9373893    1.084541
        age3 |   .9665665    .101038    -0.33   0.745     .7875047    1.186343
       _cons |   .0141735   .0101346    -5.95   0.000     .0034901    .0575601
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     22,839
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0148683   .0011318    13.14   0.000     .0126501    .0170865
        VOC  |   .0146419   .0011246    13.02   0.000     .0124377    .0168462
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =     22,839
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth2             (asbalanced)
               smoke_nomiss2    (asbalanced)
               obese4cat        (asbalanced)
               region           (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |    .015297   .0017791     8.60   0.000     .0118101    .0187839
        VOC  |   .0150641   .0017521     8.60   0.000     .0116302    .0184981
------------------------------------------------------------------------------

. 
. 
. 
. **************************************************
. /* Fully adjusted RR - age grouped, cat hh size */
. **************************************************
. 
. glm risk_28 i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib
> 1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3560.0687  
Iteration 1:   log likelihood = -1707.6666  
Iteration 2:   log likelihood = -1702.7779  
Iteration 3:   log likelihood = -1702.6677  
Iteration 4:   log likelihood = -1702.6677  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,257
                                                  Scale parameter =          1
Deviance         =  3406.140862                   (1/df) Deviance =   .1530368
Pearson          =  22244.24278                   (1/df) Pearson  =   .9994268

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1559833
Log likelihood   = -1702.667656                   BIC             =  -219431.6

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.001067   .1096109     0.01   0.992     .8077217    1.240694
             |
   agegroupA |
      0-<65  |   1.206755   .2380387     0.95   0.341     .8198138    1.776328
     75-<85  |   1.116279   .3351065     0.37   0.714     .6197865    2.010495
        85+  |   1.578508   .5764533     1.25   0.211     .7716092    3.229208
             |
        male |
          M  |   .9812347   .1074678    -0.17   0.863     .7916747    1.216183
             |
         imd |
          2  |   1.112087   .1742976     0.68   0.498     .8179555    1.511986
          3  |   .8811228   .1477965    -0.75   0.451     .6342476    1.224092
          4  |   1.050175   .1667389     0.31   0.758     .7693326    1.433537
5 most de..  |   1.338706   .2463883     1.58   0.113     .9333017    1.920209
             |
        eth2 |
      Other  |   .9280111     .13953    -0.50   0.619     .6911492    1.246047
    Missing  |   1.033733   .1342677     0.26   0.798     .8013993    1.333422
             |
smoke_nomi~2 |
     Former  |   1.190519   .1657649     1.25   0.210     .9061852    1.564067
             |
   obese4cat |
Obese I ..)  |   1.234225   .1805169     1.44   0.150     .9266123    1.643957
Obese II..)  |   1.089354   .1667139     0.56   0.576     .8070521    1.470402
Obese II..)  |    .926382   .1396397    -0.51   0.612     .6894184    1.244794
             |
hh_total_cat |
        3-5  |    1.06676   .1170068     0.59   0.556     .8604059    1.322605
       6-10  |          1  (empty)
             |
      region |
     London  |   .8569674   .1694798    -0.78   0.435     .5816005     1.26271
 North East  |   .9301869   .2136978    -0.32   0.753     .5929502    1.459225
 North West  |   .7456296   .1806994    -1.21   0.226     .4637019    1.198967
 South East  |   .9563747   .2151008    -0.20   0.843     .6154348    1.486189
 South West  |   .9884208    .222269    -0.05   0.959     .6361064    1.535868
West Midl..  |   1.015533   .2253711     0.07   0.945     .6573428    1.568903
Yorkshire..  |   1.057981   .2332528     0.26   0.798     .6867736    1.629829
             |
rural_urban5 |
Urban min..  |   1.394029    .332493     1.39   0.164     .8734736    2.224815
Urban cit..  |   1.223501   .2636063     0.94   0.349     .8020676    1.866371
Rural tow..  |   1.085968   .2388132     0.38   0.708     .7057177    1.671103
Rural vil..  |   1.021305    .207012     0.10   0.917     .6864714    1.519458
             |
  comorb_cat |
1 comorbi..  |   .9430543   .2238261    -0.25   0.805     .5922582    1.501628
2+ comorb..  |   .8850584   .1919883    -0.56   0.574     .5785326    1.353992
             |
  start_week |
23Nov-29Nov  |    .898687   .1794356    -0.54   0.593     .6076507    1.329116
30Nov-06Dec  |   1.022396   .1991635     0.11   0.909     .6979184    1.497731
07Dec-13Dec  |   .9119346    .182992    -0.46   0.646     .6154016    1.351353
14Dec-20Dec  |   1.072465   .2089344     0.36   0.720     .7320733    1.571128
21Dec-27Dec  |   .9735559   .2009448    -0.13   0.897     .6496364    1.458987
28Dec-04Jan  |     .96534   .2190737    -0.16   0.876     .6187413    1.506092
             |
       _cons |   .0106506   .0044821   -10.79   0.000     .0046684     .024299
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0147684   .0011412    12.94   0.000     .0125317     .017005
        VOC  |   .0147841   .0011459    12.90   0.000     .0125383      .01703
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               agegroupA        (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth2             (asbalanced)
               smoke_nomiss2    (asbalanced)
               obese4cat        (asbalanced)
               hh_total_cat     (asbalanced)
               region           (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |          .  (not estimable)
        VOC  |          .  (not estimable)
------------------------------------------------------------------------------

. 
. 
. 
. ***********************
. /* Subgroup analyses */
. ***********************
. 
. /* Fully adjusted RR - age grouped, cat hh size */
. 
. glm risk_28 i.sgtf ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 ib
> 1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3560.0687  
Iteration 1:   log likelihood = -1707.6666  
Iteration 2:   log likelihood = -1702.7779  
Iteration 3:   log likelihood = -1702.6677  
Iteration 4:   log likelihood = -1702.6677  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,257
                                                  Scale parameter =          1
Deviance         =  3406.140862                   (1/df) Deviance =   .1530368
Pearson          =  22244.24278                   (1/df) Pearson  =   .9994268

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1559833
Log likelihood   = -1702.667656                   BIC             =  -219431.6

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.001067   .1096109     0.01   0.992     .8077217    1.240694
             |
   agegroupA |
      0-<65  |   1.206755   .2380387     0.95   0.341     .8198138    1.776328
     75-<85  |   1.116279   .3351065     0.37   0.714     .6197865    2.010495
        85+  |   1.578508   .5764533     1.25   0.211     .7716092    3.229208
             |
        male |
          M  |   .9812347   .1074678    -0.17   0.863     .7916747    1.216183
             |
         imd |
          2  |   1.112087   .1742976     0.68   0.498     .8179555    1.511986
          3  |   .8811228   .1477965    -0.75   0.451     .6342476    1.224092
          4  |   1.050175   .1667389     0.31   0.758     .7693326    1.433537
5 most de..  |   1.338706   .2463883     1.58   0.113     .9333017    1.920209
             |
        eth2 |
      Other  |   .9280111     .13953    -0.50   0.619     .6911492    1.246047
    Missing  |   1.033733   .1342677     0.26   0.798     .8013993    1.333422
             |
smoke_nomi~2 |
     Former  |   1.190519   .1657649     1.25   0.210     .9061852    1.564067
             |
   obese4cat |
Obese I ..)  |   1.234225   .1805169     1.44   0.150     .9266123    1.643957
Obese II..)  |   1.089354   .1667139     0.56   0.576     .8070521    1.470402
Obese II..)  |    .926382   .1396397    -0.51   0.612     .6894184    1.244794
             |
hh_total_cat |
        3-5  |    1.06676   .1170068     0.59   0.556     .8604059    1.322605
       6-10  |          1  (empty)
             |
      region |
     London  |   .8569674   .1694798    -0.78   0.435     .5816005     1.26271
 North East  |   .9301869   .2136978    -0.32   0.753     .5929502    1.459225
 North West  |   .7456296   .1806994    -1.21   0.226     .4637019    1.198967
 South East  |   .9563747   .2151008    -0.20   0.843     .6154348    1.486189
 South West  |   .9884208    .222269    -0.05   0.959     .6361064    1.535868
West Midl..  |   1.015533   .2253711     0.07   0.945     .6573428    1.568903
Yorkshire..  |   1.057981   .2332528     0.26   0.798     .6867736    1.629829
             |
rural_urban5 |
Urban min..  |   1.394029    .332493     1.39   0.164     .8734736    2.224815
Urban cit..  |   1.223501   .2636063     0.94   0.349     .8020676    1.866371
Rural tow..  |   1.085968   .2388132     0.38   0.708     .7057177    1.671103
Rural vil..  |   1.021305    .207012     0.10   0.917     .6864714    1.519458
             |
  comorb_cat |
1 comorbi..  |   .9430543   .2238261    -0.25   0.805     .5922582    1.501628
2+ comorb..  |   .8850584   .1919883    -0.56   0.574     .5785326    1.353992
             |
  start_week |
23Nov-29Nov  |    .898687   .1794356    -0.54   0.593     .6076507    1.329116
30Nov-06Dec  |   1.022396   .1991635     0.11   0.909     .6979184    1.497731
07Dec-13Dec  |   .9119346    .182992    -0.46   0.646     .6154016    1.351353
14Dec-20Dec  |   1.072465   .2089344     0.36   0.720     .7320733    1.571128
21Dec-27Dec  |   .9735559   .2009448    -0.13   0.897     .6496364    1.458987
28Dec-04Jan  |     .96534   .2190737    -0.16   0.876     .6187413    1.506092
             |
       _cons |   .0106506   .0044821   -10.79   0.000     .0046684     .024299
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_no_int

. 
. * Constant VOC effect over subgroups
. lincom 1.sgtf, eform

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.001067   .1096109     0.01   0.992     .8077217    1.240694
------------------------------------------------------------------------------

. margins sgtf

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0147684   .0011412    12.94   0.000     .0125317     .017005
        VOC  |   .0147841   .0011459    12.90   0.000     .0125383      .01703
------------------------------------------------------------------------------

. 
. 
. /* Age group */
. glm risk_28 i.sgtf##ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_nomiss2 i
> b1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3559.8728  
Iteration 1:   log likelihood = -1707.1415  
Iteration 2:   log likelihood = -1702.0689  
Iteration 3:   log likelihood = -1701.9547  
Iteration 4:   log likelihood = -1701.9546  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,254
                                                  Scale parameter =          1
Deviance         =  3404.695234                   (1/df) Deviance =   .1529925
Pearson          =  22247.52027                   (1/df) Pearson  =   .9997088

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1561885
Log likelihood   = -1701.954642                   BIC             =    -219403

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.494952   .5753158     1.04   0.296     .7031564    3.178358
             |
   agegroupA |
      0-<65  |   1.525924   .4755783     1.36   0.175     .8284049    2.810757
     75-<85  |   1.568548   .6810441     1.04   0.300      .669756    3.673491
        85+  |   2.036073   1.089126     1.33   0.184     .7136299    5.809164
             |
        sgtf#|
   agegroupA |
  VOC#0-<65  |   .6550784   .2640699    -1.05   0.294     .2972786     1.44352
 VOC#75-<85  |   .5240875   .3188414    -1.06   0.288     .1590576    1.726844
    VOC#85+  |   .6305402   .4636144    -0.63   0.531     .1492292    2.664231
             |
        male |
          M  |   .9797181    .107327    -0.19   0.852      .790411    1.214365
             |
         imd |
          2  |   1.112178   .1743084     0.68   0.498     .8180277      1.5121
          3  |   .8806234   .1477136    -0.76   0.449     .6338869    1.223401
          4  |   1.048734   .1665238     0.30   0.764     .7682574    1.431607
5 most de..  |   1.335218   .2457704     1.57   0.116     .9308369    1.915274
             |
        eth2 |
      Other  |   .9273207   .1394248    -0.50   0.616      .690637    1.245117
    Missing  |   1.035192    .134462     0.27   0.790     .8025227    1.335316
             |
smoke_nomi~2 |
     Former  |   1.190883   .1658165     1.25   0.210     .9064613    1.564548
             |
   obese4cat |
Obese I ..)  |   1.235471   .1807058     1.45   0.148     .9275382    1.645634
Obese II..)  |   1.089506   .1667424     0.56   0.575     .8071576    1.470622
Obese II..)  |   .9255079   .1395061    -0.51   0.608     .6887706    1.243614
             |
hh_total_cat |
        3-5  |   1.067148   .1170479     0.59   0.554      .860721    1.323083
       6-10  |          1  (empty)
             |
      region |
     London  |    .855899   .1692772    -0.79   0.431     .5808638    1.261162
 North East  |   .9290674   .2134441    -0.32   0.749     .5922323    1.457479
 North West  |   .7457821   .1807322    -1.21   0.226     .4638019    1.199199
 South East  |   .9561884   .2150561    -0.20   0.842     .6153185    1.485891
 South West  |   .9900219   .2226167    -0.04   0.964     .6371523    1.538319
West Midl..  |    1.01437   .2251056     0.06   0.949     .6565994    1.567083
Yorkshire..  |   1.055261   .2326575     0.24   0.807     .6850025    1.625652
             |
rural_urban5 |
Urban min..  |   1.395687   .3329088     1.40   0.162     .8744871    2.227524
Urban cit..  |    1.22517   .2639976     0.94   0.346     .8031212    1.869011
Rural tow..  |   1.086744   .2389883     0.38   0.705     .7062163     1.67231
Rural vil..  |    1.02451    .207696     0.12   0.905     .6885806    1.524326
             |
  comorb_cat |
1 comorbi..  |   .9460113   .2245586    -0.23   0.815     .5940775    1.506432
2+ comorb..  |   .8863042   .1922953    -0.56   0.578     .5792999    1.356008
             |
  start_week |
23Nov-29Nov  |   .8988311   .1794852    -0.53   0.593     .6077205     1.32939
30Nov-06Dec  |   1.023598   .1994103     0.12   0.905     .6987215    1.499528
07Dec-13Dec  |    .911198   .1828715    -0.46   0.643     .6148683    1.350341
14Dec-20Dec  |    1.07139   .2087196     0.35   0.723     .7313464    1.569538
21Dec-27Dec  |   .9747196   .2011966    -0.12   0.901     .6503978    1.460765
28Dec-04Jan  |   .9652879   .2190574    -0.16   0.876     .6187136    1.505997
             |
       _cons |   .0084965   .0040704    -9.95   0.000     .0033224     .021728
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_ageX

. 
. lrtest e_no_int e_ageX

Likelihood-ratio test                                 LR chi2(3)  =      1.43
(Assumption: e_no_int nested in e_ageX)               Prob > chi2 =    0.6994

. 
. * Age group VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // 0-<65

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.494952   .5753158     1.04   0.296     .7031564    3.178358
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.agegroupA, eform       // 65-<75

 ( 1)  [risk_28]1.sgtf + [risk_28]1o.sgtf#2b.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.494952   .5753158     1.04   0.296     .7031564    3.178358
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.agegroupA, eform       // 75-<85

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7834859   .3692086    -0.52   0.605     .3111089    1.973104
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.agegroupA, eform       // 85+

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9426276   .5904962    -0.09   0.925     .2761318    3.217835
------------------------------------------------------------------------------

. 
. * Age group marginal risks
. margins sgtf, over(agegroupA)

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : agegroupA

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   agegroupA#|
        sgtf |
      0-<65 #|
    non-VOC  |   .0151485    .001275    11.88   0.000     .0126496    .0176474
  0-<65#VOC  |   .0148351   .0012719    11.66   0.000     .0123422     .017328
     65-<75 #|
    non-VOC  |   .0098849   .0029658     3.33   0.001     .0040721    .0156978
 65-<75#VOC  |   .0147775   .0035577     4.15   0.000     .0078045    .0217505
     75-<85 #|
    non-VOC  |   .0157311   .0049353     3.19   0.001     .0060582     .025404
 75-<85#VOC  |   .0123251   .0043306     2.85   0.004     .0038374    .0208128
85+#non-VOC  |   .0202524   .0089633     2.26   0.024     .0026846    .0378202
    85+#VOC  |   .0190905   .0084551     2.26   0.024     .0025187    .0356622
------------------------------------------------------------------------------

. 
. 
. /* Ethnicity */
. glm risk_28 i.sgtf##ib1.eth2 ib0.comorb_cat ib2.agegroupA i.male ib1.imd ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib1.start_
> week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3559.9454  
Iteration 1:   log likelihood = -1707.2903  
Iteration 2:   log likelihood = -1702.3174  
Iteration 3:   log likelihood = -1702.2047  
Iteration 4:   log likelihood = -1702.2046  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,255
                                                  Scale parameter =          1
Deviance         =  3405.223299                   (1/df) Deviance =   .1530094
Pearson          =  22201.17302                   (1/df) Pearson  =   .9975814

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1561212
Log likelihood   =  -1702.20464                   BIC             =  -219412.5

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.060853    .154104     0.41   0.684     .7980062    1.410277
             |
        eth2 |
      Other  |   1.067706     .22051     0.32   0.751     .7122881    1.600471
    Missing  |   1.051433   .1931698     0.27   0.785     .7334969    1.507178
             |
   sgtf#eth2 |
  VOC#Other  |   .7506877   .2263977    -0.95   0.342     .4156692    1.355722
VOC#Missing  |   .9678055   .2513243    -0.13   0.900     .5817602    1.610023
             |
  comorb_cat |
1 comorbi..  |   .9448855    .224271    -0.24   0.811     .5933956    1.504576
2+ comorb..  |   .8862348   .1922527    -0.56   0.578     .5792899    1.355819
             |
   agegroupA |
      0-<65  |   1.205419   .2377817     0.95   0.344     .8188976     1.77438
     75-<85  |    1.11458   .3346077     0.36   0.718     .6188315    2.007475
        85+  |   1.577531    .576096     1.25   0.212     .7711321    3.227207
             |
        male |
          M  |   .9819616   .1075486    -0.17   0.868     .7922592    1.217087
             |
         imd |
          2  |   1.114048   .1746097     0.69   0.491     .8193907    1.514664
          3  |   .8816293   .1478814    -0.75   0.453     .6346122    1.224796
          4  |   1.051986   .1670343     0.32   0.750     .7706479     1.43603
5 most de..  |   1.338462   .2463325     1.58   0.113     .9331462    1.919828
             |
smoke_nomi~2 |
     Former  |   1.191437   .1658889     1.26   0.208     .9068899    1.565264
             |
   obese4cat |
Obese I ..)  |   1.235953   .1807836     1.45   0.148     .9278888    1.646295
Obese II..)  |   1.089367    .166715     0.56   0.576     .8070636    1.470418
Obese II..)  |   .9270269   .1397376    -0.50   0.615     .6898973    1.245662
             |
hh_total_cat |
        3-5  |   1.068071   .1171612     0.60   0.548      .861446    1.324256
       6-10  |          1  (empty)
             |
      region |
     London  |   .8572024   .1695232    -0.78   0.436     .5817641    1.263048
 North East  |   .9324532   .2142264    -0.30   0.761      .594385    1.462804
 North West  |   .7447672   .1804859    -1.22   0.224     .4631712    1.197566
 South East  |   .9578792    .215443    -0.19   0.848     .6163982    1.488539
 South West  |   .9898915    .222593    -0.05   0.964     .6370613    1.538133
West Midl..  |   1.014081   .2250533     0.06   0.950     .6563974    1.566673
Yorkshire..  |   1.059175   .2335263     0.26   0.794     .6875355    1.631699
             |
rural_urban5 |
Urban min..  |   1.396282   .3330451     1.40   0.162     .8748676    2.228457
Urban cit..  |   1.226487   .2642634     0.95   0.343     .8040072    1.870966
Rural tow..  |   1.088322   .2393452     0.38   0.700     .7072293    1.674769
Rural vil..  |   1.024215   .2076329     0.12   0.906     .6883862    1.523877
             |
  start_week |
23Nov-29Nov  |   .8984778   .1793911    -0.54   0.592     .6075128    1.328799
30Nov-06Dec  |   1.024812   .1996539     0.13   0.900     .6995406    1.501327
07Dec-13Dec  |   .9115678   .1829168    -0.46   0.644     .6151561    1.350805
14Dec-20Dec  |   1.071743   .2087935     0.36   0.722     .7315804     1.57007
21Dec-27Dec  |    .973668   .2009737    -0.13   0.897     .6497037    1.459172
28Dec-04Jan  |   .9620891   .2183602    -0.17   0.865     .6166271    1.501094
             |
       _cons |   .0102821   .0043656   -10.78   0.000     .0044738    .0236311
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_ethX

. 
. * Test for interaction
. lrtest e_no_int e_ethX

Likelihood-ratio test                                 LR chi2(2)  =      0.93
(Assumption: e_no_int nested in e_ethX)               Prob > chi2 =    0.6294

. 
. * Comorbidities VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                    // White

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.060853    .154104     0.41   0.684     .7980062    1.410277
------------------------------------------------------------------------------

. *lincom 1.sgtf + 1.sgtf#2.eth5, eform   // S Asian
. *lincom 1.sgtf + 1.sgtf#3.eth5, eform   // Black
. *lincom 1.sgtf + 1.sgtf#4.eth5, eform   // Mixed
. lincom 1.sgtf + 1.sgtf#5.eth2, eform    // Other

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.eth2 = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7963696   .2104366    -0.86   0.389     .4744485     1.33672
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#9.eth2, eform    // Missing

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#9.eth2 = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     1.0267   .2210224     0.12   0.903     .6732888    1.565617
------------------------------------------------------------------------------

. 
. * Comorbidity marginal risks
. margins sgtf, over(eth2)

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : eth2

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   eth2#sgtf |
      White #|
    non-VOC  |   .0144065   .0014991     9.61   0.000     .0114682    .0173448
  White#VOC  |   .0152832   .0015478     9.87   0.000     .0122496    .0183168
      Other #|
    non-VOC  |   .0154432   .0027525     5.61   0.000     .0100485     .020838
  Other#VOC  |   .0122985   .0023971     5.13   0.000     .0076004    .0169967
    Missing #|
    non-VOC  |   .0151291   .0022891     6.61   0.000     .0106426    .0196156
Missing#VOC  |   .0155331   .0023775     6.53   0.000     .0108732    .0201929
------------------------------------------------------------------------------

. 
. 
. 
. /* Comorbidities */
. glm risk_28 i.sgtf##ib0.comorb_cat ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib1.start_
> week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3559.4609  
Iteration 1:   log likelihood =  -1706.241  
Iteration 2:   log likelihood = -1701.0395  
Iteration 3:   log likelihood = -1700.9067  
Iteration 4:   log likelihood = -1700.9066  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,255
                                                  Scale parameter =          1
Deviance         =     3402.602                   (1/df) Deviance =   .1528916
Pearson          =  22275.94952                   (1/df) Pearson  =   1.000941

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1560047
Log likelihood   = -1700.906624                   BIC             =  -219415.1

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .6166926   .2614972    -1.14   0.254     .2686162    1.415811
             |
  comorb_cat |
1 comorbi..  |   .6354967   .2028692    -1.42   0.156     .3399264    1.188069
2+ comorb..  |   .7313154   .2045977    -1.12   0.263     .4226364    1.265443
             |
        sgtf#|
  comorb_cat |
        VOC #|
1 comorbi..  |   2.258327   1.094696     1.68   0.093     .8733282    5.839774
        VOC #|
2+ comorb..  |    1.53546   .6810825     0.97   0.334     .6436828    3.662732
             |
   agegroupA |
      0-<65  |    1.20202   .2371083     0.93   0.351     .8165918    1.769368
     75-<85  |   1.109794   .3331533     0.35   0.729      .616193    1.998793
        85+  |   1.564354   .5713583     1.23   0.221     .7646202    3.200549
             |
        male |
          M  |   .9821526   .1075564    -0.16   0.869     .7924342    1.217292
             |
         imd |
          2  |   1.109918   .1739654     0.67   0.506     .8163488    1.509057
          3  |   .8801216    .147621    -0.76   0.446     .6335376    1.222681
          4  |   1.051203   .1668973     0.31   0.753     .7700929    1.434928
5 most de..  |    1.33852   .2463444     1.58   0.113     .9331847    1.919915
             |
        eth2 |
      Other  |   .9262286   .1392444    -0.51   0.610     .6898473    1.243608
    Missing  |   1.034917   .1344077     0.26   0.792     .8023386    1.334915
             |
smoke_nomi~2 |
     Former  |   1.192372   .1660188     1.26   0.206     .9076018    1.566491
             |
   obese4cat |
Obese I ..)  |   1.234053   .1804679     1.44   0.150     .9265183    1.643666
Obese II..)  |   1.088779   .1666128     0.56   0.578     .8066456    1.469592
Obese II..)  |   .9266283    .139665    -0.51   0.613     .6896189    1.245093
             |
hh_total_cat |
        3-5  |   1.067325   .1170588     0.59   0.552     .8608776    1.323281
       6-10  |          1  (empty)
             |
      region |
     London  |   .8566161   .1694046    -0.78   0.434     .5813698    1.262176
 North East  |   .9284767    .213306    -0.32   0.747     .5918587    1.456545
 North West  |   .7481888   .1813268    -1.20   0.231     .4652847    1.203105
 South East  |   .9580159   .2155015    -0.19   0.849     .6164511    1.488836
 South West  |   .9915988   .2229932    -0.04   0.970     .6381396    1.540835
West Midl..  |   1.016758   .2256464     0.07   0.940     .6581315    1.570806
Yorkshire..  |   1.056268   .2328614     0.25   0.804     .6856797    1.627149
             |
rural_urban5 |
Urban min..  |   1.386143   .3306016     1.37   0.171     .8685449    2.212196
Urban cit..  |   1.218303   .2624872     0.92   0.359     .7986586    1.858443
Rural tow..  |   1.081418   .2377997     0.36   0.722     .7027769    1.664062
Rural vil..  |   1.015171    .205775     0.07   0.941     .6823403     1.51035
             |
  start_week |
23Nov-29Nov  |   .8973937   .1791649    -0.54   0.588     .6067928    1.327167
30Nov-06Dec  |   1.019758    .198669     0.10   0.920     .6960916    1.493922
07Dec-13Dec  |   .9122705   .1830502    -0.46   0.647     .6156404    1.351824
14Dec-20Dec  |   1.071223   .2086772     0.35   0.724     .7312457    1.569265
21Dec-27Dec  |   .9730923   .2008381    -0.13   0.895     .6493414     1.45826
28Dec-04Jan  |   .9641144   .2187842    -0.16   0.872     .6179701    1.504145
             |
       _cons |   .0133473   .0060046    -9.59   0.000     .0055266    .0322347
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_comorbX

. 
. * Test for interaction
. lrtest e_no_int e_comorbX

Likelihood-ratio test                                 LR chi2(2)  =      3.52
(Assumption: e_no_int nested in e_comorbX)            Prob > chi2 =    0.1719

. 
. * Comorbidities VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // no comorbs

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6166926   .2614972    -1.14   0.254     .2686162    1.415811
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.comorb_cat, eform      // 1 comorb

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#1.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.392693   .3273683     1.41   0.159     .8785589      2.2077
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.comorb_cat, eform      // 2+ comorbs

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9469068   .1232656    -0.42   0.675     .7336692    1.222121
------------------------------------------------------------------------------

. 
. * Comorbidity marginal risks
. margins sgtf, over(comorb_cat)

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : comorb_cat

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  comorb_cat#|
        sgtf |
No comorb.. #|
    non-VOC  |   .0200541   .0053044     3.78   0.000     .0096577    .0304506
No comorb.. #|
        VOC  |   .0123672   .0040964     3.02   0.003     .0043385    .0203959
1 comorbi.. #|
    non-VOC  |   .0129309   .0023072     5.60   0.000     .0084089    .0174529
1 comorbi.. #|
        VOC  |   .0180087   .0027533     6.54   0.000     .0126123    .0234051
2+ comorb.. #|
    non-VOC  |   .0148565    .001346    11.04   0.000     .0122185    .0174946
2+ comorb.. #|
        VOC  |   .0140677    .001314    10.71   0.000     .0114923    .0166432
------------------------------------------------------------------------------

. 
. 
. /* IMD */
. glm risk_28 i.sgtf##ib1.imd ib2.agegroupA i.male ib1.eth2 ib1.smoke_nomiss2 i
> b1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3559.7557  
Iteration 1:   log likelihood =  -1706.974  
Iteration 2:   log likelihood = -1701.9322  
Iteration 3:   log likelihood =  -1701.812  
Iteration 4:   log likelihood = -1701.8119  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,253
                                                  Scale parameter =          1
Deviance         =  3404.449748                   (1/df) Deviance =   .1529883
Pearson          =  22240.71546                   (1/df) Pearson  =    .999448

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1562654
Log likelihood   =  -1701.81194                   BIC             =  -219393.2

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.129504   .2315968     0.59   0.553     .7557096    1.688187
             |
         imd |
          2  |   1.330127   .2869299     1.32   0.186     .8715152     2.03007
          3  |   .9086319   .2198301    -0.40   0.692     .5655257    1.459902
          4  |   1.067437   .2474744     0.28   0.778     .6776412    1.681453
5 most de..  |   1.465174   .3780024     1.48   0.139     .8836627     2.42936
             |
    sgtf#imd |
      VOC#2  |   .6859641   .2164538    -1.19   0.232     .3695792    1.273196
      VOC#3  |   .9406549   .3157398    -0.18   0.855     .4872102    1.816119
      VOC#4  |   .9650916   .3070594    -0.11   0.911      .517303    1.800495
        VOC #|
5 most de..  |   .8343721    .307461    -0.49   0.623     .4052259    1.717997
             |
   agegroupA |
      0-<65  |   1.207377   .2381786     0.96   0.339     .8202132    1.777292
     75-<85  |   1.116264   .3351119     0.37   0.714     .6197679    2.010503
        85+  |   1.583234   .5782666     1.26   0.208     .7738357    3.239226
             |
        male |
          M  |    .979745   .1073164    -0.19   0.852     .7904542    1.214365
             |
        eth2 |
      Other  |   .9294953    .139763    -0.49   0.627     .6922402    1.248066
    Missing  |    1.03367   .1342572     0.25   0.799     .8013537    1.333335
             |
smoke_nomi~2 |
     Former  |   1.193432   .1661862     1.27   0.204     .9083789    1.567935
             |
   obese4cat |
Obese I ..)  |   1.234492   .1805807     1.44   0.150     .9267771    1.644378
Obese II..)  |   1.093126   .1673189     0.58   0.561      .809807    1.475568
Obese II..)  |   .9295336    .140152    -0.48   0.628     .6917095    1.249126
             |
hh_total_cat |
        3-5  |   1.066867   .1170252     0.59   0.555     .8604813    1.322754
       6-10  |          1  (empty)
             |
      region |
     London  |   .8579716    .169673    -0.77   0.439     .5822893    1.264175
 North East  |   .9320662   .2141266    -0.31   0.759     .5941518    1.462164
 North West  |   .7499538   .1817769    -1.19   0.235     .4663551    1.206014
 South East  |   .9595173   .2158156    -0.18   0.854      .617447    1.491097
 South West  |   .9901626   .2226626    -0.04   0.965      .637225    1.538581
West Midl..  |   1.014759   .2251985     0.07   0.947     .6568427    1.567704
Yorkshire..  |   1.061494   .2340649     0.27   0.787     .6890066    1.635354
             |
rural_urban5 |
Urban min..  |   1.393892   .3324639     1.39   0.164     .8733835    2.224607
Urban cit..  |   1.225468   .2640303     0.94   0.345     .8033563    1.869371
Rural tow..  |   1.086514    .238948     0.38   0.706     .7060532    1.671987
Rural vil..  |   1.022785   .2073023     0.11   0.911     .6874786    1.521631
             |
  comorb_cat |
1 comorbi..  |   .9437442   .2239899    -0.24   0.807     .5926914    1.502727
2+ comorb..  |   .8835254   .1916558    -0.57   0.568     .5775305    1.351647
             |
  start_week |
23Nov-29Nov  |   .8979593   .1792865    -0.54   0.590     .6071636    1.328029
30Nov-06Dec  |   1.021108   .1989312     0.11   0.915      .697014    1.495898
07Dec-13Dec  |   .9113492   .1828705    -0.46   0.644     .6150118    1.350474
14Dec-20Dec  |   1.070553   .2085606     0.35   0.726     .7307701    1.568324
21Dec-27Dec  |   .9727383   .2007876    -0.13   0.893     .6490757    1.457796
28Dec-04Jan  |   .9657069   .2191447    -0.15   0.878     .6189919    1.506627
             |
       _cons |   .0099749   .0043013   -10.69   0.000     .0042841    .0232251
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_imdX

. 
. * Test for interaction
. lrtest e_no_int e_imdX

Likelihood-ratio test                                 LR chi2(4)  =      1.71
(Assumption: e_no_int nested in e_imdX)               Prob > chi2 =    0.7886

. 
. * IMD VOC vs. non-VOC RR
. lincom 1.sgtf, eform                            // 1 least deprived

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.129504   .2315968     0.59   0.553     .7557096    1.688187
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.imd, eform     // 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7747993   .1857933    -1.06   0.287      .484256    1.239663
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.imd, eform     // 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.062474   .2823941     0.23   0.820     .6310705    1.788786
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.imd, eform     // 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.090075   .2652554     0.35   0.723     .6765932    1.756245
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.imd, eform     // 5 most deprived

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9424267   .2884878    -0.19   0.846     .5172314    1.717158
------------------------------------------------------------------------------

. 
. * IMD marginal risks
. margins sgtf, over(imd)

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : imd

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    imd#sgtf |
1 least d.. #|
    non-VOC  |   .0133437   .0019756     6.75   0.000     .0094716    .0172159
1 least d.. #|
        VOC  |   .0150718   .0021367     7.05   0.000      .010884    .0192597
  2#non-VOC  |    .017684   .0027715     6.38   0.000     .0122519    .0231161
      2#VOC  |   .0137016   .0024846     5.51   0.000     .0088317    .0185714
  3#non-VOC  |   .0121281   .0023197     5.23   0.000     .0075817    .0166745
      3#VOC  |   .0128858   .0023771     5.42   0.000     .0082267    .0175449
  4#non-VOC  |   .0142013   .0025327     5.61   0.000     .0092373    .0191654
      4#VOC  |   .0154805   .0025602     6.05   0.000     .0104626    .0204985
5 most de.. #|
    non-VOC  |   .0195935   .0041358     4.74   0.000     .0114875    .0276996
5 most de.. #|
        VOC  |   .0184655   .0040905     4.51   0.000     .0104483    .0264827
------------------------------------------------------------------------------

. 
. 
. 
. /* Epi week */
. glm risk_28 i.sgtf##ib1.start_week ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.
> smoke_nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat i.region ib1.rural_urban5 ib0.comorb
> _cat, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3559.3033  
Iteration 1:   log likelihood = -1705.8374  
Iteration 2:   log likelihood = -1700.4904  
Iteration 3:   log likelihood =  -1700.357  
Iteration 4:   log likelihood = -1700.3569  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,251
                                                  Scale parameter =          1
Deviance         =  3401.519256                   (1/df) Deviance =   .1528704
Pearson          =  22240.37323                   (1/df) Pearson  =   .9995224

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1563143
Log likelihood   = -1700.356923                   BIC             =  -219376.1

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.149734   .3238339     0.50   0.620     .6619851    1.996856
             |
  start_week |
23Nov-29Nov  |   1.131103   .3135323     0.44   0.657     .6569865    1.947369
30Nov-06Dec  |   1.210658   .3355102     0.69   0.490     .7032789    2.084084
07Dec-13Dec  |   1.036262   .2945606     0.13   0.900     .5936262    1.808948
14Dec-20Dec  |   .9695182   .2839591    -0.11   0.916     .5460724     1.72132
21Dec-27Dec  |   .9142255   .2814809    -0.29   0.771     .5000079     1.67159
28Dec-04Jan  |   1.076506    .347867     0.23   0.820     .5714198    2.028045
             |
        sgtf#|
  start_week |
        VOC #|
23Nov-29Nov  |    .614343   .2477601    -1.21   0.227     .2786939    1.354236
        VOC #|
30Nov-06Dec  |   .7144087   .2792583    -0.86   0.390     .3320602     1.53701
        VOC #|
07Dec-13Dec  |    .774738   .3119269    -0.63   0.526     .3519184    1.705563
        VOC #|
14Dec-20Dec  |   1.205114   .4728993     0.48   0.634     .5584801     2.60045
        VOC #|
21Dec-27Dec  |   1.126629   .4676509     0.29   0.774     .4994094    2.541587
        VOC #|
28Dec-04Jan  |   .8088909   .3676395    -0.47   0.641       .33191    1.971331
             |
   agegroupA |
      0-<65  |   1.209744   .2386233     0.97   0.334     .8218512    1.780713
     75-<85  |   1.113396   .3342398     0.36   0.720     .6181878    2.005299
        85+  |   1.599493    .584215     1.29   0.198     .7817737    3.272532
             |
        male |
          M  |   .9805895   .1074045    -0.18   0.858     .7911424    1.215402
             |
         imd |
          2  |   1.112341   .1743245     0.68   0.497     .8181611    1.512297
          3  |   .8824108   .1480032    -0.75   0.456      .635188    1.225856
          4  |   1.048667   .1664956     0.30   0.765     .7682339    1.431469
5 most de..  |   1.340288   .2466878     1.59   0.112      .934393    1.922502
             |
        eth2 |
      Other  |    .929563   .1397997    -0.49   0.627     .6922518    1.248227
    Missing  |   1.033746    .134273     0.26   0.798     .8014037    1.333448
             |
smoke_nomi~2 |
     Former  |    1.19088   .1658218     1.25   0.210       .90645    1.564558
             |
   obese4cat |
Obese I ..)  |   1.232328   .1802238     1.43   0.153     .9252116     1.64139
Obese II..)  |   1.088694    .166598     0.56   0.579     .8065848    1.469472
Obese II..)  |   .9245771   .1393568    -0.52   0.603     .6880909     1.24234
             |
hh_total_cat |
        3-5  |   1.065255   .1168411     0.58   0.564     .8591929    1.320738
       6-10  |          1  (empty)
             |
      region |
     London  |   .8579474   .1696635    -0.77   0.438     .5822791    1.264125
 North East  |   .9345945   .2147054    -0.29   0.768     .5957661    1.466124
 North West  |   .7466413   .1809319    -1.21   0.228     .4643466    1.200554
 South East  |   .9630235   .2166013    -0.17   0.867      .619707    1.496537
 South West  |   .9930457   .2232993    -0.03   0.975     .6390951    1.543025
West Midl..  |   1.014842   .2252152     0.07   0.947     .6568992    1.567828
Yorkshire..  |   1.060451    .233788     0.27   0.790     .6883888    1.633605
             |
rural_urban5 |
Urban min..  |    1.39592   .3329565     1.40   0.162     .8746433    2.227872
Urban cit..  |   1.230685   .2651827     0.96   0.335     .8067399    1.877414
Rural tow..  |   1.094781   .2407895     0.41   0.681     .7113959     1.68478
Rural vil..  |   1.026339   .2080439     0.13   0.898     .6898397     1.52698
             |
  comorb_cat |
1 comorbi..  |   .9438734   .2240023    -0.24   0.808      .592795    1.502875
2+ comorb..  |   .8843095   .1918329    -0.57   0.571     .5780341    1.352867
             |
       _cons |   .0098262   .0043627   -10.41   0.000     .0041159    .0234587
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_weekX

. 
. * Test for interaction
. lrtest e_no_int e_weekX

Likelihood-ratio test                                 LR chi2(6)  =      4.62
(Assumption: e_no_int nested in e_weekX)              Prob > chi2 =    0.5932

. 
. * Epi week VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // week 1

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.149734   .3238339     0.50   0.620     .6619851    1.996856
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.start_week, eform      // week 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7063312   .2039427    -1.20   0.229     .4010851    1.243885
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.start_week, eform      // week 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8213801   .2225715    -0.73   0.468     .4829386       1.397
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.start_week, eform      // week 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8907427   .2563066    -0.40   0.688     .5067846    1.565601
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.start_week, eform      // week 5

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.385561   .3784502     1.19   0.233     .8112028    2.366582
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.start_week, eform      // week 6

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.295324   .3949857     0.85   0.396     .7125571    2.354707
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.start_week, eform      // week 7

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9300095   .3317818    -0.20   0.839     .4621898    1.871347
------------------------------------------------------------------------------

. 
. * Epi week marginal risks
. margins sgtf, over(start_week)

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : start_week

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  start_week#|
        sgtf |
16Nov-22Nov #|
    non-VOC  |   .0140691   .0029125     4.83   0.000     .0083607    .0197775
16Nov-22Nov #|
        VOC  |   .0161757   .0030872     5.24   0.000     .0101249    .0222266
23Nov-29Nov #|
    non-VOC  |    .015974   .0029418     5.43   0.000     .0102082    .0217398
23Nov-29Nov #|
        VOC  |   .0112829   .0025082     4.50   0.000      .006367    .0161989
30Nov-06Dec #|
    non-VOC  |   .0168571   .0031038     5.43   0.000     .0107738    .0229403
30Nov-06Dec #|
        VOC  |    .013846   .0027501     5.03   0.000     .0084559    .0192362
07Dec-13Dec #|
    non-VOC  |   .0145887   .0028396     5.14   0.000     .0090232    .0201542
07Dec-13Dec #|
        VOC  |   .0129948   .0027523     4.72   0.000     .0076004    .0183892
14Dec-20Dec #|
    non-VOC  |   .0136101   .0028183     4.83   0.000     .0080864    .0191338
14Dec-20Dec #|
        VOC  |   .0188576   .0033552     5.62   0.000     .0122816    .0254336
21Dec-27Dec #|
    non-VOC  |    .012835   .0029254     4.39   0.000     .0071014    .0185687
21Dec-27Dec #|
        VOC  |   .0166255    .003365     4.94   0.000     .0100303    .0232208
28Dec-04Jan #|
    non-VOC  |   .0151945   .0037689     4.03   0.000     .0078075    .0225815
28Dec-04Jan #|
        VOC  |    .014131   .0036217     3.90   0.000     .0070326    .0212294
------------------------------------------------------------------------------

. 
. 
. /* NHS region */
. 
. /*
> glm risk_28 i.sgtf i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week i.region, ///
>                         family(bin) link(log) eform
>                         
> est store e_region
> */
. 
. glm risk_28 i.sgtf##i.region ib2.agegroupA i.male ib1.imd ib1.eth2 ib1.smoke_
> nomiss2 ib1.obese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 28 obs not used


Iteration 0:   log likelihood = -3558.6605  
Iteration 1:   log likelihood =  -1704.361  
Iteration 2:   log likelihood = -1698.7036  
Iteration 3:   log likelihood = -1698.5478  
Iteration 4:   log likelihood = -1698.5477  

Generalized linear models                         Number of obs   =     22,265
Optimization     : ML                             Residual df     =     22,250
                                                  Scale parameter =          1
Deviance         =  3397.912773                   (1/df) Deviance =   .1527152
Pearson          =  22258.40923                   (1/df) Pearson  =   1.000378

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1562417
Log likelihood   = -1698.547671                   BIC             =  -219369.7

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    1.06522   .3346627     0.20   0.841     .5754598    1.971802
             |
      region |
     London  |   .9530187   .2669628    -0.17   0.864     .5503766    1.650224
 North East  |   .7036054     .25167    -0.98   0.326     .3490326    1.418379
 North West  |   .7423909   .2598151    -0.85   0.395     .3738841    1.474105
 South East  |   1.144096   .3555892     0.43   0.665     .6221653     2.10387
 South West  |   1.020778   .3286903     0.06   0.949     .5430563    1.918748
West Midl..  |   .8222038   .2770449    -0.58   0.561     .4247796    1.591458
Yorkshire..  |   1.341935   .4049239     0.97   0.330     .7428213    2.424255
             |
 sgtf#region |
 VOC#London  |    .804283   .3189094    -0.55   0.583     .3697393    1.749533
        VOC #|
 North East  |   1.636335   .7664981     1.05   0.293      .653355    4.098219
        VOC #|
 North West  |   1.010226   .4899011     0.02   0.983     .3905129    2.613377
        VOC #|
 South East  |   .6834179   .3095663    -0.84   0.401     .2812674    1.660555
        VOC #|
 South West  |   .9391699   .4223669    -0.14   0.889     .3889902    2.267512
        VOC #|
West Midl..  |   1.468504   .6588085     0.86   0.392     .6095427    3.537903
        VOC #|
Yorkshire..  |   .5930025   .2649361    -1.17   0.242     .2470385     1.42347
             |
   agegroupA |
      0-<65  |   1.208135   .2383314     0.96   0.338     .8207241    1.778418
     75-<85  |   1.109992   .3332035     0.35   0.728     .6163133    1.999117
        85+  |   1.575087    .575147     1.24   0.213     .7699922    3.221981
             |
        male |
          M  |   .9817314   .1075235    -0.17   0.866     .7920733    1.216802
             |
         imd |
          2  |   1.116978   .1750778     0.71   0.480     .8215336    1.518672
          3  |   .8829402   .1480916    -0.74   0.458     .6355696     1.22659
          4  |   1.055101   .1675084     0.34   0.735     .7729596    1.440228
5 most de..  |   1.355943   .2496289     1.65   0.098     .9452248    1.945125
             |
        eth2 |
      Other  |   .9297719   .1398165    -0.48   0.628     .6924288    1.248469
    Missing  |   1.034132   .1343261     0.26   0.796     .8016984    1.333953
             |
smoke_nomi~2 |
     Former  |   1.195555   .1664698     1.28   0.200     .9100135    1.570693
             |
   obese4cat |
Obese I ..)  |     1.2359   .1807887     1.45   0.148     .9278308    1.646259
Obese II..)  |   1.095656   .1676854     0.60   0.551     .8117112    1.478928
Obese II..)  |   .9276499   .1398261    -0.50   0.618     .6903688    1.246485
             |
hh_total_cat |
        3-5  |   1.071712    .117587     0.63   0.528     .8643413    1.328835
       6-10  |          1  (empty)
             |
rural_urban5 |
Urban min..  |   1.396656   .3330896     1.40   0.161     .8751567    2.228914
Urban cit..  |   1.225397   .2639871     0.94   0.345      .803346     1.86918
Rural tow..  |   1.084324   .2384577     0.37   0.713      .704641    1.668591
Rural vil..  |   1.019134   .2065432     0.09   0.925     .6850497    1.516144
             |
  comorb_cat |
1 comorbi..  |   .9427807   .2237467    -0.25   0.804     .5921041    1.501147
2+ comorb..  |   .8844041   .1918322    -0.57   0.571     .5781231    1.352948
             |
  start_week |
23Nov-29Nov  |   .8967481   .1790383    -0.55   0.585     .6063532    1.326219
30Nov-06Dec  |   1.021119   .1989093     0.11   0.915     .6970534    1.495845
07Dec-13Dec  |   .9149899   .1835974    -0.44   0.658     .6174736    1.355858
14Dec-20Dec  |   1.069006   .2082667     0.34   0.732     .7297036    1.566078
21Dec-27Dec  |   .9710464   .2004029    -0.14   0.887     .6479932    1.455156
28Dec-04Jan  |   .9666051   .2193363    -0.15   0.881     .6195829    1.507991
             |
       _cons |   .0102023   .0045946   -10.18   0.000     .0042204    .0246626
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_regionX

. 
. * Test for interaction
. lrtest e_no_int e_regionX

Likelihood-ratio test                                 LR chi2(7)  =      8.24
(Assumption: e_no_int nested in e_regionX)            Prob > chi2 =    0.3119

. 
. * NHS region VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                    // East

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.06522   .3346627     0.20   0.841     .5754598    1.971802
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.region, eform  // East mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1o.sgtf#1b.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.06522   .3346627     0.20   0.841     .5754598    1.971802
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.region, eform  // London

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .856738   .2072494    -0.64   0.523     .5332587    1.376443
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.region, eform  // North E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.743056   .6058901     1.60   0.110     .8819252    3.445013
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.region, eform  // North W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.076113   .3975637     0.20   0.843     .5216585    2.219879
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.region, eform  // South E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7279901   .2374867    -0.97   0.330     .3841001    1.379769
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.region, eform  // South W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.000422    .322027     0.00   0.999       .53234    1.880085
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.region, eform  // West mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.564279   .5011048     1.40   0.163     .8349072    2.930826
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#8.region, eform  // Yorks & Hum

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#8.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6316778   .2006993    -1.45   0.148     .3388819    1.177451
------------------------------------------------------------------------------

. 
. * NHS region marginal risks
. margins sgtf, over(region)

Predictive margins                              Number of obs     =     22,265
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : region

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 region#sgtf |
East Midl.. #|
    non-VOC  |    .015358   .0034956     4.39   0.000     .0085067    .0222093
East Midl.. #|
        VOC  |   .0163596   .0035404     4.62   0.000     .0094206    .0232987
     London #|
    non-VOC  |   .0146043   .0023832     6.13   0.000     .0099333    .0192753
 London#VOC  |   .0125121    .002233     5.60   0.000     .0081355    .0168886
 North East #|
    non-VOC  |   .0107794   .0029735     3.63   0.000     .0049515    .0166073
 North East #|
        VOC  |   .0187891   .0039689     4.73   0.000     .0110101    .0265681
 North West #|
    non-VOC  |   .0113375   .0030124     3.76   0.000     .0054333    .0172417
 North West #|
        VOC  |   .0122004   .0031304     3.90   0.000     .0060648     .018336
 South East #|
    non-VOC  |   .0173554   .0036675     4.73   0.000     .0101673    .0245435
 South East #|
        VOC  |   .0126346   .0031384     4.03   0.000     .0064835    .0187857
 South West #|
    non-VOC  |   .0157667   .0035876     4.39   0.000     .0087351    .0227984
 South West #|
        VOC  |   .0157734   .0035894     4.39   0.000     .0087383    .0228084
West Midl.. #|
    non-VOC  |   .0125096   .0031074     4.03   0.000     .0064193       .0186
West Midl.. #|
        VOC  |   .0195685    .003955     4.95   0.000     .0118169    .0273202
Yorkshire.. #|
    non-VOC  |   .0205989   .0040774     5.05   0.000     .0126073    .0285905
Yorkshire.. #|
        VOC  |   .0130119   .0032315     4.03   0.000     .0066782    .0193456
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 age1 age2 age3, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -4010.1145  
Iteration 1:   log likelihood = -1896.8728  
Iteration 2:   log likelihood = -1893.4514  
Iteration 3:   log likelihood = -1893.4089  
Iteration 4:   log likelihood = -1893.4089  

Generalized linear models                         Number of obs   =     25,404
Optimization     : ML                             Residual df     =     25,392
                                                  Scale parameter =          1
Deviance         =  3786.817877                   (1/df) Deviance =   .1491343
Pearson          =  25402.25177                   (1/df) Pearson  =   1.000404

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1500086
Log likelihood   = -1893.408939                   BIC             =  -253755.7

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9794283   .1022226    -0.20   0.842     .7982392    1.201745
             |
  comorb_cat |
1 comorbi..  |   1.011471   .2333433     0.05   0.961     .6435518    1.589729
2+ comorb..  |   .9415738   .1994921    -0.28   0.776     .6215978    1.426262
             |
         imd |
          2  |   1.133935   .1702985     0.84   0.403      .844796    1.522036
          3  |   .8893295   .1433177    -0.73   0.467     .6484692    1.219652
          4  |   1.103056   .1663152     0.65   0.515     .8208355     1.48231
5 most de..  |   1.366526    .239272     1.78   0.075     .9695648    1.926013
             |
smoke_nomi~2 |
     Former  |   1.157126   .1521693     1.11   0.267     .8942154    1.497335
        age1 |   1.000807   .0112627     0.07   0.943     .9789743    1.023127
        age2 |   1.016538   .0365394     0.46   0.648     .9473865    1.090737
        age3 |   .9412412   .0951207    -0.60   0.549     .7721107     1.14742
       _cons |   .0117958   .0073904    -7.09   0.000     .0034548    .0402743
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     25,404
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0143977   .0010565    13.63   0.000      .012327    .0164684
        VOC  |   .0141015   .0010464    13.48   0.000     .0120506    .0161525
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =     25,404
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               comorb_cat       (asbalanced)
               imd              (asbalanced)
               smoke_nomiss2    (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |    .014473   .0015007     9.64   0.000     .0115316    .0174144
        VOC  |   .0141753    .001477     9.60   0.000     .0112803    .0170702
------------------------------------------------------------------------------

. 
. 
. * Age grouped
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 ib2.agegroupA, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -4010.3051  
Iteration 1:   log likelihood = -1897.3308  
Iteration 2:   log likelihood = -1894.0525  
Iteration 3:   log likelihood = -1894.0129  
Iteration 4:   log likelihood = -1894.0129  

Generalized linear models                         Number of obs   =     25,404
Optimization     : ML                             Residual df     =     25,392
                                                  Scale parameter =          1
Deviance         =  3788.025869                   (1/df) Deviance =   .1491819
Pearson          =  25400.20367                   (1/df) Pearson  =   1.000323

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1500561
Log likelihood   = -1894.012934                   BIC             =  -253754.4

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9791982    .102199    -0.20   0.840     .7980509    1.201464
             |
  comorb_cat |
1 comorbi..  |   1.014877   .2341402     0.06   0.949     .6457054    1.595117
2+ comorb..  |   .9423878   .1996706    -0.28   0.779     .6221274    1.427513
             |
         imd |
          2  |   1.135311   .1705158     0.84   0.398     .8458052     1.52391
          3  |   .8876165   .1430531    -0.74   0.459     .6472038    1.217334
          4  |   1.104283   .1665114     0.66   0.511     .8217319    1.483988
5 most de..  |   1.365308   .2390732     1.78   0.075     .9686805    1.924336
             |
smoke_nomi~2 |
     Former  |   1.154351   .1518156     1.09   0.275     .8920546    1.493773
             |
   agegroupA |
      0-<65  |   1.112045   .2026952     0.58   0.560     .7779859    1.589546
     75-<85  |   1.049591   .2954734     0.17   0.863     .6044998    1.822403
        85+  |   1.440074   .4970479     1.06   0.291     .7321314    2.832571
             |
       _cons |   .0113911   .0033856   -15.06   0.000     .0063618    .0203964
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     25,404
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0143994   .0010566    13.63   0.000     .0123284    .0164703
        VOC  |   .0140998   .0010463    13.48   0.000     .0120491    .0161506
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =     25,404
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               comorb_cat       (asbalanced)
               imd              (asbalanced)
               smoke_nomiss2    (asbalanced)
               agegroupA        (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0149278   .0020399     7.32   0.000     .0109296     .018926
        VOC  |   .0146173   .0019985     7.31   0.000     .0107002    .0185343
------------------------------------------------------------------------------

. 
. 
. * With region
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss2 ib2.agegroupA i.regio
> n, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -3652.3888  
Iteration 1:   log likelihood = -1753.6618  
Iteration 2:   log likelihood = -1749.6442  
Iteration 3:   log likelihood = -1749.5795  
Iteration 4:   log likelihood = -1749.5794  

Generalized linear models                         Number of obs   =     22,839
Optimization     : ML                             Residual df     =     22,820
                                                  Scale parameter =          1
Deviance         =  3499.158891                   (1/df) Deviance =   .1533374
Pearson          =  22861.46259                   (1/df) Pearson  =   1.001817

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1548736
Log likelihood   = -1749.579446                   BIC             =  -225527.5

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9802674   .1060184    -0.18   0.854     .7930215    1.211725
             |
  comorb_cat |
1 comorbi..  |   .9643136   .2284834    -0.15   0.878     .6060878    1.534267
2+ comorb..  |   .9188174   .1990153    -0.39   0.696     .6009793     1.40475
             |
         imd |
          2  |    1.06348   .1652097     0.40   0.692     .7843265    1.441989
          3  |   .8452193   .1406899    -1.01   0.312     .6099353    1.171265
          4  |   1.051392    .163339     0.32   0.747     .7754013    1.425618
5 most de..  |   1.303044   .2363729     1.46   0.145     .9131685    1.859378
             |
smoke_nomi~2 |
     Former  |   1.178125   .1616148     1.19   0.232     .9003763    1.541555
             |
   agegroupA |
      0-<65  |   1.139628   .2176244     0.68   0.494     .7838207     1.65695
     75-<85  |   1.100822   .3206041     0.33   0.742     .6220318    1.948146
        85+  |   1.631544   .5697449     1.40   0.161     .8229134     3.23477
             |
      region |
     London  |   .8654083    .170714    -0.73   0.464     .5879082    1.273892
 North East  |   .9249311    .212494    -0.34   0.734     .5895954    1.450991
 North West  |   .7946236   .1888503    -0.97   0.333     .4987293    1.266071
 South East  |   .9744424   .2176375    -0.12   0.908     .6289904    1.509622
 South West  |   1.028086   .2281094     0.12   0.901     .6655291    1.588153
West Midl..  |   1.030153   .2271562     0.13   0.893     .6686608    1.587077
Yorkshire..  |   1.080958   .2368573     0.36   0.722     .7035501    1.660819
             |
       _cons |   .0127011   .0043306   -12.81   0.000     .0065104    .0247783
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     22,839
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0149029   .0011343    13.14   0.000     .0126796    .0171261
        VOC  |   .0146088   .0011221    13.02   0.000     .0124096     .016808
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =     22,839
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               comorb_cat       (asbalanced)
               imd              (asbalanced)
               smoke_nomiss2    (asbalanced)
               agegroupA        (asbalanced)
               region           (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0158178   .0022247     7.11   0.000     .0114575    .0201782
        VOC  |   .0155057   .0021763     7.12   0.000     .0112403    .0197711
------------------------------------------------------------------------------

. 
. 
. /*
> **********************************
> /* Causal min subgroup analyses */
> **********************************
> 
> /* Causal min adjusted RR */
> 
> glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3, ///
>                         family(bin) link(log) eform
>                         
> est store e_no_int
> 
> * Constant VOC effect over subgroups
> lincom 1.sgtf, eform
> margins sgtf
> 
> 
> /* Age group */
> replace agegroupA=2 if agegroupA==1
> 
> glm risk_28 i.sgtf##i.agegroupA i.comorb_cat ib1.imd i.smoke_nomiss, ///
>                         family(bin) link(log) eform
>                         
> est store e_ageX
> 
> lrtest e_no_int e_ageX
> 
> * Age group VOC vs. non-VOC RR
> *lincom 1.sgtf, eform                                           // <50
> lincom 1.sgtf + 1.sgtf#2.agegroupA, eform       // 50-<65
> lincom 1.sgtf + 1.sgtf#3.agegroupA, eform       // 65-<75
> lincom 1.sgtf + 1.sgtf#4.agegroupA, eform       // 75-<85
> lincom 1.sgtf + 1.sgtf#5.agegroupA, eform       // 85+
> 
> * Age group marginal risks
> margins sgtf, over(agegroupA)
> 
> 
> /* Epi week */
> glm risk_28 i.sgtf i.start_week i.comorb_cat ib1.imd i.smoke_nomiss age1 age2
>  age3, ///
>                         family(bin) link(log) eform
>                         
> est store e_week
>                         
> glm risk_28 i.sgtf##i.start_week i.comorb_cat ib1.imd i.smoke_nomiss age1 age
> 2 age3, ///
>                         family(bin) link(log) eform
>                         
> est store e_weekX
> 
> * Test for interaction
> lrtest e_week e_weekX
> 
> * Epi week VOC vs. non-VOC RR
> lincom 1.sgtf, eform                                            // week 1
> lincom 1.sgtf + 1.sgtf#2.start_week, eform      // week 2
> lincom 1.sgtf + 1.sgtf#3.start_week, eform      // week 3
> lincom 1.sgtf + 1.sgtf#4.start_week, eform      // week 4
> capture lincom 1.sgtf + 1.sgtf#5.start_week, eform      // week 5
> capture lincom 1.sgtf + 1.sgtf#6.start_week, eform      // week 6
> capture lincom 1.sgtf + 1.sgtf#7.start_week, eform      // week 7
> 
> * Epi week marginal risks
> margins sgtf, over(start_week)
> 
> */
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_risk_models.log
  log type:  text
 closed on:  13 Feb 2021, 17:36:00
-------------------------------------------------------------------------------
