-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_risk_models.log
  log type:  text
 opened on:  12 Feb 2021, 16:50:12

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 12 Feb 2021)

. 
. noi di "SUBSETTING ON 28-DAY RISK POPULATION"
SUBSETTING ON 28-DAY RISK POPULATION

. keep if risk_pop==1
(45,312 observations deleted)

. 
. tab sgtf risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Exposure: |
      0=VOC; |    28-day outcome
   1=non-VOC |         0          1 |     Total
-------------+----------------------+----------
     non-VOC |    50,565        837 |    51,402 
             |     98.37       1.63 |    100.00 
-------------+----------------------+----------
         VOC |    50,209        818 |    51,027 
             |     98.40       1.60 |    100.00 
-------------+----------------------+----------
       Total |   100,774      1,655 |   102,429 
             |     98.38       1.62 |    100.00 

. 
. 
. *******************
. /* Unadjusted RR */
. *******************
. 
. glm risk_28 i.sgtf, family(bin) link(log) eform

Iteration 0:   log likelihood = -16978.743  
Iteration 1:   log likelihood = -8493.0741  
Iteration 2:   log likelihood = -8469.2249  
Iteration 3:   log likelihood = -8468.9911  
Iteration 4:   log likelihood = -8468.9911  

Generalized linear models                         Number of obs   =    102,429
Optimization     : ML                             Residual df     =    102,427
                                                  Scale parameter =          1
Deviance         =  16937.98218                   (1/df) Deviance =   .1653664
Pearson          =  102428.9989                   (1/df) Pearson  =    1.00002

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1654022
Log likelihood   =  -8468.99109                   BIC             =   -1164755

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9844821   .0480099    -0.32   0.748     .8947415    1.083223
       _cons |   .0162834   .0005582  -120.11   0.000     .0152252    .0174151
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. * Absolute risk
. margins sgtf

Adjusted predictions                            Number of obs     =    102,429
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0162834   .0005582    29.17   0.000     .0151893    .0173775
        VOC  |   .0160307    .000556    28.83   0.000      .014941    .0171205
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted RR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth5 household_size ///
>                         i.stp ib1.rural_urban5 ib1.start_week age1 age2 age3,
>  ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12844.402  
Iteration 1:   log likelihood = -6462.6291  
Iteration 2:   log likelihood = -6438.8701  
Iteration 3:   log likelihood = -6438.3239  
Iteration 4:   log likelihood = -6438.3237  

Generalized linear models                         Number of obs   =     76,921
Optimization     : ML                             Residual df     =     76,889
                                                  Scale parameter =          1
Deviance         =  12876.64738                   (1/df) Deviance =   .1674706
Pearson          =   76959.0468                   (1/df) Pearson  =   1.000911

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =    .168233
Log likelihood   = -6438.323689                   BIC             =  -852165.7

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9314885   .0519198    -1.27   0.203     .8350889    1.039016
             |
        male |
          M  |   .9896594   .0551277    -0.19   0.852     .8873004    1.103827
             |
         imd |
          2  |   1.193686   .0944857     2.24   0.025     1.022147    1.394012
          3  |   1.142228   .0915521     1.66   0.097     .9761742     1.33653
          4  |   1.007222   .0835053     0.09   0.931     .8561598    1.184937
5 most de..  |   1.038868   .1078173     0.37   0.713     .8476563    1.273213
             |
        eth5 |
South Asian  |   .9201414   .1234989    -0.62   0.535     .7073081    1.197018
      Black  |   .8482929   .1168111    -1.19   0.232     .6476409    1.111111
      Mixed  |   .9820117   .1276645    -0.14   0.889     .7611283    1.266997
      Other  |   1.162366   .1026583     1.70   0.088     .9776113    1.382037
             |
household_~e |   1.034553   .0277535     1.27   0.205      .981562    1.090404
             |
         stp |
          2  |   .8136867    .100675    -1.67   0.096     .6384701    1.036988
          3  |   .9582109   .1143404    -0.36   0.721     .7583851    1.210688
          4  |   1.126561   .1286627     1.04   0.297     .9006179    1.409189
          5  |   .7359194   .0943755    -2.39   0.017      .572362    .9462147
          6  |   .8749898   .1074955    -1.09   0.277      .687749    1.113207
          7  |   .8268585   .1027776    -1.53   0.126     .6480787    1.054957
          8  |   .8186528   .1017639    -1.61   0.107     .6416376    1.044503
          9  |   .8236842   .1021587    -1.56   0.118     .6459355    1.050346
         10  |   .9861573   .1167861    -0.12   0.906     .7818839    1.243799
             |
rural_urban5 |
Urban min..  |   .8919331    .116836    -0.87   0.383     .6899724    1.153009
Urban cit..  |   1.139592   .1236226     1.20   0.228     .9213212    1.409572
Rural tow..  |   1.058203   .1160287     0.52   0.606     .8535662    1.311899
Rural vil..  |   1.036675   .1044034     0.36   0.721     .8509783    1.262895
             |
  start_week |
23Nov-29Nov  |   1.211346   .1060299     2.19   0.028      1.02038    1.438052
30Nov-06Dec  |   1.249131   .1090866     2.55   0.011     1.052622    1.482325
07Dec-13Dec  |   1.145564   .1032873     1.51   0.132     .9600028    1.366992
14Dec-20Dec  |   1.084528   .1093937     0.80   0.421     .8899843    1.321598
             |
        age1 |   .9960447   .0057161    -0.69   0.490     .9849042    1.007311
        age2 |   1.009998   .0189745     0.53   0.596     .9734855    1.047881
        age3 |   .9761707   .0519341    -0.45   0.650     .8795089    1.083456
       _cons |   .0145894   .0026939   -22.89   0.000     .0101594    .0209512
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     76,921
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0170669    .000659    25.90   0.000     .0157753    .0183585
        VOC  |   .0158976   .0006389    24.88   0.000     .0146454    .0171499
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =     76,921
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0160308   .0009503    16.87   0.000     .0141682    .0178934
        VOC  |   .0149325   .0008991    16.61   0.000     .0131703    .0166947
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted RR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth5 ib1.hh_total_cat ///
>                         i.stp ib1.rural_urban5 ib1.start_week i.agegroup, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12565.046  
Iteration 1:   log likelihood = -6325.4851  
Iteration 2:   log likelihood = -6301.6337  
Iteration 3:   log likelihood =  -6301.053  
Iteration 4:   log likelihood = -6301.0527  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,157
                                                  Scale parameter =          1
Deviance         =   12602.1054                   (1/df) Deviance =   .1676771
Pearson          =  75239.51925                   (1/df) Pearson  =   1.001098

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1685787
Log likelihood   = -6301.052699                   BIC             =  -831247.7

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9265806   .0521869    -1.35   0.176     .8297395    1.034724
             |
        male |
          M  |   .9909179   .0557711    -0.16   0.871     .8874218    1.106484
             |
         imd |
          2  |   1.183761   .0948769     2.10   0.035     1.011676    1.385118
          3  |   1.138759   .0922556     1.60   0.109     .9715665    1.334723
          4  |   1.009927   .0844879     0.12   0.906     .8571968    1.189869
5 most de..  |   1.047829   .1093471     0.45   0.654     .8540093    1.285637
             |
        eth5 |
South Asian  |   .9220285   .1248389    -0.60   0.549     .7071232    1.202247
      Black  |   .8530428   .1185552    -1.14   0.253     .6496381    1.120135
      Mixed  |   .9674786    .127822    -0.25   0.802     .7467613    1.253433
      Other  |   1.157443   .1032888     1.64   0.101     .9717166    1.378669
             |
hh_total_cat |
        3-5  |   1.075654   .0607154     1.29   0.196     .9630007    1.201487
       6-10  |   1.965746   1.119451     1.19   0.235     .6438518    6.001624
             |
         stp |
          2  |   .8090757   .1003246    -1.71   0.088     .6345137    1.031662
          3  |    .911071   .1102276    -0.77   0.441     .7187338    1.154879
          4  |   1.098243   .1261591     0.82   0.415     .8768349    1.375558
          5  |   .7217173   .0930678    -2.53   0.011     .5605339    .9292494
          6  |   .8462777   .1049278    -1.35   0.178     .6637042    1.079074
          7  |   .8151172   .1017957    -1.64   0.102      .638143    1.041171
          8  |   .8150336   .1015408    -1.64   0.101     .6384528    1.040453
          9  |   .8257905   .1023998    -1.54   0.123     .6476183    1.052981
         10  |   .9529933   .1139125    -0.40   0.687     .7539537    1.204578
             |
rural_urban5 |
Urban min..  |   .8796796    .116014    -0.97   0.331     .6793073    1.139155
Urban cit..  |   1.115546   .1219068     1.00   0.317     .9004674    1.381995
Rural tow..  |   1.038719   .1145768     0.34   0.731     .8367685    1.289408
Rural vil..  |   1.023561   .1036253     0.23   0.818     .8393405    1.248215
             |
  start_week |
23Nov-29Nov  |   1.237006   .1094377     2.40   0.016     1.040078    1.471219
30Nov-06Dec  |   1.260786   .1115911     2.62   0.009     1.059991    1.499617
07Dec-13Dec  |   1.138286   .1043508     1.41   0.158     .9510839    1.362336
14Dec-20Dec  |   1.103193   .1124258     0.96   0.335     .9034536    1.347091
             |
    agegroup |
     18-<30  |   .9166063   .0878593    -0.91   0.364     .7596137    1.106045
     30-<40  |   1.047611   .1001747     0.49   0.627     .8685728    1.263553
     40-<50  |   1.008113   .0990536     0.08   0.934     .8315207    1.222208
     50-<60  |   .8568998   .0868975    -1.52   0.128     .7024418    1.045321
     60-<70  |   1.079447    .109569     0.75   0.451     .8847089     1.31705
     70-<80  |    .980661   .1121526    -0.17   0.864     .7837398     1.22706
        80+  |   .8772679   .1297183    -0.89   0.376     .6565508    1.172185
             |
       _cons |   .0151285   .0024312   -26.08   0.000      .011041    .0207293
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0171445    .000668    25.66   0.000     .0158352    .0184539
        VOC  |   .0158858   .0006459    24.59   0.000     .0146198    .0171517
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               hh_total_cat     (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               start_week       (asbalanced)
               agegroup         (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0197329   .0039137     5.04   0.000     .0120622    .0274036
        VOC  |   .0182841   .0036304     5.04   0.000     .0111687    .0253996
------------------------------------------------------------------------------

. 
. 
. 
. ***********************************************************
. /* Fully adjusted RR - age as spline, continuous hh size */
. ***********************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.obese4cat hou
> sehold_size ///
>                         i.stp ib1.rural_urban5 ib0.comorb_cat ib1.start_week 
> age1 age2 age3, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12843.651  
Iteration 1:   log likelihood = -6460.9008  
Iteration 2:   log likelihood = -6436.8146  
Iteration 3:   log likelihood = -6436.2399  
Iteration 4:   log likelihood = -6436.2396  

Generalized linear models                         Number of obs   =     76,921
Optimization     : ML                             Residual df     =     76,882
                                                  Scale parameter =          1
Deviance         =  12872.47923                   (1/df) Deviance =   .1674316
Pearson          =  76964.55888                   (1/df) Pearson  =   1.001074

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1683608
Log likelihood   = -6436.239613                   BIC             =  -852091.1

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9313261   .0519115    -1.28   0.202     .8349421    1.038837
             |
        male |
          M  |   .9896755   .0551307    -0.19   0.852     .8873111    1.103849
             |
         imd |
          2  |    1.19254   .0944031     2.22   0.026     1.021152    1.392692
          3  |   1.141931   .0915293     1.66   0.098     .9759177    1.336184
          4  |   1.005838   .0833924     0.07   0.944     .8549807    1.183314
5 most de..  |   1.039448   .1078777     0.37   0.709     .8481293    1.273924
             |
        eth5 |
South Asian  |   .9204972   .1235557    -0.62   0.537     .7075678    1.197504
      Black  |   .8492757   .1169483    -1.19   0.235     .6483883    1.112403
      Mixed  |   .9821995   .1276897    -0.14   0.890     .7612727    1.267241
      Other  |   1.162501   .1026691     1.70   0.088     .9777267    1.382195
             |
smoke_nomiss |
     Former  |   .8731094   .1866337    -0.63   0.526     .5742723    1.327454
    Current  |   1.025841   .0870575     0.30   0.764     .8686467    1.211482
             |
   obese4cat |
Obese I ..)  |   .9143992   .0719746    -1.14   0.256     .7836743     1.06693
Obese II..)  |   .8719522   .0696547    -1.72   0.086     .7455823    1.019741
Obese II..)  |   .9311678   .0675751    -0.98   0.326     .8077111    1.073495
             |
household_~e |   1.035171   .0277716     1.29   0.198     .9821462    1.091059
             |
         stp |
          2  |   .8127632    .100563    -1.68   0.094     .6377421    1.035817
          3  |   .9571002   .1142166    -0.37   0.713     .7574925    1.209307
          4  |   1.126606   .1286678     1.04   0.297     .9006537    1.409245
          5  |   .7357246   .0943551    -2.39   0.017     .5722034    .9459759
          6  |   .8743968   .1074211    -1.09   0.275     .6872853    1.112449
          7  |   .8265234   .1027357    -1.53   0.125     .6478166    1.054528
          8  |   .8182437   .1017147    -1.61   0.107     .6413144    1.043985
          9  |   .8232497    .102108    -1.57   0.117     .6455898      1.0498
         10  |    .985528   .1167129    -0.12   0.902      .781383    1.243008
             |
rural_urban5 |
Urban min..  |   .8913916   .1167689    -0.88   0.380     .6895479    1.152319
Urban cit..  |   1.139509   .1236136     1.20   0.229     .9212545     1.40947
Rural tow..  |    1.05902   .1161224     0.52   0.601     .8542191    1.312922
Rural vil..  |   1.036741    .104412     0.36   0.720     .8510285    1.262979
             |
  comorb_cat |
1 comorbi..  |   .9634674   .1198462    -0.30   0.765     .7550152    1.229471
2+ comorb..  |    .985533   .1113641    -0.13   0.897     .7897442    1.229861
             |
  start_week |
23Nov-29Nov  |   1.211879   .1060804     2.20   0.028     1.020823    1.438693
30Nov-06Dec  |   1.249449   .1091143     2.55   0.011     1.052891    1.482702
07Dec-13Dec  |   1.145773   .1033085     1.51   0.131     .9601745    1.367248
14Dec-20Dec  |   1.085414   .1094894     0.81   0.416     .8907006    1.322693
             |
        age1 |   .9960009   .0057151    -0.70   0.485     .9848622    1.007266
        age2 |   1.010118   .0189756     0.54   0.592     .9736025    1.048002
        age3 |   .9758487   .0519156    -0.46   0.646     .8792213    1.083096
       _cons |   .0157091   .0033747   -19.33   0.000     .0103108    .0239337
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     76,921
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0170685    .000659    25.90   0.000     .0157768    .0183602
        VOC  |   .0158963   .0006389    24.88   0.000     .0146441    .0171485
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =     76,921
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               smoke_nomiss     (asbalanced)
               obese4cat        (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0151884   .0014941    10.17   0.000       .01226    .0181169
        VOC  |   .0141454      .0014    10.10   0.000     .0114015    .0168893
------------------------------------------------------------------------------

. 
. 
. 
. **************************************************
. /* Fully adjusted RR - age grouped, cat hh size */
. **************************************************
. 
. glm risk_28 i.sgtf i.agegroup i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.ob
> ese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12564.065  
Iteration 1:   log likelihood =  -6323.268  
Iteration 2:   log likelihood = -6298.9982  
Iteration 3:   log likelihood = -6298.3792  
Iteration 4:   log likelihood = -6298.3789  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,150
                                                  Scale parameter =          1
Deviance         =  12596.75772                   (1/df) Deviance =   .1676215
Pearson          =   75261.0673                   (1/df) Pearson  =   1.001478

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1686937
Log likelihood   =  -6298.37886                   BIC             =  -831174.4

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9263411   .0521734    -1.36   0.174     .8295251    1.034457
             |
    agegroup |
     18-<30  |   .9156421   .0877678    -0.92   0.358     .7588132    1.104884
     30-<40  |   1.047085   .1001248     0.48   0.630     .8681363     1.26292
     40-<50  |   1.006765   .0989198     0.07   0.945     .8304115    1.220571
     50-<60  |   .8570575   .0869144    -1.52   0.128     .7025697    1.045516
     60-<70  |   1.079055   .1095295     0.75   0.454     .8843871    1.316573
     70-<80  |   .9792092   .1119869    -0.18   0.854     .7825788    1.225245
        80+  |   .8752891   .1294304    -0.90   0.368      .655063    1.169553
             |
        male |
          M  |   .9908712   .0557695    -0.16   0.871     .8873784    1.106434
             |
         imd |
          2  |   1.182231   .0947601     2.09   0.037     1.010359    1.383342
          3  |   1.138027   .0921964     1.60   0.110     .9709413    1.333865
          4  |   1.008223   .0843476     0.10   0.922     .8557471    1.187867
5 most de..  |   1.048457   .1094119     0.45   0.650     .8545218    1.286405
             |
        eth5 |
South Asian  |   .9220971   .1248562    -0.60   0.549     .7071637    1.202357
      Black  |   .8539885   .1186885    -1.14   0.256     .6503556    1.121381
      Mixed  |   .9676757   .1278471    -0.25   0.804     .7469147    1.253686
      Other  |   1.157705   .1033102     1.64   0.101     .9719394    1.378976
             |
smoke_nomiss |
     Former  |   .8907036   .1904019    -0.54   0.588     .5858353    1.354225
    Current  |   1.044087   .0889705     0.51   0.613     .8834917    1.233873
             |
   obese4cat |
Obese I ..)  |   .8870351   .0709487    -1.50   0.134     .7583299    1.037584
Obese II..)  |   .8667055   .0696717    -1.78   0.075     .7403654    1.014605
Obese II..)  |   .9079014   .0666971    -1.32   0.188     .7861526    1.048505
             |
hh_total_cat |
        3-5  |    1.07708    .060798     1.32   0.188     .9642735    1.203084
       6-10  |   1.971369    1.12257     1.19   0.233     .6457466    6.018297
             |
         stp |
          2  |   .8076208   .1001459    -1.72   0.085       .63337    1.029811
          3  |   .9093651   .1100288    -0.79   0.432     .7173763    1.152735
          4  |   1.098011   .1261324     0.81   0.416     .8766502    1.375268
          5  |   .7211417   .0929977    -2.54   0.011     .5600806    .9285189
          6  |   .8454571   .1048242    -1.35   0.176     .6630636    1.078023
          7  |   .8144787   .1017143    -1.64   0.100     .6376456    1.040351
          8  |   .8143519   .1014574    -1.65   0.099     .6379165    1.039586
          9  |   .8254277   .1023567    -1.55   0.122     .6473309    1.052524
         10  |   .9522713   .1138263    -0.41   0.682     .7533823    1.203666
             |
rural_urban5 |
Urban min..  |   .8790749   .1159368    -0.98   0.328     .6788364    1.138378
Urban cit..  |   1.115687   .1219212     1.00   0.316     .9005834    1.382168
Rural tow..  |    1.03969   .1146875     0.35   0.724     .8375458    1.290623
Rural vil..  |   1.023734    .103644     0.23   0.817     .8394807    1.248429
             |
  comorb_cat |
1 comorbi..  |   .9603481    .120953    -0.32   0.748     .7502783    1.229235
2+ comorb..  |   .9900036   .1132018    -0.09   0.930     .7912364    1.238703
             |
  start_week |
23Nov-29Nov  |   1.237965   .1095253     2.41   0.016      1.04088    1.472366
30Nov-06Dec  |   1.261414   .1116453     2.62   0.009     1.060521    1.500361
07Dec-13Dec  |   1.138722   .1043912     1.42   0.156     .9514475    1.362859
14Dec-20Dec  |   1.104736   .1125889     0.98   0.328     .9047079    1.348989
             |
       _cons |   .0164154   .0032046   -21.05   0.000     .0111965     .024067
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0171469   .0006681    25.66   0.000     .0158374    .0184564
        VOC  |   .0158839   .0006458    24.60   0.000     .0146181    .0171496
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               agegroup         (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               smoke_nomiss     (asbalanced)
               obese4cat        (asbalanced)
               hh_total_cat     (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |    .018786   .0040089     4.69   0.000     .0109287    .0266433
        VOC  |   .0174023   .0037172     4.68   0.000     .0101167    .0246879
------------------------------------------------------------------------------

. 
. 
. 
. ***********************
. /* Subgroup analyses */
. ***********************
. 
. /* Fully adjusted RR - age grouped, cat hh size */
. 
. glm risk_28 i.sgtf i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12564.756  
Iteration 1:   log likelihood = -6324.8902  
Iteration 2:   log likelihood = -6300.9314  
Iteration 3:   log likelihood = -6300.3378  
Iteration 4:   log likelihood = -6300.3375  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,153
                                                  Scale parameter =          1
Deviance         =  12600.67492                   (1/df) Deviance =    .167667
Pearson          =    75271.247                   (1/df) Pearson  =   1.001573

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =    .168666
Log likelihood   = -6300.337458                   BIC             =  -831204.2

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    .926168   .0521648    -1.36   0.173     .8293681    1.034266
             |
   agegroupA |
     50-<65  |   .9199807   .0693382    -1.11   0.268     .7936415    1.066432
     65-<75  |   1.068321   .0982842     0.72   0.473     .8920567    1.279415
     75-<85  |   .9349368   .1164253    -0.54   0.589     .7324606    1.193384
        85+  |   .8642378   .1709735    -0.74   0.461     .5864605    1.273585
             |
        male |
          M  |   .9918498   .0558226    -0.15   0.884      .888258    1.107523
             |
         imd |
          2  |    1.18187   .0947338     2.08   0.037     1.010046    1.382925
          3  |   1.137073   .0921192     1.59   0.113     .9701278    1.332748
          4  |   1.008411   .0843665     0.10   0.920     .8559013    1.188096
5 most de..  |   1.049043   .1094769     0.46   0.646     .8549933    1.287133
             |
        eth5 |
South Asian  |   .9216855   .1248026    -0.60   0.547      .706845    1.201825
      Black  |   .8529258    .118536    -1.14   0.252     .6495535    1.119973
      Mixed  |   .9663894   .1276712    -0.26   0.796     .7459309    1.252004
      Other  |   1.157594   .1033017     1.64   0.101      .971844    1.378847
             |
smoke_nomiss |
     Former  |   .8903769   .1903361    -0.54   0.587     .5856151    1.353741
    Current  |   1.043651   .0889336     0.50   0.616     .8831229    1.233359
             |
   obese4cat |
Obese I ..)  |    .886746   .0709276    -1.50   0.133     .7580794    1.037251
Obese II..)  |   .8669816   .0696921    -1.78   0.076     .7406044    1.014924
Obese II..)  |   .9086533    .066753    -1.30   0.192     .7868027    1.049375
             |
hh_total_cat |
        3-5  |   1.077025   .0607961     1.31   0.189     .9642222    1.203025
       6-10  |   1.965098   1.118973     1.19   0.235     .6437096    5.998995
             |
         stp |
          2  |   .8072215   .1000983    -1.73   0.084      .633054    1.029306
          3  |   .9093349   .1100269    -0.79   0.432     .7173497    1.152701
          4  |   1.097797   .1261093     0.81   0.417     .8764764    1.375003
          5  |   .7211306   .0929969    -2.54   0.011      .560071    .9285062
          6  |    .845058   .1047649    -1.36   0.174     .6627656     1.07749
          7  |   .8136905   .1016119    -1.65   0.099     .6370347    1.039335
          8  |   .8141426   .1014312    -1.65   0.099     .6377526    1.039319
          9  |   .8245238   .1022409    -1.56   0.120     .6466277    1.051362
         10  |    .950609   .1136236    -0.42   0.672     .7520733    1.201555
             |
rural_urban5 |
Urban min..  |   .8800221   .1160601    -0.97   0.332     .6795704    1.139601
Urban cit..  |   1.116827   .1220474     1.01   0.312     .9015014    1.383585
Rural tow..  |   1.041312   .1148648     0.37   0.714     .8388543    1.292632
Rural vil..  |   1.024971   .1037692     0.24   0.808     .8404949    1.249937
             |
  comorb_cat |
1 comorbi..  |   .9599996    .120908    -0.32   0.746     .7500077    1.228786
2+ comorb..  |   .9900424   .1132066    -0.09   0.930     .7912668    1.238753
             |
  start_week |
23Nov-29Nov  |   1.237941   .1095245     2.41   0.016     1.040858    1.472341
30Nov-06Dec  |   1.260389   .1115543     2.61   0.009     1.059661    1.499142
07Dec-13Dec  |   1.137632   .1042939     1.41   0.160     .9505322     1.36156
14Dec-20Dec  |   1.105322   .1126494     0.98   0.326     .9051865    1.349706
             |
       _cons |   .0162604   .0030709   -21.81   0.000     .0112299    .0235443
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_no_int

. 
. * Constant VOC effect over subgroups
. lincom 1.sgtf, eform

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .926168   .0521648    -1.36   0.173     .8293681    1.034266
------------------------------------------------------------------------------

. margins sgtf

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0171485   .0006682    25.66   0.000     .0158388    .0184582
        VOC  |   .0158824   .0006458    24.59   0.000     .0146167    .0171481
------------------------------------------------------------------------------

. 
. 
. /* Age group */
. glm risk_28 i.sgtf##i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.
> obese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood =  -12564.58  
Iteration 1:   log likelihood = -6324.4914  
Iteration 2:   log likelihood = -6300.4255  
Iteration 3:   log likelihood = -6299.8271  
Iteration 4:   log likelihood = -6299.8268  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,149
                                                  Scale parameter =          1
Deviance         =   12599.6535                   (1/df) Deviance =   .1676623
Pearson          =  75283.11285                   (1/df) Pearson  =   1.001785

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1687589
Log likelihood   = -6299.826752                   BIC             =  -831160.3

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9597339   .0677743    -0.58   0.561     .8356816    1.102201
             |
   agegroupA |
     50-<65  |   .9715788   .1001285    -0.28   0.780     .7938808    1.189052
     65-<75  |   1.096885   .1397827     0.73   0.468     .8544512    1.408104
     75-<85  |   1.016982    .171016     0.10   0.920     .7314336    1.414007
        85+  |   .8464726   .2367671    -0.60   0.551     .4892413    1.464545
             |
        sgtf#|
   agegroupA |
 VOC#50-<65  |   .8910526   .1346828    -0.76   0.445     .6625887    1.198292
 VOC#65-<75  |   .9466588    .174354    -0.30   0.766     .6598127    1.358208
 VOC#75-<85  |   .8360768   .2092635    -0.72   0.474      .511914    1.365511
    VOC#85+  |   1.042698   .4126018     0.11   0.916     .4801016    2.264561
             |
        male |
          M  |   .9912136   .0557902    -0.16   0.875     .8876824     1.10682
             |
         imd |
          2  |   1.182233   .0947634     2.09   0.037     1.010355    1.383351
          3  |   1.137028    .092116     1.59   0.113     .9700881    1.332695
          4  |    1.00817   .0843468     0.10   0.923     .8556959    1.187813
5 most de..  |   1.049298   .1095051     0.46   0.645     .8551987     1.28745
             |
        eth5 |
South Asian  |   .9214397   .1247695    -0.60   0.546     .7066562    1.201505
      Black  |   .8526066   .1184941    -1.15   0.251     .6493066     1.11956
      Mixed  |   .9664317   .1276795    -0.26   0.796     .7459594    1.252066
      Other  |   1.157625   .1033071     1.64   0.101     .9718655     1.37889
             |
smoke_nomiss |
     Former  |   .8892596   .1900995    -0.55   0.583     .5848774    1.352049
    Current  |   1.043516   .0889239     0.50   0.617     .8830055    1.233204
             |
   obese4cat |
Obese I ..)  |   .8866337   .0709202    -1.50   0.133     .7579808    1.037123
Obese II..)  |    .867438    .069731    -1.77   0.077     .7409905    1.015463
Obese II..)  |   .9085394   .0667463    -1.31   0.192     .7867013    1.049247
             |
hh_total_cat |
        3-5  |   1.077437   .0608218     1.32   0.186     .9645862     1.20349
       6-10  |   1.970317   1.121984     1.19   0.234     .6453939    6.015162
             |
         stp |
          2  |   .8072921   .1001139    -1.73   0.084     .6330988    1.029414
          3  |   .9094371   .1100434    -0.78   0.433     .7174239    1.152841
          4  |   1.097384   .1260639     0.81   0.419      .876144    1.374491
          5  |   .7213569    .093027    -2.53   0.011     .5602453    .9287999
          6  |   .8450366   .1047618    -1.36   0.174     .6627495    1.077461
          7  |   .8140503   .1016573    -1.65   0.099     .6373155    1.039796
          8  |   .8138286   .1013942    -1.65   0.098     .6375034    1.038923
          9  |   .8243312   .1022194    -1.56   0.119     .6464728    1.051122
         10  |   .9506897   .1136396    -0.42   0.672     .7521273    1.201673
             |
rural_urban5 |
Urban min..  |   .8797439   .1160274    -0.97   0.331     .6793495    1.139251
Urban cit..  |   1.116601   .1220235     1.01   0.313     .9013168    1.383306
Rural tow..  |    1.04077   .1148063     0.36   0.717     .8384164    1.291963
Rural vil..  |   1.024881   .1037597     0.24   0.808     .8404214    1.249826
             |
  comorb_cat |
1 comorbi..  |   .9603918   .1209586    -0.32   0.748     .7503123    1.229291
2+ comorb..  |   .9899541   .1131971    -0.09   0.930     .7911954    1.238644
             |
  start_week |
23Nov-29Nov  |   1.237371   .1094752     2.41   0.016     1.040376    1.471665
30Nov-06Dec  |   1.259745   .1115013     2.61   0.009     1.059112    1.498385
07Dec-13Dec  |   1.137197   .1042566     1.40   0.161     .9501641    1.361045
14Dec-20Dec  |   1.104384   .1125596     0.97   0.330     .9044089    1.348575
             |
       _cons |   .0159954   .0030386   -21.77   0.000     .0110229     .023211
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_ageX

. 
. lrtest e_no_int e_ageX

Likelihood-ratio test                                 LR chi2(4)  =      1.02
(Assumption: e_no_int nested in e_ageX)               Prob > chi2 =    0.9065

. 
. * Age group VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // <50

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9597339   .0677743    -0.58   0.561     .8356816    1.102201
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.agegroupA, eform       // 50-<65

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8551734   .1142815    -1.17   0.242     .6581175    1.111232
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.agegroupA, eform       // 65-<75

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9085405   .1545487    -0.56   0.573     .6509526    1.268058
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.agegroupA, eform       // 75-<85

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8024112   .1926724    -0.92   0.359     .5011979     1.28465
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.agegroupA, eform       // 85+

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.000713   .3896315     0.00   0.999      .466542    2.146486
------------------------------------------------------------------------------

. 
. * Age group marginal risks
. margins sgtf, over(agegroupA)

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : agegroupA

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   agegroupA#|
        sgtf |
      0-<50 #|
    non-VOC  |   .0171375    .000844    20.30   0.000     .0154832    .0187918
  0-<50#VOC  |   .0164474   .0008322    19.76   0.000     .0148163    .0180785
     50-<65 #|
    non-VOC  |   .0165777   .0015004    11.05   0.000     .0136369    .0195185
 50-<65#VOC  |   .0141768   .0013935    10.17   0.000     .0114456     .016908
     65-<75 #|
    non-VOC  |   .0187987   .0022094     8.51   0.000     .0144684     .023129
 65-<75#VOC  |   .0170794   .0020998     8.13   0.000     .0129638     .021195
     75-<85 #|
    non-VOC  |   .0174051   .0027982     6.22   0.000     .0119208    .0228894
 75-<85#VOC  |    .013966   .0024903     5.61   0.000     .0090851     .018847
85+#non-VOC  |   .0144914   .0039896     3.63   0.000     .0066719    .0223109
    85+#VOC  |   .0145017   .0039917     3.63   0.000     .0066781    .0223254
------------------------------------------------------------------------------

. 
. 
. /* Ethnicity */
. *Figure out missings first
. 
. 
. /* Comorbidities */
. glm risk_28 i.sgtf##ib0.comorb_cat i.agegroupA i.male ib1.imd ib1.eth5 ib1.sm
> oke_nomiss ib1.obese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib1.start_wee
> k, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12564.701  
Iteration 1:   log likelihood = -6324.7846  
Iteration 2:   log likelihood = -6300.8012  
Iteration 3:   log likelihood = -6300.2053  
Iteration 4:   log likelihood =  -6300.205  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,151
                                                  Scale parameter =          1
Deviance         =     12600.41                   (1/df) Deviance =   .1676679
Pearson          =  75276.78961                   (1/df) Pearson  =   1.001674

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1687157
Log likelihood   =    -6300.205                   BIC             =    -831182

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .8366246   .1840858    -0.81   0.418     .5435474    1.287727
             |
  comorb_cat |
1 comorbi..  |    .921778   .1575261    -0.48   0.634     .6594188    1.288521
2+ comorb..  |   .9385818   .1451361    -0.41   0.682      .693183    1.270856
             |
        sgtf#|
  comorb_cat |
        VOC #|
1 comorbi..  |   1.092048    .276151     0.35   0.728     .6652652    1.792623
        VOC #|
2+ comorb..  |   1.121497    .257609     0.50   0.618     .7149506    1.759219
             |
   agegroupA |
     50-<65  |   .9199525   .0693371    -1.11   0.268     .7936153    1.066402
     65-<75  |     1.0685    .098302     0.72   0.471     .8922037    1.279632
     75-<85  |   .9351601   .1164538    -0.54   0.590     .7326345    1.193671
        85+  |   .8641081    .170948    -0.74   0.460     .5863723    1.273394
             |
        male |
          M  |   .9918126   .0558207    -0.15   0.884     .8882245    1.107482
             |
         imd |
          2  |   1.181626    .094715     2.08   0.037     1.009836    1.382641
          3  |   1.136919   .0921084     1.58   0.113     .9699934    1.332571
          4  |     1.0081   .0843432     0.10   0.923     .8556323    1.187735
5 most de..  |    1.04874   .1094474     0.46   0.648     .8547438    1.286768
             |
        eth5 |
South Asian  |   .9217572   .1248122    -0.60   0.547     .7069001    1.201919
      Black  |   .8533524   .1185984    -1.14   0.254     .6498737    1.120541
      Mixed  |   .9664894   .1276843    -0.26   0.796     .7460083    1.252133
      Other  |   1.157718   .1033126     1.64   0.101     .9719486    1.378995
             |
smoke_nomiss |
     Former  |   .8899427   .1902442    -0.55   0.585     .5853283    1.353083
    Current  |    1.04373   .0889404     0.50   0.615     .8831893    1.233452
             |
   obese4cat |
Obese I ..)  |   .8866124   .0709178    -1.50   0.132     .7579637    1.037097
Obese II..)  |   .8670502   .0696978    -1.77   0.076     .7406625    1.015005
Obese II..)  |   .9085939   .0667489    -1.30   0.192     .7867508    1.049307
             |
hh_total_cat |
        3-5  |   1.076854   .0607881     1.31   0.190     .9640655    1.202837
       6-10  |   1.964599   1.118742     1.19   0.236      .643512    5.997787
             |
         stp |
          2  |   .8069313   .1000648    -1.73   0.084     .6328227    1.028943
          3  |   .9092288   .1100151    -0.79   0.432     .7172645    1.152569
          4  |   1.097478    .126076     0.81   0.418     .8762167    1.374612
          5  |   .7209057   .0929707    -2.54   0.011     .5598921    .9282237
          6  |   .8449685   .1047559    -1.36   0.174     .6626922    1.077381
          7  |   .8134126   .1015795    -1.65   0.098     .6368136    1.038985
          8  |   .8138475   .1013957    -1.65   0.098     .6375195    1.038945
          9  |   .8242716   .1022124    -1.56   0.119     .6464255    1.051047
         10  |   .9502703    .113592    -0.43   0.670     .7517916    1.201149
             |
rural_urban5 |
Urban min..  |   .8801864   .1160823    -0.97   0.333     .6796965    1.139815
Urban cit..  |   1.117155   .1220848     1.01   0.311     .9017634    1.383995
Rural tow..  |   1.041891   .1149345     0.37   0.710     .8393116    1.293365
Rural vil..  |   1.025459   .1038233     0.25   0.804     .8408878    1.250544
             |
  start_week |
23Nov-29Nov  |    1.23785   .1095173     2.41   0.016      1.04078    1.472235
30Nov-06Dec  |    1.26014    .111533     2.61   0.009      1.05945    1.498847
07Dec-13Dec  |   1.137546   .1042902     1.41   0.160     .9504532    1.361467
14Dec-20Dec  |   1.105094   .1126299     0.98   0.327     .9049937    1.349437
             |
       _cons |   .0170487   .0036113   -19.22   0.000     .0112561    .0258223
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_comorbX

. 
. * Test for interaction
. lrtest e_no_int e_comorbX

Likelihood-ratio test                                 LR chi2(2)  =      0.26
(Assumption: e_no_int nested in e_comorbX)            Prob > chi2 =    0.8759

. 
. * Comorbidities VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // no comorbs

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8366246   .1840858    -0.81   0.418     .5435474    1.287727
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.comorb_cat, eform      // 1 comorb

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#1.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9136344   .1138601    -0.72   0.469     .7156373    1.166412
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.comorb_cat, eform      // 2+ comorbs

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9382717   .0618523    -0.97   0.334     .8245484     1.06768
------------------------------------------------------------------------------

. 
. * Comorbidity marginal risks
. margins sgtf, over(comorb_cat)

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : comorb_cat

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  comorb_cat#|
        sgtf |
No comorb.. #|
    non-VOC  |   .0182421   .0026937     6.77   0.000     .0129627    .0235216
No comorb.. #|
        VOC  |   .0152618   .0024892     6.13   0.000     .0103831    .0201405
1 comorbi.. #|
    non-VOC  |   .0168561    .001449    11.63   0.000     .0140161    .0196961
1 comorbi.. #|
        VOC  |   .0154003    .001389    11.09   0.000     .0126779    .0181227
2+ comorb.. #|
    non-VOC  |   .0171345   .0007842    21.85   0.000     .0155976    .0186715
2+ comorb.. #|
        VOC  |   .0160768   .0007626    21.08   0.000     .0145821    .0175716
------------------------------------------------------------------------------

. 
. 
. /* IMD */
. glm risk_28 i.sgtf##ib1.imd i.agegroup i.male ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12563.728  
Iteration 1:   log likelihood = -6322.4406  
Iteration 2:   log likelihood =  -6298.043  
Iteration 3:   log likelihood = -6297.4109  
Iteration 4:   log likelihood = -6297.4106  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,146
                                                  Scale parameter =          1
Deviance         =  12594.82111                   (1/df) Deviance =   .1676047
Pearson          =  75244.65685                   (1/df) Pearson  =   1.001313

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1687744
Log likelihood   = -6297.410554                   BIC             =  -831131.4

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.017388   .1082222     0.16   0.871     .8259282    1.253231
             |
         imd |
          2  |   1.270238   .1411074     2.15   0.031     1.021709     1.57922
          3  |   1.202458   .1362682     1.63   0.104     .9629585    1.501523
          4  |   1.106205   .1270205     0.88   0.379     .8832755      1.3854
5 most de..  |   1.045535   .1551462     0.30   0.764     .7816806    1.398452
             |
    sgtf#imd |
      VOC#2  |    .861072   .1382235    -0.93   0.351     .6286377    1.179447
      VOC#3  |   .8926655   .1447018    -0.70   0.484     .6496931    1.226505
      VOC#4  |   .8218572   .1379551    -1.17   0.242     .5914466    1.142029
        VOC #|
5 most de..  |   1.003649   .2095096     0.02   0.986     .6666461    1.511014
             |
    agegroup |
     18-<30  |    .914389   .0876517    -0.93   0.350     .7577681    1.103381
     30-<40  |   1.046044   .1000274     0.47   0.638     .8672697    1.261669
     40-<50  |   1.006077    .098854     0.06   0.951     .8298411    1.219741
     50-<60  |   .8563072   .0868404    -1.53   0.126     .7019512    1.044605
     60-<70  |   1.078752    .109498     0.75   0.455     .8841403    1.316202
     70-<80  |     .97787   .1118393    -0.20   0.845     .7814999    1.223583
        80+  |   .8744577   .1293132    -0.91   0.364     .6544323    1.168458
             |
        male |
          M  |   .9905614   .0557524    -0.17   0.866     .8871002    1.106089
             |
        eth5 |
South Asian  |   .9225794   .1249208    -0.60   0.552     .7075348    1.202984
      Black  |   .8541133   .1187056    -1.13   0.257      .650451    1.121544
      Mixed  |   .9675597   .1278372    -0.25   0.803      .746817    1.253549
      Other  |   1.158293   .1033656     1.65   0.100      .972428    1.379683
             |
smoke_nomiss |
     Former  |   .8914337   .1905602    -0.54   0.591     .5863126    1.355342
    Current  |   1.043556   .0889306     0.50   0.617     .8830334    1.233258
             |
   obese4cat |
Obese I ..)  |    .886541   .0709097    -1.51   0.132     .7579068    1.037007
Obese II..)  |   .8664324   .0696492    -1.78   0.075     .7401331    1.014284
Obese II..)  |   .9070272   .0666366    -1.33   0.184     .7853894    1.047504
             |
hh_total_cat |
        3-5  |   1.076906   .0607878     1.31   0.189      .964118    1.202888
       6-10  |   1.971729   1.122842     1.19   0.233     .6458225    6.019792
             |
         stp |
          2  |   .8076736   .1001579    -1.72   0.085     .6334031    1.029892
          3  |   .9084507   .1099258    -0.79   0.427     .7166431    1.151595
          4  |   1.099007   .1262509     0.82   0.411     .8774382    1.376525
          5  |   .7212283   .0930107    -2.53   0.011      .560145     .928635
          6  |   .8451733   .1047906    -1.36   0.175     .6628385    1.077665
          7  |    .814398   .1017066    -1.64   0.100     .6375788    1.040254
          8  |   .8137665   .1013883    -1.65   0.098     .6374519    1.038848
          9  |   .8258707   .1024133    -1.54   0.123     .6476757    1.053093
         10  |   .9523996   .1138455    -0.41   0.683     .7534778    1.203838
             |
rural_urban5 |
Urban min..  |   .8779048   .1157909    -0.99   0.324     .6779201    1.136884
Urban cit..  |   1.114851   .1218325     0.99   0.320     .8999042    1.381139
Rural tow..  |   1.038708   .1145811     0.34   0.731     .8367519    1.289409
Rural vil..  |   1.022705   .1035413     0.22   0.825     .8386342    1.247177
             |
  comorb_cat |
1 comorbi..  |    .960565   .1209824    -0.32   0.749     .7504445    1.229518
2+ comorb..  |   .9907345   .1132862    -0.08   0.935     .7918192     1.23962
             |
  start_week |
23Nov-29Nov  |   1.237978   .1095313     2.41   0.016     1.040883    1.472393
30Nov-06Dec  |   1.261373   .1116409     2.62   0.009     1.060488    1.500311
07Dec-13Dec  |   1.138522   .1043761     1.42   0.157     .9512752    1.362627
14Dec-20Dec  |   1.104736   .1125891     0.98   0.328     .9047079     1.34899
             |
       _cons |   .0157113   .0031512   -20.71   0.000     .0106044    .0232776
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_imdX

. 
. * Test for interaction
. lrtest e_no_int e_imdX

Likelihood-ratio test                                 LR chi2(7)  =      5.85
(Assumption: e_no_int nested in e_imdX)               Prob > chi2 =    0.5569

. 
. * IMD VOC vs. non-VOC RR
. lincom 1.sgtf, eform                            // 1 least deprived

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.017388   .1082222     0.16   0.871     .8259282    1.253231
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.imd, eform     // 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8760447   .1053259    -1.10   0.271     .6921293    1.108831
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.imd, eform     // 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9081875   .1110663    -0.79   0.431     .7146252    1.154178
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.imd, eform     // 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8361479   .1085731    -1.38   0.168     .6482691    1.078477
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.imd, eform     // 5 most deprived

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.021101   .1834055     0.12   0.907     .7180914     1.45197
------------------------------------------------------------------------------

. 
. * Epi week marginal risks
. margins sgtf, over(imd)

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : imd

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    imd#sgtf |
1 least d.. #|
    non-VOC  |   .0153202    .001149    13.33   0.000     .0130683    .0175721
1 least d.. #|
        VOC  |   .0155866   .0011755    13.26   0.000     .0132826    .0178905
  2#non-VOC  |   .0194475   .0015934    12.20   0.000     .0163244    .0225706
      2#VOC  |   .0170369   .0014985    11.37   0.000     .0140999    .0199739
  3#non-VOC  |   .0184039   .0015631    11.77   0.000     .0153402    .0214675
      3#VOC  |   .0167142   .0014703    11.37   0.000     .0138324     .019596
  4#non-VOC  |   .0169422    .001473    11.50   0.000     .0140552    .0198292
      4#VOC  |   .0141662   .0013659    10.37   0.000      .011489    .0168433
5 most de.. #|
    non-VOC  |   .0159578   .0020431     7.81   0.000     .0119534    .0199623
5 most de.. #|
        VOC  |   .0162946   .0020521     7.94   0.000     .0122725    .0203167
------------------------------------------------------------------------------

. 
. 
. 
. /* Epi week */
. glm risk_28 i.sgtf##ib1.start_week i.agegroupA i.male ib1.imd ib1.eth5 ib1.sm
> oke_nomiss ib1.obese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12563.961  
Iteration 1:   log likelihood = -6323.0392  
Iteration 2:   log likelihood = -6298.7923  
Iteration 3:   log likelihood =  -6298.166  
Iteration 4:   log likelihood = -6298.1657  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,149
                                                  Scale parameter =          1
Deviance         =   12596.3313                   (1/df) Deviance =   .1676181
Pearson          =   75266.2702                   (1/df) Pearson  =   1.001561

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1687147
Log likelihood   = -6298.165651                   BIC             =  -831163.6

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    .955294   .1291103    -0.34   0.735      .732985    1.245028
             |
  start_week |
23Nov-29Nov  |   1.342112   .1623947     2.43   0.015     1.058751    1.701311
30Nov-06Dec  |    1.21594   .1514323     1.57   0.116     .9525861    1.552102
07Dec-13Dec  |   1.206696   .1526139     1.49   0.137     .9417689     1.54615
14Dec-20Dec  |   1.027041   .1494909     0.18   0.855     .7721318    1.366106
             |
        sgtf#|
  start_week |
        VOC #|
23Nov-29Nov  |   .8383065   .1488839    -0.99   0.321     .5918732    1.187345
        VOC #|
30Nov-06Dec  |   1.074693   .1903132     0.41   0.684     .7595365    1.520619
        VOC #|
07Dec-13Dec  |   .8832598   .1622299    -0.68   0.499     .6162356     1.26599
        VOC #|
14Dec-20Dec  |   1.155168   .2356895     0.71   0.480     .7744155    1.723123
             |
   agegroupA |
     50-<65  |   .9209036   .0694102    -1.09   0.274     .7944334    1.067507
     65-<75  |   1.068445   .0982939     0.72   0.472     .8921631    1.279559
     75-<85  |   .9346579   .1163881    -0.54   0.587      .732246    1.193022
        85+  |   .8655268   .1712331    -0.73   0.465      .587329    1.275498
             |
        male |
          M  |   .9917118    .055814    -0.15   0.882      .888136    1.107367
             |
         imd |
          2  |    1.18164    .094712     2.08   0.037     1.009855    1.382648
          3  |   1.138769    .092259     1.60   0.109     .9715702    1.334741
          4  |   1.008549   .0843753     0.10   0.919     .8560231    1.188252
5 most de..  |   1.050076   .1095842     0.47   0.640     .8558366      1.2884
             |
        eth5 |
South Asian  |   .9213419   .1247555    -0.61   0.545     .7065823    1.201376
      Black  |   .8525152   .1184784    -1.15   0.251     .6492416    1.119433
      Mixed  |   .9662525   .1276518    -0.26   0.795     .7458272    1.251823
      Other  |   1.157453   .1032887     1.64   0.101     .9717261    1.378678
             |
smoke_nomiss |
     Former  |   .8880829   .1898431    -0.56   0.579     .5841097    1.350245
    Current  |   1.043757   .0889407     0.50   0.615      .883216     1.23348
             |
   obese4cat |
Obese I ..)  |    .886508   .0709065    -1.51   0.132     .7578794    1.036968
Obese II..)  |   .8665665   .0696574    -1.78   0.075      .740252    1.014435
Obese II..)  |   .9085988   .0667502    -1.30   0.192     .7867535    1.049314
             |
hh_total_cat |
        3-5  |    1.07758   .0608271     1.32   0.186      .964719    1.203643
       6-10  |   1.960993   1.116657     1.18   0.237     .6423513     5.98659
             |
         stp |
          2  |   .8076075   .1001449    -1.72   0.085     .6333586    1.029796
          3  |   .9095445   .1100564    -0.78   0.433     .7175086    1.152977
          4  |   1.098757   .1262225     0.82   0.412     .8772389    1.376213
          5  |   .7219994   .0931093    -2.53   0.012     .5607452    .9296255
          6  |   .8462599   .1049182    -1.35   0.178     .6637016    1.079033
          7  |   .8139082   .1016367    -1.65   0.099     .6372087    1.039607
          8  |   .8144461   .1014666    -1.65   0.099     .6379941      1.0397
          9  |   .8257397   .1023912    -1.54   0.123     .6475819    1.052911
         10  |   .9503158   .1135905    -0.43   0.670     .7518383    1.201189
             |
rural_urban5 |
Urban min..  |   .8793763   .1159753    -0.97   0.330     .6790712    1.138765
Urban cit..  |   1.116408    .122001     1.01   0.314     .9011636    1.383064
Rural tow..  |     1.0406   .1147863     0.36   0.718     .8382809    1.291748
Rural vil..  |   1.024352   .1037054     0.24   0.812     .8399885    1.249179
             |
  comorb_cat |
1 comorbi..  |   .9599618   .1209051    -0.32   0.746     .7499752    1.228743
2+ comorb..  |   .9894228    .113134    -0.09   0.926     .7907744    1.237973
             |
       _cons |   .0160169   .0031769   -20.84   0.000      .010858     .023627
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_weekX

. 
. * Test for interaction
. lrtest e_no_int e_weekX

Likelihood-ratio test                                 LR chi2(4)  =      4.34
(Assumption: e_no_int nested in e_weekX)              Prob > chi2 =    0.3615

. 
. * Epi week VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // week 1

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .955294   .1291103    -0.34   0.735      .732985    1.245028
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.start_week, eform      // week 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8008291   .0922822    -1.93   0.054     .6389298    1.003752
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.start_week, eform      // week 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.026648   .1174642     0.23   0.818     .8204104    1.284731
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.start_week, eform      // week 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8437728   .1049384    -1.37   0.172     .6612463    1.076683
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.start_week, eform      // week 5

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.103525   .1686662     0.64   0.519     .8178655    1.488958
------------------------------------------------------------------------------

. capture lincom 1.sgtf + 1.sgtf#6.start_week, eform      // week 6

. capture lincom 1.sgtf + 1.sgtf#7.start_week, eform      // week 7

. 
. * Epi week marginal risks
. margins sgtf, over(start_week)

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : start_week

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  start_week#|
        sgtf |
16Nov-22Nov #|
    non-VOC  |   .0146307   .0013783    10.62   0.000     .0119293     .017332
16Nov-22Nov #|
        VOC  |   .0139766   .0013542    10.32   0.000     .0113224    .0166307
23Nov-29Nov #|
    non-VOC  |   .0196561   .0014924    13.17   0.000     .0167311    .0225811
23Nov-29Nov #|
        VOC  |   .0157412   .0013642    11.54   0.000     .0130674    .0184149
30Nov-06Dec #|
    non-VOC  |   .0177749   .0014477    12.28   0.000     .0149375    .0206122
30Nov-06Dec #|
        VOC  |   .0182485   .0014662    12.45   0.000     .0153748    .0211222
07Dec-13Dec #|
    non-VOC  |   .0176637   .0014901    11.85   0.000     .0147432    .0205842
07Dec-13Dec #|
        VOC  |   .0149041   .0013616    10.95   0.000     .0122355    .0175728
14Dec-20Dec #|
    non-VOC  |   .0149635   .0016601     9.01   0.000     .0117097    .0182174
14Dec-20Dec #|
        VOC  |   .0165126   .0017355     9.51   0.000     .0131111    .0199142
------------------------------------------------------------------------------

. 
. 
. /* NHS region */
. /* No STP adjustment for these models */
. 
. glm risk_28 i.sgtf i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week i.region, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12567.573  
Iteration 1:   log likelihood = -6331.0107  
Iteration 2:   log likelihood = -6308.1861  
Iteration 3:   log likelihood = -6307.7046  
Iteration 4:   log likelihood = -6307.7044  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,154
                                                  Scale parameter =          1
Deviance         =  12615.40878                   (1/df) Deviance =   .1678608
Pearson          =  75137.57341                   (1/df) Pearson  =   .9997814

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1688354
Log likelihood   = -6307.704389                   BIC             =  -831200.7

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .9275549   .0522502    -1.34   0.182     .8305973    1.035831
             |
   agegroupA |
     50-<65  |   .9198041   .0693343    -1.11   0.267     .7934732    1.066248
     65-<75  |    1.06751   .0982213     0.71   0.478     .8913603    1.278471
     75-<85  |   .9345638   .1163921    -0.54   0.587      .732148    1.192941
        85+  |   .8630564   .1707615    -0.74   0.457     .5856299    1.271906
             |
        male |
          M  |   .9908526    .055771    -0.16   0.870     .8873572    1.106419
             |
         imd |
          2  |   1.181507   .0947177     2.08   0.037     1.009714     1.38253
          3  |   1.134544   .0919264     1.56   0.119     .9679495    1.329811
          4  |   1.007373    .084287     0.09   0.930     .8550085     1.18689
5 most de..  |    1.04921   .1095172     0.46   0.645     .8550936    1.287394
             |
        eth5 |
South Asian  |   .9204624   .1246423    -0.61   0.541      .705899    1.200244
      Black  |   .8516617   .1183722    -1.16   0.248      .648573    1.118344
      Mixed  |   .9692073   .1280532    -0.24   0.813     .7480913    1.255679
      Other  |   1.153976   .1029912     1.60   0.109     .9687862    1.374566
             |
smoke_nomiss |
     Former  |   .8886422   .1899708    -0.55   0.581     .5844672     1.35112
    Current  |   1.043503   .0889317     0.50   0.617     .8829801    1.233209
             |
   obese4cat |
Obese I ..)  |   .8874028   .0709842    -1.49   0.135     .7586342    1.038028
Obese II..)  |   .8675646   .0697475    -1.77   0.077     .7410881    1.015626
Obese II..)  |   .9101565   .0668658    -1.28   0.200     .7881002    1.051116
             |
hh_total_cat |
        3-5  |   1.077279    .060816     1.32   0.187     .9644399    1.203321
       6-10  |   1.987877   1.132237     1.21   0.228     .6509835    6.070287
             |
rural_urban5 |
Urban min..  |   .8784375   .1158635    -0.98   0.326      .678328     1.13758
Urban cit..  |   1.116497   .1220253     1.01   0.313     .9012126     1.38321
Rural tow..  |   1.041353   .1148871     0.37   0.713     .8388593    1.292726
Rural vil..  |   1.024511   .1037342     0.24   0.811     .8400986    1.249404
             |
  comorb_cat |
1 comorbi..  |   .9617795   .1211391    -0.31   0.757     .7513876    1.231082
2+ comorb..  |   .9903175    .113249    -0.09   0.932     .7914696    1.239124
             |
  start_week |
23Nov-29Nov  |   1.237981   .1095309     2.41   0.016     1.040887    1.472395
30Nov-06Dec  |   1.259953   .1115301     2.61   0.009      1.05927    1.498657
07Dec-13Dec  |    1.13737   .1042767     1.40   0.160     .9503022    1.361263
14Dec-20Dec  |   1.102579   .1123762     0.96   0.338     .9029302    1.346372
             |
      region |
East Midl..  |   1.028135   .1339507     0.21   0.831     .7964366    1.327239
     London  |   1.118494   .1244002     1.01   0.314     .8994192     1.39093
 North East  |   1.182573   .1480625     1.34   0.180       .92524    1.511477
 North West  |   1.013864   .1320845     0.11   0.916     .7853923    1.308799
 South East  |   1.054677   .1362547     0.41   0.680     .8187517    1.358586
 South West  |   1.062623   .1370081     0.47   0.638     .8253355    1.368132
West Midl..  |   1.116529   .1417662     0.87   0.385     .8705472    1.432014
Yorkshire..  |   1.063977   .1366567     0.48   0.629     .8271879    1.368548
             |
       _cons |   .0132805   .0025616   -22.40   0.000     .0090998     .019382
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_region

. 
. 
. glm risk_28 i.sgtf##i.region i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_no
> miss ib1.obese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -12566.064  
Iteration 1:   log likelihood = -6327.4348  
Iteration 2:   log likelihood = -6303.9937  
Iteration 3:   log likelihood = -6303.4562  
Iteration 4:   log likelihood = -6303.4559  

Generalized linear models                         Number of obs   =     75,194
Optimization     : ML                             Residual df     =     75,146
                                                  Scale parameter =          1
Deviance         =  12606.91188                   (1/df) Deviance =   .1677656
Pearson          =  75126.81446                   (1/df) Pearson  =   .9997447

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1689352
Log likelihood   = -6303.455942                   BIC             =  -831119.4

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   .8560282   .1587157    -0.84   0.402      .595206    1.231144
             |
      region |
East Midl..  |   .9861291   .1770819    -0.08   0.938     .6935554    1.402124
     London  |   1.113909   .1697949     0.71   0.479     .8262278    1.501757
 North East  |   .9758629   .1738384    -0.14   0.891     .6882676    1.383631
 North West  |    1.02203    .181321     0.12   0.902     .7218542     1.44703
 South East  |   .9688737   .1747139    -0.18   0.861     .6804132    1.379627
 South West  |   1.019922   .1809478     0.11   0.911     .7203651    1.444048
West Midl..  |   .9809964   .1761564    -0.11   0.915     .6899508    1.394815
Yorkshire..  |   1.174929   .2007517     0.94   0.345     .8405678    1.642292
             |
 sgtf#region |
        VOC #|
East Midl..  |    1.09105    .284681     0.33   0.738     .6542532    1.819464
 VOC#London  |   1.007746   .2246553     0.03   0.972     .6510195    1.559941
        VOC #|
 North East  |   1.468828   .3688361     1.53   0.126     .8978967    2.402787
        VOC #|
 North West  |   .9805273   .2563124    -0.08   0.940     .5874262    1.636689
        VOC #|
 South East  |   1.190648   .3079514     0.67   0.500     .7171784    1.976695
        VOC #|
 South West  |   1.089415   .2813614     0.33   0.740     .6566821    1.807306
        VOC #|
West Midl..  |   1.295947   .3296888     1.02   0.308     .7871217    2.133698
        VOC #|
Yorkshire..  |   .7887658   .2050453    -0.91   0.361     .4738841    1.312877
             |
   agegroupA |
     50-<65  |   .9204226   .0693791    -1.10   0.271     .7940099    1.066961
     65-<75  |   1.068651    .098327     0.72   0.471     .8923116    1.279839
     75-<85  |   .9345937   .1163946    -0.54   0.587     .7321733    1.192976
        85+  |   .8645424   .1710559    -0.74   0.462     .5866377    1.274097
             |
        male |
          M  |   .9900544   .0557262    -0.18   0.859     .8866421    1.105528
             |
         imd |
          2  |   1.180854   .0946688     2.07   0.038      1.00915    1.381774
          3  |   1.135211    .091977     1.57   0.118     .9685241    1.330585
          4  |   1.006849   .0842408     0.08   0.935      .854567    1.186267
5 most de..  |   1.048826   .1094745     0.46   0.648      .854784    1.286916
             |
        eth5 |
South Asian  |   .9214765   .1247871    -0.60   0.546     .7066654    1.201585
      Black  |   .8528085   .1185323    -1.15   0.252     .6494453    1.119852
      Mixed  |   .9697024   .1281298    -0.23   0.816     .7484565    1.256349
      Other  |   1.154628   .1030501     1.61   0.107     .9693322    1.375345
             |
smoke_nomiss |
     Former  |   .8894046    .190133    -0.55   0.584     .5849696    1.352276
    Current  |   1.043174   .0889002     0.50   0.620     .8827071    1.232812
             |
   obese4cat |
Obese I ..)  |   .8879946   .0710306    -1.49   0.138     .7591417    1.038719
Obese II..)  |   .8675404   .0697459    -1.77   0.077     .7410668    1.015598
Obese II..)  |   .9109845    .066928    -1.27   0.204     .7888148    1.052075
             |
hh_total_cat |
        3-5  |   1.077705   .0608376     1.33   0.185      .964825    1.203791
       6-10  |   1.964544   1.118782     1.19   0.236     .6434483    5.998045
             |
rural_urban5 |
Urban min..  |   .8781415   .1158227    -0.99   0.325     .6781021    1.137192
Urban cit..  |   1.116867   .1220599     1.01   0.312     .9015201    1.383653
Rural tow..  |    1.04067   .1148067     0.36   0.718     .8383178    1.291867
Rural vil..  |   1.025384   .1038182     0.25   0.804     .8408215    1.250458
             |
  comorb_cat |
1 comorbi..  |   .9584467   .1207261    -0.34   0.736     .7487736    1.226833
2+ comorb..  |   .9866333   .1128354    -0.12   0.906      .788513    1.234533
             |
  start_week |
23Nov-29Nov  |   1.239633   .1096799     2.43   0.015     1.042271    1.474366
30Nov-06Dec  |   1.259172   .1114566     2.60   0.009     1.058621    1.497718
07Dec-13Dec  |   1.138356   .1043638     1.41   0.158     .9511309    1.362434
14Dec-20Dec  |   1.102969   .1124117     0.96   0.336     .9032562    1.346838
             |
       _cons |   .0138339   .0029022   -20.40   0.000       .00917    .0208698
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_regionX

. 
. * Test for interaction
. lrtest e_region e_regionX

Likelihood-ratio test                                 LR chi2(8)  =      8.50
(Assumption: e_region nested in e_regionX)            Prob > chi2 =    0.3865

. 
. * NHS region VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                    // East

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8560282   .1587157    -0.84   0.402      .595206    1.231144
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.region, eform  // East mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#1.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9339696   .1714729    -0.37   0.710     .6517119    1.338474
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.region, eform  // London

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8626589   .1067572    -1.19   0.233     .6768615    1.099457
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.region, eform  // North E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.257358   .2129358     1.35   0.176     .9022076    1.752312
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.region, eform  // North W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .839359   .1546943    -0.95   0.342     .5848855    1.204549
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.region, eform  // South E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.019228   .1838002     0.11   0.916     .7157677    1.451346
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.region, eform  // South W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9325703    .167683    -0.39   0.698     .6555853    1.326581
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.region, eform  // West mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.109368   .1932796     0.60   0.551     .7884512    1.560904
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#8.region, eform  // Yorks & Hum

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#8.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6752058   .1230375    -2.16   0.031     .4724201    .9650369
------------------------------------------------------------------------------

. 
. * NHS region marginal risks
. margins sgtf, over(region)

Predictive margins                              Number of obs     =     75,194
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : region

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 region#sgtf |
       East #|
    non-VOC  |   .0165272   .0020983     7.88   0.000     .0124147    .0206397
   East#VOC  |   .0141477   .0019113     7.40   0.000     .0104016    .0178939
East Midl.. #|
    non-VOC  |   .0163319   .0020736     7.88   0.000     .0122677    .0203961
East Midl.. #|
        VOC  |   .0152535   .0020225     7.54   0.000     .0112895    .0192176
     London #|
    non-VOC  |   .0183938   .0015512    11.86   0.000     .0153536     .021434
 London#VOC  |   .0158676   .0014368    11.04   0.000     .0130515    .0186836
 North East #|
    non-VOC  |   .0161343   .0020161     8.00   0.000     .0121829    .0200857
 North East #|
        VOC  |   .0202866   .0023182     8.75   0.000      .015743    .0248302
 North West #|
    non-VOC  |   .0169012   .0020945     8.07   0.000      .012796    .0210065
 North West #|
        VOC  |   .0141862   .0019346     7.33   0.000     .0103944     .017978
 South East #|
    non-VOC  |   .0160291   .0020523     7.81   0.000     .0120065    .0200516
 South East #|
        VOC  |   .0163373   .0020743     7.88   0.000     .0122717    .0204029
 South West #|
    non-VOC  |   .0168848   .0020924     8.07   0.000     .0127837    .0209858
 South West #|
        VOC  |   .0157462    .002051     7.68   0.000     .0117263    .0197662
West Midl.. #|
    non-VOC  |   .0162546   .0020639     7.88   0.000     .0122094    .0202997
West Midl.. #|
        VOC  |   .0180323   .0021508     8.38   0.000     .0138168    .0222478
Yorkshire.. #|
    non-VOC  |   .0195187   .0022312     8.75   0.000     .0151456    .0238919
Yorkshire.. #|
        VOC  |   .0131792     .00187     7.05   0.000      .009514    .0168444
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -16977.278  
Iteration 1:   log likelihood = -8489.6103  
Iteration 2:   log likelihood = -8465.0681  
Iteration 3:   log likelihood = -8464.7875  
Iteration 4:   log likelihood = -8464.7874  

Generalized linear models                         Number of obs   =    102,429
Optimization     : ML                             Residual df     =    102,416
                                                  Scale parameter =          1
Deviance         =  16929.57489                   (1/df) Deviance =   .1653021
Pearson          =  102434.4987                   (1/df) Pearson  =   1.000181

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1655349
Log likelihood   = -8464.787444                   BIC             =   -1164636

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    .984279   .0479998    -0.32   0.745     .8945572       1.083
             |
  comorb_cat |
1 comorbi..  |   .9418374    .103657    -0.54   0.586     .7590915    1.168578
2+ comorb..  |    1.01365   .1009477     0.14   0.892     .8339081    1.232133
             |
         imd |
          2  |   1.096217   .0764109     1.32   0.188     .9562344    1.256692
          3  |   1.096057   .0762095     1.32   0.187     .9564195    1.256081
          4  |   .9468988   .0686171    -0.75   0.451     .8215257    1.091405
5 most de..  |   1.033559   .0924723     0.37   0.712     .8673182    1.231664
             |
smoke_nomiss |
     Former  |   .8184644   .1579345    -1.04   0.299     .5607227     1.19468
    Current  |   1.006638   .0752173     0.09   0.929     .8695015    1.165403
             |
        age1 |   .9981289   .0050281    -0.37   0.710     .9883225    1.008033
        age2 |   1.002685   .0164913     0.16   0.870     .9708785    1.035534
        age3 |   .9959987   .0463591    -0.09   0.931     .9091579    1.091134
       _cons |   .0165459   .0021692   -31.29   0.000     .0127967    .0213936
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =    102,429
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0162851   .0005583    29.17   0.000     .0151909    .0173793
        VOC  |   .0160291   .0005559    28.83   0.000     .0149395    .0171187
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =    102,429
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               comorb_cat       (asbalanced)
               imd              (asbalanced)
               smoke_nomiss     (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0151396   .0011883    12.74   0.000     .0128105    .0174687
        VOC  |   .0149016   .0011734    12.70   0.000     .0126017    .0172015
------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_risk_models.log
  log type:  text
 closed on:  12 Feb 2021, 16:55:13
-------------------------------------------------------------------------------
