-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_risk28_table1.log
  log type:  text
 opened on:  13 Feb 2021, 17:30:29

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 13 Feb 2021)

. 
. 
. 
. *****************************************************************************
> ***
. *       PROGRAMS TO AUTOMATE TABULATIONS
. *
. *****************************************************************************
> ***
. * All below code from K Baskharan 
. * Generic code to output one row of table
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)
  4.         
.         sum `variable' if `variable' `condition'
  5.         **K Wing additional code to aoutput variable category labels**
.         local level=substr("`condition'",3,.)
  6.         local lab: label `variable'Lab `level'
  7.         file write tablecontent (" `lab'") _tab
  8.         
.         /*this is the overall column*/
.         cou if `variable' `condition'
  9.         local rowdenom = r(N)
 10.         local colpct = 100*(r(N)/`overalldenom')
 11.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
 12. 
.         /*this loops through groups*/
.         forvalues i=0/1{
 13.         cou if sgtf == `i'
 14.         local rowdenom = r(N)
 15.         cou if sgtf == `i' & `variable' `condition'
 16.         local pct = 100*(r(N)/`rowdenom') 
 17.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 18.         }
 19.         
.         file write tablecontent _n
 20. end

. 
. 
. * Output one row of table for co-morbidities and meds
. * This puts it all on the same row, is rohini's edit
. 
. cap prog drop generaterow2 

. program define generaterow2
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)5
  4.         
.         cou if `variable' `condition'
  5.         local rowdenom = r(N)
  6.         local colpct = 100*(r(N)/`overalldenom')
  7.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
  8. 
.         forvalues i=0/1{
  9.         cou if sgtf == `i'
 10.         local rowdenom = r(N)
 11.         cou if sgtf == `i' & `variable' `condition'
 12.         local pct = 100*(r(N)/`rowdenom') 
 13.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 14.         }
 15.         
.         file write tablecontent _n
 16. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines a program (SAS macro/R function equivalent), generate row
> the syntax row specifies two inputs for the program: 
>         a VARNAME which is your variable 
>         a CONDITION which is a string of some condition you impose 
>         
> the program counts if variable and condition and returns the counts
> column percentages are then automatically generated
> this is then written to the text file 'tablecontent' 
> the number followed by space, brackets, formatted pct, end bracket and then t
> ab
> the format %3.1f specifies length of 3, followed by 1 dp. 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to output one section (varible) within table (calls above)
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) min(real) max(real) [missing]
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
.         forvalues varlevel = `min'/`max'{ 
  5.                 generaterow, variable(`variable') condition("==`varlevel'"
> )
  6.         }
  7.         
.         if "`missing'"!="" generaterow, variable(`variable') condition("== 12
> ")
  8.         
. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines program tabulate variable 
> syntax is : 
>         - a VARNAME which you stick in variable 
>         - a numeric minimum 
>         - a numeric maximum 
>         - optional missing option, default value is . 
> forvalues lowest to highest of the variable, manually set for each var
> run the generate row program for the level of the variable 
> if there is a missing specified, then run the generate row for missing vals
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to qui summarize a continous variable 
. 
. cap prog drop summarizevariable 

. prog define summarizevariable
  1. syntax, variable(varname) 
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
. 
.         qui summarize `variable', d
  5.         file write tablecontent ("Mean (SD)") _tab 
  6.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
  7.         
.         forvalues i=0/1{                                                     
>    
  8.         qui summarize `variable' if sgtf == `i', d
  9.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
 10.         }
 11. 
. file write tablecontent _n
 12. 
.         
.         qui summarize `variable', d
 13.         file write tablecontent ("Median (IQR)") _tab 
 14.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 15.         
.         forvalues i=0/1{
 16.         qui summarize `variable' if sgtf == `i', d
 17.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 18.         }
 19.         
. file write tablecontent _n
 20.         
. end

. 
. 
. 
. *****************************************************************************
> ***
. * INVOKE PROGRAMS FOR TABLE 1 
. *
. *****************************************************************************
> ***
. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(37,035 observations deleted)

. 
. noi di "SUBSETTING ON 28-DAY RISK POPULATION"
SUBSETTING ON 28-DAY RISK POPULATION

. keep if risk_pop==1
(7,498 observations deleted)

. 
. 
. *Set up output file
. cap file close tablecontent

. 
. *file open tablecontent using "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-re
> search\output\table1_risk28.txt", write text replace
. file open tablecontent using ./output/table1_risk28.txt, write text replace
(note: file ./output/table1_risk28.txt not found)

. 
. file write tablecontent ("Table 1: Demographic and Clinical Characteristics")
>  _n

. 
. file write tablecontent _tab ("Total")          _tab ///
>                                                          ("non-VOC")    _tab 
> ///
>                                                          ("VOC")             
>    _n

.                                                          
. 
. 
. * DEMOGRAPHICS (more than one level, potentially missing) 
. 
. /*reminder of variables:
> patient_id age ageCat hh_id hh_size hh_composition case_date case eth5 eth16 
> ethnicity_16 indexdate sex bmicat smoke imd region comorb_Neuro comorb_Immuno
> suppression shielding chronic_respiratory_disease chronic_cardiac_disease dia
> betes chronic_liver_disease cancer egfr_cat hypertension smoke_nomiss rural_u
> rban
> */
. 
. *DIED
. tabulatevariable, variable(risk_28) min(0) max(1) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     risk_28 |    139,180           0           0          0          0
  139,180
  70,480
  69,407
  70,831
  69,773
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     risk_28 |      2,131           1           0          1          1
  2,131
  70,480
  1,073
  70,831
  1,058

. file write tablecontent _n 

. 
. *SEX
. tabulatevariable, variable(male) min(0) max(1) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     72,160           0           0          0          0
  72,160
  70,480
  36,010
  70,831
  36,150
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     69,151           1           0          1          1
  69,151
  70,480
  34,470
  70,831
  34,681

. file write tablecontent _n 

. 
. *AGE
. summarizevariable, variable(age) 

. file write tablecontent _n

. 
. tabulatevariable, variable(agegroup) min(1) max(7) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     21,793           1           0          1          1
  21,793
  70,480
  10,868
  70,831
  10,925
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     18,711           2           0          2          2
  18,711
  70,480
  9,317
  70,831
  9,394
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     18,045           3           0          3          3
  18,045
  70,480
  8,990
  70,831
  9,055
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     19,045           4           0          4          4
  19,045
  70,480
  9,530
  70,831
  9,515
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     14,896           5           0          5          5
  14,896
  70,480
  7,419
  70,831
  7,477
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     11,699           6           0          6          6
  11,699
  70,480
  5,754
  70,831
  5,945
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      6,986           7           0          7          7
  6,986
  70,480
  3,521
  70,831
  3,465

. file write tablecontent _n 

. 
. *ETHNICITY
. tabulatevariable, variable(eth5) min(1) max(5) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     79,297           1           0          1          1
  79,297
  70,480
  39,497
  70,831
  39,800
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,287           2           0          2          2
  5,287
  70,480
  2,682
  70,831
  2,605
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,308           3           0          3          3
  5,308
  70,480
  2,544
  70,831
  2,764
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      5,394           4           0          4          4
  5,394
  70,480
  2,704
  70,831
  2,690
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     10,514           5           0          5          5
  10,514
  70,480
  5,217
  70,831
  5,297

. file write tablecontent _n 

. 
. *BMI
. tabulatevariable, variable(obese4cat) min(1) max(4) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     57,667           1           0          1          1
  57,667
  70,480
  28,748
  70,831
  28,919
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     25,510           2           0          2          2
  25,510
  70,480
  12,834
  70,831
  12,676
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     25,688           3           0          3          3
  25,688
  70,480
  12,924
  70,831
  12,764
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     32,446           4           0          4          4
  32,446
  70,480
  15,974
  70,831
  16,472

. file write tablecontent _n 

. 
. *SMOKING
. tabulatevariable, variable(smoke_nomiss) min(1) max(3) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |    121,500           1           0          1          1
  121,500
  70,480
  60,578
  70,831
  60,922
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |      2,812           2           0          2          2
  2,812
  70,480
  1,408
  70,831
  1,404
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     16,999           3           0          3          3
  16,999
  70,480
  8,494
  70,831
  8,505

. file write tablecontent _n

. 
. *COMORBIDITIES (3 CATEGORIES)
. tabulatevariable, variable(comorb_cat) min(0) max(2) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |      9,037           0           0          0          0
  9,037
  70,480
  4,465
  70,831
  4,572
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     30,078           1           0          1          1
  30,078
  70,480
  15,059
  70,831
  15,019
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |    102,196           2           0          2          2
  102,196
  70,480
  50,956
  70,831
  51,240

. file write tablecontent _n

. 
. *IMD
. tabulatevariable, variable(imd) min(1) max(5) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     42,343           1           0          1          1
  42,343
  70,480
  20,969
  70,831
  21,374
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     28,084           2           0          2          2
  28,084
  70,480
  14,124
  70,831
  13,960
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     28,497           3           0          3          3
  28,497
  70,480
  14,216
  70,831
  14,281
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     28,233           4           0          4          4
  28,233
  70,480
  14,028
  70,831
  14,205
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     14,154           5           0          5          5
  14,154
  70,480
  7,143
  70,831
  7,011

. file write tablecontent _n 

. 
. *HOUSEHOLD SIZE
. tabulatevariable, variable(hh_total_cat) min(1) max(4) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     67,417           1           0          1          1
  67,417
  70,480
  33,530
  70,831
  33,887
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     70,474           2           0          2          2
  70,474
  70,480
  35,250
  70,831
  35,224
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |        186           3           0          3          3
  186
  70,480
  99
  70,831
  87
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |          0
  0
  70,480
  0
  70,831
  0

. file write tablecontent _n 

. 
. *REGION
. tabulatevariable, variable(region) min(0) max(8) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |          0
  0
  70,480
  0
  70,831
  0
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,091           1           0          1          1
  14,091
  70,480
  6,962
  70,831
  7,129
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     28,279           2           0          2          2
  28,279
  70,480
  14,106
  70,831
  14,173
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,113           3           0          3          3
  14,113
  70,480
  7,088
  70,831
  7,025
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,033           4           0          4          4
  14,033
  70,480
  6,989
  70,831
  7,044
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,190           5           0          5          5
  14,190
  70,480
  7,119
  70,831
  7,071
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,157           6           0          6          6
  14,157
  70,480
  6,948
  70,831
  7,209
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,047           7           0          7          7
  14,047
  70,480
  7,081
  70,831
  6,966
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     14,038           8           0          8          8
  14,038
  70,480
  7,031
  70,831
  7,007

. file write tablecontent _n 

. 
. *RURAL URBAN (five categories)
. tabulatevariable, variable(rural_urban5) min(1) max(5) 
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,196           1           0          1          1
  14,196
  70,480
  7,007
  70,831
  7,189
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     14,007           2           0          2          2
  14,007
  70,480
  7,048
  70,831
  6,959
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     28,294           3           0          3          3
  28,294
  70,480
  14,132
  70,831
  14,162
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     28,225           4           0          4          4
  28,225
  70,480
  14,070
  70,831
  14,155
  141,311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     56,589           5           0          5          5
  56,589
  70,480
  28,223
  70,831
  28,366

. file write tablecontent _n 

. 
. 
. 
. 
. 
. 
. 
. file write tablecontent _n _n

. 
. 
. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_risk28_table1.log
  log type:  text
 closed on:  13 Feb 2021, 17:30:34
-------------------------------------------------------------------------------
