-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_risk28_table1.log
  log type:  text
 opened on:  12 Feb 2021, 16:49:24

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 12 Feb 2021)

. 
. 
. 
. 
. *****************************************************************************
> ***
. *       PROGRAMS TO AUTOMATE TABULATIONS
. *
. *****************************************************************************
> ***
. * All below code from K Baskharan 
. * Generic code to output one row of table
. 
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)
  4.         
.         sum `variable' if `variable' `condition'
  5.         **K Wing additional code to aoutput variable category labels**
.         local level=substr("`condition'",3,.)
  6.         local lab: label `variable'Lab `level'
  7.         file write tablecontent (" `lab'") _tab
  8.         
.         /*this is the overall column*/
.         cou if `variable' `condition'
  9.         local rowdenom = r(N)
 10.         local colpct = 100*(r(N)/`overalldenom')
 11.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
 12. 
.         /*this loops through groups*/
.         forvalues i=0/1{
 13.         cou if sgtf == `i'
 14.         local rowdenom = r(N)
 15.         cou if sgtf == `i' & `variable' `condition'
 16.         local pct = 100*(r(N)/`rowdenom') 
 17.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 18.         }
 19.         
.         file write tablecontent _n
 20. end

. 
. 
. * Output one row of table for co-morbidities and meds
. * This puts it all on the same row, is rohini's edit
. 
. cap prog drop generaterow2 

. program define generaterow2
  1. syntax, variable(varname) condition(string) 
  2.         
.         cou
  3.         local overalldenom=r(N)5
  4.         
.         cou if `variable' `condition'
  5.         local rowdenom = r(N)
  6.         local colpct = 100*(r(N)/`overalldenom')
  7.         file write tablecontent %9.0gc (`rowdenom')  (" (") %3.1f (`colpct
> ') (")") _tab
  8. 
.         forvalues i=0/1{
  9.         cou if sgtf == `i'
 10.         local rowdenom = r(N)
 11.         cou if sgtf == `i' & `variable' `condition'
 12.         local pct = 100*(r(N)/`rowdenom') 
 13.         file write tablecontent %9.0gc (r(N)) (" (") %3.1f (`pct') (")") _
> tab
 14.         }
 15.         
.         file write tablecontent _n
 16. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines a program (SAS macro/R function equivalent), generate row
> the syntax row specifies two inputs for the program: 
>         a VARNAME which is your variable 
>         a CONDITION which is a string of some condition you impose 
>         
> the program counts if variable and condition and returns the counts
> column percentages are then automatically generated
> this is then written to the text file 'tablecontent' 
> the number followed by space, brackets, formatted pct, end bracket and then t
> ab
> the format %3.1f specifies length of 3, followed by 1 dp. 
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to output one section (varible) within table (calls above)
. 
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) min(real) max(real) [missing]
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
.         forvalues varlevel = `min'/`max'{ 
  5.                 generaterow, variable(`variable') condition("==`varlevel'"
> )
  6.         }
  7.         
.         if "`missing'"!="" generaterow, variable(`variable') condition("== 12
> ")
  8.         
. end

. 
. 
. *****************************************************************************
> ***
. 
. /* Explanatory Notes 
> defines program tabulate variable 
> syntax is : 
>         - a VARNAME which you stick in variable 
>         - a numeric minimum 
>         - a numeric maximum 
>         - optional missing option, default value is . 
> forvalues lowest to highest of the variable, manually set for each var
> run the generate row program for the level of the variable 
> if there is a missing specified, then run the generate row for missing vals
> */ 
. 
. *****************************************************************************
> ***
. * Generic code to qui summarize a continous variable 
. 
. cap prog drop summarizevariable 

. prog define summarizevariable
  1. syntax, variable(varname) 
  2. 
.         local lab: variable label `variable'
  3.         file write tablecontent ("`lab'") _n 
  4. 
. 
.         qui summarize `variable', d
  5.         file write tablecontent ("Mean (SD)") _tab 
  6.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
  7.         
.         forvalues i=0/1{                                                     
>    
  8.         qui summarize `variable' if sgtf == `i', d
  9.         file write tablecontent  %3.1f (r(mean)) (" (") %3.1f (r(sd)) (")"
> ) _tab
 10.         }
 11. 
. file write tablecontent _n
 12. 
.         
.         qui summarize `variable', d
 13.         file write tablecontent ("Median (IQR)") _tab 
 14.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 15.         
.         forvalues i=0/1{
 16.         qui summarize `variable' if sgtf == `i', d
 17.         file write tablecontent %3.1f (r(p50)) (" (") %3.1f (r(p25)) ("-")
>  %3.1f (r(p75)) (")") _tab
 18.         }
 19.         
. file write tablecontent _n
 20.         
. end

. 
. 
. 
. *****************************************************************************
> ***
. * INVOKE PROGRAMS FOR TABLE 1 
. *
. *****************************************************************************
> ***
. 
. noi di "SUBSETTING ON 28-DAY RISK POPULATION"
SUBSETTING ON 28-DAY RISK POPULATION

. keep if risk_pop==1
(45,312 observations deleted)

. 
. 
. *Set up output file
. cap file close tablecontent

. 
. *file open tablecontent using "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-re
> search\output\table1_risk28.txt", write text replace
. file open tablecontent using ./output/table1_risk28.txt, write text replace
(note: file ./output/table1_risk28.txt not found)

. 
. file write tablecontent ("Table 1: Demographic and Clinical Characteristics")
>  _n

. 
. file write tablecontent _tab ("Total")          _tab ///
>                                                          ("non-VOC")    _tab 
> ///
>                                                          ("VOC")             
>    _n

.                                                          
. 
. 
. * DEMOGRAPHICS (more than one level, potentially missing) 
. 
. /*reminder of variables:
> patient_id age ageCat hh_id hh_size hh_composition case_date case eth5 eth16 
> ethnicity_16 indexdate sex bmicat smoke imd region comorb_Neuro comorb_Immuno
> suppression shielding chronic_respiratory_disease chronic_cardiac_disease dia
> betes chronic_liver_disease cancer egfr_cat hypertension smoke_nomiss rural_u
> rban
> */
. 
. *DIED
. tabulatevariable, variable(risk_28) min(0) max(1) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     risk_28 |    100,774           0           0          0          0
  100,774
  51,402
  50,565
  51,027
  50,209
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     risk_28 |      1,655           1           0          1          1
  1,655
  51,402
  837
  51,027
  818

. file write tablecontent _n 

. 
. *SEX
. tabulatevariable, variable(male) min(0) max(1) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     52,020           0           0          0          0
  52,020
  51,402
  26,047
  51,027
  25,973
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        male |     50,409           1           0          1          1
  50,409
  51,402
  25,355
  51,027
  25,054

. file write tablecontent _n 

. 
. *AGE
. summarizevariable, variable(age) 

. file write tablecontent _n

. 
. tabulatevariable, variable(agegroup) min(1) max(7) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     15,609           1           0          1          1
  15,609
  51,402
  7,812
  51,027
  7,797
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     13,656           2           0          2          2
  13,656
  51,402
  6,893
  51,027
  6,763
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     13,017           3           0          3          3
  13,017
  51,402
  6,562
  51,027
  6,455
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     13,934           4           0          4          4
  13,934
  51,402
  6,930
  51,027
  7,004
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |     10,986           5           0          5          5
  10,986
  51,402
  5,509
  51,027
  5,477
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      8,533           6           0          6          6
  8,533
  51,402
  4,284
  51,027
  4,249
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    agegroup |      4,986           7           0          7          7
  4,986
  51,402
  2,467
  51,027
  2,519

. file write tablecontent _n 

. 
. *ETHNICITY
. tabulatevariable, variable(eth5) min(1) max(5) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |     57,708           1           0          1          1
  57,708
  51,402
  28,959
  51,027
  28,749
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      3,841           2           0          2          2
  3,841
  51,402
  1,918
  51,027
  1,923
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      3,941           3           0          3          3
  3,941
  51,402
  1,972
  51,027
  1,969
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      3,828           4           0          4          4
  3,828
  51,402
  1,898
  51,027
  1,930
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        eth5 |      7,603           5           0          5          5
  7,603
  51,402
  3,882
  51,027
  3,721

. file write tablecontent _n 

. 
. *BMI
. tabulatevariable, variable(obese4cat) min(1) max(4) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     41,683           1           0          1          1
  41,683
  51,402
  20,850
  51,027
  20,833
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     18,638           2           0          2          2
  18,638
  51,402
  9,459
  51,027
  9,179
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     18,779           3           0          3          3
  18,779
  51,402
  9,444
  51,027
  9,335
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   obese4cat |     23,329           4           0          4          4
  23,329
  51,402
  11,649
  51,027
  11,680

. file write tablecontent _n 

. 
. *SMOKING
. tabulatevariable, variable(smoke_nomiss) min(1) max(3) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     88,075           1           0          1          1
  88,075
  51,402
  44,150
  51,027
  43,925
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |      2,035           2           0          2          2
  2,035
  51,402
  1,030
  51,027
  1,005
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
smoke_nomiss |     12,319           3           0          3          3
  12,319
  51,402
  6,222
  51,027
  6,097

. file write tablecontent _n

. 
. *COMORBIDITIES (3 CATEGORIES)
. tabulatevariable, variable(comorb_cat) min(0) max(2) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |      6,682           0           0          0          0
  6,682
  51,402
  3,390
  51,027
  3,292
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     21,502           1           0          1          1
  21,502
  51,402
  10,769
  51,027
  10,733
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  comorb_cat |     74,245           2           0          2          2
  74,245
  51,402
  37,243
  51,027
  37,002

. file write tablecontent _n

. 
. *IMD
. tabulatevariable, variable(imd) min(1) max(5) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     30,753           1           0          1          1
  30,753
  51,402
  15,519
  51,027
  15,234
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     20,315           2           0          2          2
  20,315
  51,402
  10,216
  51,027
  10,099
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     20,492           3           0          3          3
  20,492
  51,402
  10,232
  51,027
  10,260
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     20,681           4           0          4          4
  20,681
  51,402
  10,401
  51,027
  10,280
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         imd |     10,188           5           0          5          5
  10,188
  51,402
  5,034
  51,027
  5,154

. file write tablecontent _n 

. 
. *HOUSEHOLD SIZE
. tabulatevariable, variable(hh_total_cat) min(1) max(4) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     48,772           1           0          1          1
  48,772
  51,402
  24,574
  51,027
  24,198
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |     51,208           2           0          2          2
  51,208
  51,402
  25,605
  51,027
  25,603
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |        132           3           0          3          3
  132
  51,402
  66
  51,027
  66
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_total_cat |          0
  0
  51,402
  0
  51,027
  0

. file write tablecontent _n 

. 
. *REGION
. tabulatevariable, variable(region) min(0) max(8) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,196           0           0          0          0
  10,196
  51,402
  5,061
  51,027
  5,135
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,120           1           0          1          1
  10,120
  51,402
  5,041
  51,027
  5,079
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     20,657           2           0          2          2
  20,657
  51,402
  10,324
  51,027
  10,333
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,352           3           0          3          3
  10,352
  51,402
  5,267
  51,027
  5,085
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,190           4           0          4          4
  10,190
  51,402
  5,150
  51,027
  5,040
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,219           5           0          5          5
  10,219
  51,402
  5,121
  51,027
  5,098
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,127           6           0          6          6
  10,127
  51,402
  5,137
  51,027
  4,990
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,372           7           0          7          7
  10,372
  51,402
  5,141
  51,027
  5,231
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      region |     10,196           8           0          8          8
  10,196
  51,402
  5,160
  51,027
  5,036

. file write tablecontent _n 

. 
. *RURAL URBAN (five categories)
. tabulatevariable, variable(rural_urban5) min(1) max(5) 
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     10,125           1           0          1          1
  10,125
  51,402
  5,047
  51,027
  5,078
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     10,394           2           0          2          2
  10,394
  51,402
  5,161
  51,027
  5,233
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     20,368           3           0          3          3
  20,368
  51,402
  10,227
  51,027
  10,141
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     20,432           4           0          4          4
  20,432
  51,402
  10,331
  51,027
  10,101
  102,429

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
rural_urban5 |     41,110           5           0          5          5
  41,110
  51,402
  20,636
  51,027
  20,474

. file write tablecontent _n 

. 
. 
. 
. 
. 
. 
. 
. file write tablecontent _n _n

. 
. 
. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_risk28_table1.log
  log type:  text
 closed on:  12 Feb 2021, 16:49:28
-------------------------------------------------------------------------------
