-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/an_risk_models.log
  log type:  text
 opened on:  11 Feb 2021, 11:43:40

. 
. clear

. 
. /*
> use "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output\cr_analysis_
> dataset.dta"
> */
. 
. use ./output/cr_analysis_dataset.dta
(SGTF CFR ANALYSIS DATASET: 11 Feb 2021)

. 
. noi di "SUBSETTING ON 28-DAY RISK POPULATION"
SUBSETTING ON 28-DAY RISK POPULATION

. keep if risk_pop==1
(28,133 observations deleted)

. 
. tab sgtf risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

 Exposure: |
    0=VOC; |    28-day outcome
 1=non-VOC |         0          1 |     Total
-----------+----------------------+----------
   non-VOC |    31,245        388 |    31,633 
           |     98.77       1.23 |    100.00 
-----------+----------------------+----------
       VOC |    31,884        574 |    32,458 
           |     98.23       1.77 |    100.00 
-----------+----------------------+----------
     Total |    63,129        962 |    64,091 
           |     98.50       1.50 |    100.00 

. 
. 
. *******************
. /* Unadjusted RR */
. *******************
. 
. glm risk_28 i.sgtf, family(bin) link(log) eform

Iteration 0:   log likelihood =  -10316.66  
Iteration 1:   log likelihood = -4990.7474  
Iteration 2:   log likelihood = -4978.3891  
Iteration 3:   log likelihood = -4978.2058  
Iteration 4:   log likelihood = -4978.2058  

Generalized linear models                         Number of obs   =     64,091
Optimization     : ML                             Residual df     =     64,089
                                                  Scale parameter =          1
Deviance         =  9956.411571                   (1/df) Deviance =   .1553529
Pearson          =  64090.99832                   (1/df) Pearson  =   1.000031

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1554105
Log likelihood   = -4978.205785                   BIC             =  -699384.4

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.441779   .0940705     5.61   0.000     1.268707    1.638462
       _cons |   .0122657   .0006189   -87.23   0.000     .0111108    .0135406
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. * Absolute risk
. margins sgtf

Adjusted predictions                            Number of obs     =     64,091
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0122657   .0006189    19.82   0.000     .0110527    .0134786
        VOC  |   .0176844   .0007316    24.17   0.000     .0162505    .0191183
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted RR - age as spline, continuous hh size */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth5 household_size ///
>                         i.stp ib1.rural_urban5 ib1.start_week age1 age2 age3,
>  ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -7741.2828  
Iteration 1:   log likelihood = -3735.4755  
Iteration 2:   log likelihood = -3722.6576  
Iteration 3:   log likelihood = -3722.3421  
Iteration 4:   log likelihood = -3722.3419  

Generalized linear models                         Number of obs   =     48,105
Optimization     : ML                             Residual df     =     48,073
                                                  Scale parameter =          1
Deviance         =  7444.683831                   (1/df) Deviance =   .1548621
Pearson          =  48062.67801                   (1/df) Pearson  =   .9997853

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1560895
Log likelihood   = -3722.341915                   BIC             =  -510837.1

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.534447   .1162482     5.65   0.000     1.322714    1.780075
             |
        male |
          M  |   1.093857   .0807444     1.22   0.224     .9465161    1.264134
             |
         imd |
          2  |   1.023107   .1097534     0.21   0.831     .8291035    1.262506
          3  |   .9820275   .1065114    -0.17   0.867     .7939656    1.214634
          4  |   1.124386   .1170683     1.13   0.260     .9168336    1.378925
5 most de..  |   1.038454   .1412065     0.28   0.781     .7955049      1.3556
             |
        eth5 |
South Asian  |   1.059503   .1764582     0.35   0.729     .7644272     1.46848
      Black  |   1.218582   .1934686     1.25   0.213      .892716    1.663397
      Mixed  |   1.138063   .1808371     0.81   0.416     .8335105    1.553894
      Other  |   .9520812   .1209285    -0.39   0.699     .7422645    1.221207
             |
household_~e |   .9201397   .0327413    -2.34   0.019     .8581545    .9866022
             |
         stp |
          2  |   1.069378    .173296     0.41   0.679     .7783796    1.469167
          3  |    1.18233   .1870612     1.06   0.290     .8670948    1.612169
          4  |   .8651882   .1483451    -0.84   0.398     .6182493    1.210758
          5  |   1.043113   .1701363     0.26   0.796     .7576984    1.436038
          6  |   1.047909   .1714881     0.29   0.775     .7603722    1.444179
          7  |    1.05364   .1718679     0.32   0.749     .7653249     1.45057
          8  |   1.015224   .1667264     0.09   0.927     .7358214    1.400721
          9  |   .8275888    .142558    -1.10   0.272     .5904583    1.159952
         10  |   .9334392   .1561225    -0.41   0.680     .6725402    1.295549
             |
rural_urban5 |
Urban min..  |   1.062604   .1744984     0.37   0.712      .770174    1.466067
Urban cit..  |   1.001972     .14418     0.01   0.989      .755737    1.328435
Rural tow..  |   1.001693   .1441389     0.01   0.991      .755528    1.328062
Rural vil..  |   1.052115    .137126     0.39   0.697     .8149349    1.358324
             |
  start_week |
23Nov-29Nov  |   .9432421   .1079861    -0.51   0.610     .7536579    1.180516
30Nov-06Dec  |   .9085698   .1059035    -0.82   0.411     .7230057     1.14176
07Dec-13Dec  |   1.060512   .1206089     0.52   0.605     .8486155    1.325319
14Dec-20Dec  |   1.127132   .1388823     0.97   0.331     .8853025    1.435019
             |
        age1 |    .998961   .0077724    -0.13   0.894      .983843    1.014311
        age2 |   1.020319   .0257369     0.80   0.425     .9711025     1.07203
        age3 |   .9237644   .0661235    -1.11   0.268     .8028452    1.062896
       _cons |   .0123636   .0030393   -17.87   0.000     .0076365    .0200166
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     48,105
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0118292   .0007014    16.86   0.000     .0104544     .013204
        VOC  |   .0181513   .0008554    21.22   0.000     .0164748    .0198279
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =     48,105
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0124687   .0009885    12.61   0.000     .0105313    .0144061
        VOC  |   .0191326   .0013615    14.05   0.000      .016464    .0218011
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Demographically adjusted RR - age grouped, cat hh size                  */
. /* Not adjusting for comorbidities, obesity, or smoking status     */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth5 ib1.hh_total_cat ///
>                         i.stp ib1.rural_urban5 ib1.start_week i.agegroup, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7554.8713  
Iteration 1:   log likelihood = -3648.7829  
Iteration 2:   log likelihood = -3635.4583  
Iteration 3:   log likelihood = -3635.1165  
Iteration 4:   log likelihood = -3635.1163  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,948
                                                  Scale parameter =          1
Deviance         =  7272.269318                   (1/df) Deviance =   .1549005
Pearson          =   46846.8396                   (1/df) Pearson  =   .9978453

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1562709
Log likelihood   = -3635.116303                   BIC             =  -497773.8

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.537727   .1178592     5.61   0.000     1.323241     1.78698
             |
        male |
          M  |    1.09607   .0818173     1.23   0.219     .9468895    1.268753
             |
         imd |
          2  |   1.023539   .1109069     0.21   0.830     .8276974     1.26572
          3  |   .9773512   .1071067    -0.21   0.834     .7884398    1.211526
          4  |   1.125657   .1183164     1.13   0.260     .9160879    1.383167
5 most de..  |   1.016522   .1408254     0.12   0.906     .7748085    1.333642
             |
        eth5 |
South Asian  |   1.079809   .1799215     0.46   0.645     .7789632    1.496846
      Black  |   1.214022   .1950697     1.21   0.227     .8860432    1.663405
      Mixed  |    1.08322   .1783339     0.49   0.627     .7844782    1.495729
      Other  |   .9505477    .121656    -0.40   0.692     .7396611    1.221561
             |
hh_total_cat |
        3-5  |   .8101836    .060646    -2.81   0.005     .6996278    .9382096
       6-10  |          1  (empty)
             |
         stp |
          2  |   1.057906   .1743487     0.34   0.733     .7658867    1.461268
          3  |   1.202393   .1921775     1.15   0.249     .8790217    1.644725
          4  |   .8930578   .1540861    -0.66   0.512     .6368178    1.252403
          5  |   1.029668   .1708663     0.18   0.860     .7437829    1.425438
          6  |   1.052793   .1746934     0.31   0.757     .7605021    1.457423
          7  |   1.067512   .1759347     0.40   0.692     .7728367    1.474544
          8  |   1.039413   .1718865     0.23   0.815     .7516675    1.437309
          9  |   .8234827   .1440526    -1.11   0.267     .5844575    1.160262
         10  |   .9316948   .1580974    -0.42   0.677     .6680901    1.299309
             |
rural_urban5 |
Urban min..  |   1.017318   .1687986     0.10   0.918     .7348876    1.408291
Urban cit..  |   .9797667    .141493    -0.14   0.887      .738238    1.300316
Rural tow..  |   .9623156   .1393234    -0.27   0.791     .7245713    1.278068
Rural vil..  |   1.030085   .1344585     0.23   0.820     .7975623    1.330398
             |
  start_week |
23Nov-29Nov  |   .9376762   .1078666    -0.56   0.576     .7484004    1.174821
30Nov-06Dec  |   .8934188   .1050421    -0.96   0.338     .7095396    1.124951
07Dec-13Dec  |   1.037252   .1190689     0.32   0.750     .8282709     1.29896
14Dec-20Dec  |   1.096281   .1366187     0.74   0.461     .8587068    1.399583
             |
    agegroup |
     18-<30  |   .9196568   .1162171    -0.66   0.507     .7178925    1.178127
     30-<40  |   .9298006   .1230007    -0.55   0.582      .717442    1.205016
     40-<50  |   1.093622   .1389004     0.70   0.481     .8526224    1.402743
     50-<60  |   .9507487   .1240122    -0.39   0.699     .7362717    1.227703
     60-<70  |   1.089759   .1456923     0.64   0.520      .838555    1.416216
     70-<80  |   1.037207    .155342     0.24   0.807     .7733597    1.391072
        80+  |   .6443013   .1431175    -1.98   0.048      .416882    .9957835
             |
       _cons |    .012369   .0026256   -20.69   0.000     .0081592    .0187508
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0118409    .000711    16.65   0.000     .0104473    .0132344
        VOC  |    .018208   .0008669    21.00   0.000      .016509     .019907
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               hh_total_cat     (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               start_week       (asbalanced)
               agegroup         (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |          .  (not estimable)
        VOC  |          .  (not estimable)
------------------------------------------------------------------------------

. 
. 
. 
. ***********************************************************
. /* Fully adjusted RR - age as spline, continuous hh size */
. ***********************************************************
. 
. glm risk_28 i.sgtf i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.obese4cat hou
> sehold_size ///
>                         i.stp ib1.rural_urban5 ib0.comorb_cat ib1.start_week 
> age1 age2 age3, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -7740.5385  
Iteration 1:   log likelihood = -3733.5933  
Iteration 2:   log likelihood = -3720.3769  
Iteration 3:   log likelihood = -3720.0349  
Iteration 4:   log likelihood = -3720.0347  

Generalized linear models                         Number of obs   =     48,105
Optimization     : ML                             Residual df     =     48,066
                                                  Scale parameter =          1
Deviance         =  7440.069454                   (1/df) Deviance =   .1547886
Pearson          =  48005.62935                   (1/df) Pearson  =    .998744

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1562846
Log likelihood   = -3720.034727                   BIC             =  -510766.3

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.533086   .1161475     5.64   0.000     1.321536    1.778501
             |
        male |
          M  |   1.092282   .0806306     1.20   0.232     .9451487    1.262319
             |
         imd |
          2  |   1.022885   .1097296     0.21   0.833      .828924    1.262232
          3  |   .9827671   .1065938    -0.16   0.873     .7945602    1.215554
          4  |   1.123973   .1170257     1.12   0.262     .9164962    1.378419
5 most de..  |   1.039104   .1412912     0.28   0.778     .7960084    1.356439
             |
        eth5 |
South Asian  |   1.057161   .1760775     0.33   0.739     .7627243     1.46526
      Black  |    1.21695   .1932132     1.24   0.216     .8915149     1.66118
      Mixed  |   1.135579   .1804539     0.80   0.424     .8316749    1.550533
      Other  |   .9512943   .1208347    -0.39   0.694     .7416417    1.220213
             |
smoke_nomiss |
     Former  |   1.224587   .2900789     0.86   0.392     .7697647    1.948145
    Current  |   .9564248   .1109096    -0.38   0.701     .7619794     1.20049
             |
   obese4cat |
Obese I ..)  |   .8825374    .092776    -1.19   0.235     .7182096    1.084464
Obese II..)  |   .8765789   .0929625    -1.24   0.214     .7120652    1.079101
Obese II..)  |   .9247456   .0887994    -0.81   0.415     .7660991    1.116245
             |
household_~e |   .9199366   .0327609    -2.34   0.019     .8579161    .9864406
             |
         stp |
          2  |   1.068516   .1731702     0.41   0.683      .777732     1.46802
          3  |   1.183289   .1872078     1.06   0.287      .867806    1.613464
          4  |   .8663781   .1485522    -0.84   0.403     .6190953    1.212432
          5  |   1.044144   .1703029     0.26   0.791     .7584502    1.437454
          6  |   1.050367   .1718957     0.30   0.764     .7621485    1.447581
          7  |   1.054299   .1719834     0.32   0.746     .7657924    1.451499
          8  |   1.015812    .166818     0.10   0.924      .736254    1.401518
          9  |   .8285973   .1427291    -1.09   0.275     .5911814    1.161359
         10  |    .933604   .1561515    -0.41   0.681     .6726569    1.295782
             |
rural_urban5 |
Urban min..  |   1.063782   .1746906     0.38   0.707     .7710301    1.467689
Urban cit..  |   1.000078   .1439031     0.00   1.000     .7543152    1.325912
Rural tow..  |   1.002999   .1443261     0.02   0.983     .7565149    1.329793
Rural vil..  |   1.052076   .1371187     0.39   0.697     .8149083    1.358268
             |
  comorb_cat |
1 comorbi..  |    .967143   .1515078    -0.21   0.831     .7114521    1.314727
2+ comorb..  |   .8901546     .12742    -0.81   0.416     .6723901    1.178446
             |
  start_week |
23Nov-29Nov  |   .9451912   .1082133    -0.49   0.622     .7552088    1.182966
30Nov-06Dec  |   .9086388    .105918    -0.82   0.411     .7230504    1.141863
07Dec-13Dec  |   1.061573   .1207259     0.53   0.599     .8494699    1.326635
14Dec-20Dec  |   1.127317   .1389034     0.97   0.331     .8854507     1.43525
             |
        age1 |   .9989564    .007772    -0.13   0.893     .9838392    1.014306
        age2 |   1.020298    .025735     0.80   0.426     .9710847    1.072005
        age3 |   .9238441   .0661304    -1.11   0.268     .8029124     1.06299
       _cons |   .0144235   .0040761   -15.00   0.000     .0082894    .0250969
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     48,105
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0118344   .0007017    16.86   0.000      .010459    .0132098
        VOC  |   .0181432    .000855    21.22   0.000     .0164674     .019819
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =     48,105
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               smoke_nomiss     (asbalanced)
               obese4cat        (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |    .013399   .0016013     8.37   0.000     .0102605    .0165374
        VOC  |   .0205418   .0023474     8.75   0.000      .015941    .0251425
------------------------------------------------------------------------------

. 
. 
. 
. **************************************************
. /* Fully adjusted RR - age grouped, cat hh size */
. **************************************************
. 
. glm risk_28 i.sgtf i.agegroup i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.ob
> ese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7554.1049  
Iteration 1:   log likelihood = -3646.8041  
Iteration 2:   log likelihood =   -3633.07  
Iteration 3:   log likelihood = -3632.6987  
Iteration 4:   log likelihood = -3632.6985  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,941
                                                  Scale parameter =          1
Deviance         =  7267.416604                   (1/df) Deviance =   .1548202
Pearson          =  46794.25616                   (1/df) Pearson  =   .9968739

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =    .156466
Log likelihood   = -3632.698455                   BIC             =  -497703.3

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.536164   .1177427     5.60   0.000     1.321891    1.785171
             |
    agegroup |
     18-<30  |   .9191311   .1161522    -0.67   0.505     .7174798    1.177458
     30-<40  |   .9281149   .1227878    -0.56   0.573     .7161261    1.202857
     40-<50  |    1.09485   .1390619     0.71   0.476     .8535705    1.404331
     50-<60  |   .9497479   .1238856    -0.40   0.693     .7354907    1.226421
     60-<70  |   1.088034   .1454621     0.63   0.528      .837227    1.413976
     70-<80  |   1.035463   .1550888     0.23   0.816      .772047    1.388753
        80+  |    .644114   .1430863    -1.98   0.048     .4167476    .9955253
             |
        male |
          M  |   1.094172   .0816794     1.21   0.228     .9452438    1.266565
             |
         imd |
          2  |   1.023111   .1108623     0.21   0.833     .8273483    1.265195
          3  |   .9780203   .1071818    -0.20   0.839     .7889768     1.21236
          4  |   1.125564   .1183059     1.13   0.260     .9160135    1.383051
5 most de..  |   1.017747   .1409912     0.13   0.899     .7757482     1.33524
             |
        eth5 |
South Asian  |   1.076464   .1793734     0.44   0.658     .7765372    1.492234
      Black  |     1.2122   .1947867     1.20   0.231     .8847001    1.660935
      Mixed  |   1.080527   .1779098     0.47   0.638     .7825006    1.492062
      Other  |   .9493224   .1215054    -0.41   0.685     .7386981    1.220002
             |
smoke_nomiss |
     Former  |   1.262708   .2990982     0.98   0.325     .7937398    2.008757
    Current  |   .9594623   .1126143    -0.35   0.724     .7622904    1.207634
             |
   obese4cat |
Obese I ..)  |   .9018639   .0954175    -0.98   0.329     .7329657    1.109682
Obese II..)  |   .8585688   .0930838    -1.41   0.160     .6942087    1.061842
Obese II..)  |   .9410132   .0909356    -0.63   0.529     .7786444     1.13724
             |
hh_total_cat |
        3-5  |   .8101202   .0606471    -2.81   0.005     .6995631    .9381493
       6-10  |          1  (empty)
             |
         stp |
          2  |   1.056643   .1741585     0.33   0.738      .764947    1.459572
          3  |   1.203208   .1923006     1.16   0.247     .8796279    1.645821
          4  |    .894387   .1543183    -0.65   0.518     .6377617    1.254274
          5  |   1.030525   .1710054     0.18   0.856     .7444061    1.426615
          6  |   1.055255   .1751087     0.32   0.746      .762271     1.46085
          7  |   1.068226   .1760553     0.40   0.689     .7733494    1.475538
          8  |   1.040297   .1720273     0.24   0.811     .7523151    1.438518
          9  |   .8246242   .1442508    -1.10   0.270     .5852698    1.161866
         10  |   .9317224   .1581025    -0.42   0.677     .6681093    1.299348
             |
rural_urban5 |
Urban min..  |   1.017803   .1688767     0.11   0.915     .7352415    1.408956
Urban cit..  |   .9784106   .1412924    -0.15   0.880     .7372232    1.298504
Rural tow..  |   .9635504   .1394995    -0.26   0.798      .725505    1.279701
Rural vil..  |   1.029979   .1344381     0.23   0.821     .7974902    1.330245
             |
  comorb_cat |
1 comorbi..  |   .9696677   .1533402    -0.19   0.846     .7112406    1.321993
2+ comorb..  |   .8897417   .1286096    -0.81   0.419     .6702322    1.181143
             |
  start_week |
23Nov-29Nov  |   .9397826   .1081132    -0.54   0.589     .7500748    1.177471
30Nov-06Dec  |   .8933046   .1050372    -0.96   0.337     .7094356    1.124828
07Dec-13Dec  |    1.03827   .1191818     0.33   0.744     .8290906    1.300226
14Dec-20Dec  |   1.096669   .1366627     0.74   0.459      .859018    1.400068
             |
       _cons |   .0143489   .0036501   -16.68   0.000     .0087154    .0236236
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0118468   .0007114    16.65   0.000     .0104526     .013241
        VOC  |   .0181986   .0008664    21.00   0.000     .0165005    .0198968
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Adjusted predictions                            Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               agegroup         (asbalanced)
               male             (asbalanced)
               imd              (asbalanced)
               eth5             (asbalanced)
               smoke_nomiss     (asbalanced)
               obese4cat        (asbalanced)
               hh_total_cat     (asbalanced)
               stp              (asbalanced)
               rural_urban5     (asbalanced)
               comorb_cat       (asbalanced)
               start_week       (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |          .  (not estimable)
        VOC  |          .  (not estimable)
------------------------------------------------------------------------------

. 
. 
. 
. ***********************
. /* Subgroup analyses */
. ***********************
. 
. /* Fully adjusted RR - age grouped, cat hh size */
. 
. glm risk_28 i.sgtf i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7553.7284  
Iteration 1:   log likelihood = -3646.1049  
Iteration 2:   log likelihood = -3632.0934  
Iteration 3:   log likelihood = -3631.7074  
Iteration 4:   log likelihood = -3631.7072  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,944
                                                  Scale parameter =          1
Deviance         =  7265.434502                   (1/df) Deviance =   .1547681
Pearson          =  46843.83961                   (1/df) Pearson  =   .9978664

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1562961
Log likelihood   = -3631.707156                   BIC             =  -497737.6

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.536245   .1177421     5.60   0.000     1.321971    1.785249
             |
   agegroupA |
     50-<65  |   .9788513   .0959607    -0.22   0.827     .8077371    1.186215
     65-<75  |   1.218652   .1422073     1.69   0.090     .9695075    1.531823
     75-<85  |   .7859459   .1408963    -1.34   0.179     .5530927    1.116831
        85+  |   .5316875   .1782613    -1.88   0.060     .2755943    1.025753
             |
        male |
          M  |   1.094486    .081701     1.21   0.226     .9455183    1.266924
             |
         imd |
          2  |   1.022005     .11074     0.20   0.841     .8264578    1.263821
          3  |   .9771836   .1070841    -0.21   0.833     .7883112    1.211308
          4  |    1.12597   .1183482     1.13   0.259      .916345     1.38355
5 most de..  |   1.012796   .1403149     0.09   0.927     .7719598    1.328768
             |
        eth5 |
South Asian  |   1.080006   .1799662     0.46   0.644     .7790887    1.497152
      Black  |   1.209841   .1943766     1.19   0.236     .8830229     1.65762
      Mixed  |   1.081489   .1780586     0.48   0.634     .7832106    1.493364
      Other  |   .9492735   .1214947    -0.41   0.684     .7386668    1.219928
             |
smoke_nomiss |
     Former  |   1.262179   .2989557     0.98   0.326     .7934293    2.007862
    Current  |   .9599274    .112662    -0.35   0.727     .7626706    1.208203
             |
   obese4cat |
Obese I ..)  |   .9017648   .0954022    -0.98   0.328     .7328928    1.109548
Obese II..)  |   .8578857    .093009    -1.41   0.157     .6936574    1.060996
Obese II..)  |   .9409481   .0909234    -0.63   0.529     .7786001    1.137148
             |
hh_total_cat |
        3-5  |   .8097129   .0606148    -2.82   0.005     .6992144    .9376737
       6-10  |          1  (empty)
             |
         stp |
          2  |   1.054124   .1737374     0.32   0.749     .7631313    1.456076
          3  |   1.204862   .1925564     1.17   0.244     .8808488     1.64806
          4  |   .8929218   .1540594    -0.66   0.512     .6367255    1.252203
          5  |   1.028563   .1706555     0.17   0.865      .743024    1.423834
          6  |   1.054051   .1748904     0.32   0.751     .7614274    1.459133
          7  |   1.065844   .1756601     0.39   0.699     .7716288    1.472241
          8  |   1.037513   .1715534     0.22   0.824     .7503205    1.434631
          9  |   .8235878   .1440661    -1.11   0.267      .584539    1.160396
         10  |   .9278148   .1574334    -0.44   0.659     .6653158    1.293882
             |
rural_urban5 |
Urban min..  |   1.015565   .1684839     0.09   0.926     .7336555      1.4058
Urban cit..  |   .9767794   .1410397    -0.16   0.871     .7360194    1.296295
Rural tow..  |    .960812   .1390957    -0.28   0.782      .723454    1.276045
Rural vil..  |   1.027623   .1341151     0.21   0.835     .7956893    1.327163
             |
  comorb_cat |
1 comorbi..  |   .9712998   .1535955    -0.18   0.854     .7124419    1.324211
2+ comorb..  |    .892533   .1290021    -0.79   0.432     .6723509    1.184821
             |
  start_week |
23Nov-29Nov  |   .9406529   .1082027    -0.53   0.595     .7507862    1.178535
30Nov-06Dec  |   .8922278   .1049056    -0.97   0.332     .7085881     1.12346
07Dec-13Dec  |   1.039489   .1193192     0.34   0.736     .8300674    1.301746
14Dec-20Dec  |   1.100133   .1370716     0.77   0.444     .8617664    1.404434
             |
       _cons |   .0141388   .0034795   -17.31   0.000     .0087284    .0229029
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_no_int

. 
. * Constant VOC effect over subgroups
. lincom 1.sgtf, eform

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.536245   .1177421     5.60   0.000     1.321971    1.785249
------------------------------------------------------------------------------

. margins sgtf

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0118466   .0007113    16.65   0.000     .0104525    .0132408
        VOC  |   .0181993   .0008664    21.01   0.000     .0165012    .0198975
------------------------------------------------------------------------------

. 
. 
. /* Age group */
. glm risk_28 i.sgtf##i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.
> obese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7552.5774  
Iteration 1:   log likelihood =   -3643.55  
Iteration 2:   log likelihood = -3628.9631  
Iteration 3:   log likelihood = -3628.5064  
Iteration 4:   log likelihood = -3628.5059  
Iteration 5:   log likelihood = -3628.5059  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,940
                                                  Scale parameter =          1
Deviance         =  7259.027346                   (1/df) Deviance =   .1546448
Pearson          =  46869.15286                   (1/df) Pearson  =   .9984907

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1563301
Log likelihood   = -3628.505924                   BIC             =    -497701

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    1.50028   .1444469     4.21   0.000     1.242277    1.811865
             |
   agegroupA |
     50-<65  |    1.12252   .1668042     0.78   0.437     .8388944    1.502038
     65-<75  |    .937518   .1959216    -0.31   0.758     .6224384    1.412092
     75-<85  |   .5960017   .1930611    -1.60   0.110     .3158787    1.124539
        85+  |    .434557   .2523561    -1.44   0.151     .1392313    1.356303
             |
        sgtf#|
   agegroupA |
 VOC#50-<65  |   .7894801   .1562576    -1.19   0.232     .5356331     1.16363
 VOC#65-<75  |   1.492468   .3762504     1.59   0.112     .9105784    2.446203
 VOC#75-<85  |   1.529254   .5948578     1.09   0.275     .7134676    3.277817
    VOC#85+  |   1.375905   .9784488     0.45   0.654     .3414069    5.545036
             |
        male |
          M  |   1.093816   .0816476     1.20   0.230     .9449452    1.266141
             |
         imd |
          2  |   1.021147   .1106419     0.19   0.847     .8257724    1.262748
          3  |   .9751598   .1068589    -0.23   0.818     .7866841    1.208791
          4  |   1.126051    .118352     1.13   0.259     .9164183    1.383638
5 most de..  |   1.009416   .1398504     0.07   0.946     .7693783    1.324344
             |
        eth5 |
South Asian  |   1.081622   .1802246     0.47   0.638     .7802696    1.499362
      Black  |   1.208349   .1941346     1.18   0.239     .8819371    1.655569
      Mixed  |   1.080446   .1778806     0.47   0.638     .7824645    1.491907
      Other  |    .946887   .1211831    -0.43   0.670     .7368192    1.216845
             |
smoke_nomiss |
     Former  |   1.253464   .2968885     0.95   0.340      .787954    1.993988
    Current  |   .9585848   .1124999    -0.36   0.719     .7616111    1.206502
             |
   obese4cat |
Obese I ..)  |   .9015553   .0953763    -0.98   0.327     .7327285    1.109281
Obese II..)  |   .8581496   .0930296    -1.41   0.158     .6938837    1.061303
Obese II..)  |   .9397686   .0908035    -0.64   0.520     .7776337    1.135708
             |
hh_total_cat |
        3-5  |   .8089496   .0605545    -2.83   0.005     .6985608    .9367824
       6-10  |          1  (empty)
             |
         stp |
          2  |   1.056992   .1742029     0.34   0.737      .765218    1.460018
          3  |    1.20388   .1923903     1.16   0.246     .8801439    1.646692
          4  |   .8936969    .154187    -0.65   0.515     .6372867    1.253273
          5  |   1.030093   .1709021     0.18   0.858     .7441387    1.425931
          6  |   1.058865   .1756891     0.34   0.730      .764905    1.465797
          7  |   1.066967   .1758358     0.39   0.694     .7724549    1.473767
          8  |   1.039255   .1718307     0.23   0.816     .7515959    1.437011
          9  |   .8260413   .1444912    -1.09   0.275     .5862859    1.163842
         10  |   .9310336   .1579737    -0.42   0.674     .6676321    1.298355
             |
rural_urban5 |
Urban min..  |   1.016328   .1686008     0.10   0.922     .7342204     1.40683
Urban cit..  |   .9782438   .1412435    -0.15   0.879     .7371342    1.298218
Rural tow..  |   .9610221   .1391178    -0.27   0.784     .7236245    1.276302
Rural vil..  |   1.027267   .1340584     0.21   0.837     .7954292    1.326677
             |
  comorb_cat |
1 comorbi..  |   .9698218   .1533538    -0.19   0.846     .7113692    1.322175
2+ comorb..  |   .8909657   .1287688    -0.80   0.424     .6711803    1.182722
             |
  start_week |
23Nov-29Nov  |   .9402618   .1081538    -0.54   0.592       .75048    1.178036
30Nov-06Dec  |   .8938636   .1050979    -0.95   0.340     .7098873     1.12552
07Dec-13Dec  |   1.039766   .1193438     0.34   0.734     .8302998    1.302075
14Dec-20Dec  |   1.102115   .1373142     0.78   0.435      .863325    1.406952
             |
       _cons |   .0143661   .0035717   -17.07   0.000     .0088249    .0233865
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_ageX

. 
. lrtest e_no_int e_ageX

Likelihood-ratio test                                 LR chi2(4)  =      6.40
(Assumption: e_no_int nested in e_ageX)               Prob > chi2 =    0.1710

. 
. * Age group VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // <50

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.50028   .1444469     4.21   0.000     1.242277    1.811865
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.agegroupA, eform       // 50-<65

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.184441   .2048724     0.98   0.328     .8438813    1.662438
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.agegroupA, eform       // 65-<75

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.239119   .5216395     3.46   0.001     1.418325    3.534911
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.agegroupA, eform       // 75-<85

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.294308   .8646743     2.20   0.028     1.096106    4.802318
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.agegroupA, eform       // 85+

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.agegroupA = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.064242    1.45445     1.03   0.304     .5188122    8.213173
------------------------------------------------------------------------------

. 
. * Age group marginal risks
. margins sgtf, over(agegroupA)

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : agegroupA

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   agegroupA#|
        sgtf |
      0-<50 #|
    non-VOC  |    .012094   .0009086    13.31   0.000     .0103132    .0138748
  0-<50#VOC  |   .0181444    .001092    16.62   0.000     .0160041    .0202847
     50-<65 #|
    non-VOC  |   .0136434   .0017491     7.80   0.000     .0102153    .0170715
 50-<65#VOC  |   .0161598   .0018757     8.62   0.000     .0124835    .0198362
     65-<75 #|
    non-VOC  |   .0112658   .0021967     5.13   0.000     .0069604    .0155713
 65-<75#VOC  |   .0252256   .0032143     7.85   0.000     .0189257    .0315254
     75-<85 #|
    non-VOC  |   .0071836   .0022633     3.17   0.002     .0027477    .0116196
 75-<85#VOC  |   .0164815   .0034076     4.84   0.000     .0098028    .0231602
85+#non-VOC  |   .0052467   .0030211     1.74   0.082    -.0006745    .0111678
    85+#VOC  |   .0108304    .004397     2.46   0.014     .0022124    .0194484
------------------------------------------------------------------------------

. 
. 
. /* Ethnicity */
. *Figure out missings first
. 
. 
. /* Comorbidities */
. glm risk_28 i.sgtf##ib0.comorb_cat i.agegroupA i.male ib1.imd ib1.eth5 ib1.sm
> oke_nomiss ib1.obese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib1.start_wee
> k, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7553.3563  
Iteration 1:   log likelihood = -3645.2149  
Iteration 2:   log likelihood = -3630.7704  
Iteration 3:   log likelihood = -3630.3851  
Iteration 4:   log likelihood = -3630.3848  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,942
                                                  Scale parameter =          1
Deviance         =  7262.808649                   (1/df) Deviance =   .1547188
Pearson          =  46841.28769                   (1/df) Pearson  =   .9978545

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1563249
Log likelihood   = -3630.384839                   BIC             =  -497718.7

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    1.14484    .316967     0.49   0.625     .6653901     1.96976
             |
  comorb_cat |
1 comorbi..  |   .8874192   .2124394    -0.50   0.618     .5550851    1.418725
2+ comorb..  |   .7132814    .156602    -1.54   0.124     .4638508    1.096841
             |
        sgtf#|
  comorb_cat |
        VOC #|
1 comorbi..  |   1.164265   .3712954     0.48   0.633      .623154    2.175245
        VOC #|
2+ comorb..  |   1.452383   .4239929     1.28   0.201     .8195786    2.573782
             |
   agegroupA |
     50-<65  |   .9789981    .095972    -0.22   0.829     .8078633    1.186385
     65-<75  |     1.2184    .142178     1.69   0.090     .9693066    1.531506
     75-<85  |   .7848339   .1406959    -1.35   0.177     .5523118    1.115247
        85+  |   .5305957   .1778953    -1.89   0.059     .2750283    1.023646
             |
        male |
          M  |   1.095715   .0817955     1.22   0.221     .9465751    1.268353
             |
         imd |
          2  |   1.021532   .1106877     0.20   0.844     .8260765    1.263233
          3  |   .9779779    .107169    -0.20   0.839     .7889554    1.212287
          4  |   1.126478   .1184005     1.13   0.257     .9167604    1.384172
5 most de..  |   1.012357   .1402552     0.09   0.929     .7716238    1.328195
             |
        eth5 |
South Asian  |     1.0825   .1803876     0.48   0.634     .7808796    1.500625
      Black  |   1.208963   .1942345     1.18   0.238     .8823837    1.656414
      Mixed  |   1.082534   .1782277     0.48   0.630     .7839713    1.494799
      Other  |   .9502812   .1216222    -0.40   0.690     .7394532    1.221219
             |
smoke_nomiss |
     Former  |   1.262347   .2989804     0.98   0.325     .7935536    2.008082
    Current  |   .9602121   .1126945    -0.35   0.729     .7628982    1.208559
             |
   obese4cat |
Obese I ..)  |   .9018404    .095409    -0.98   0.329     .7329562    1.109638
Obese II..)  |   .8571251    .092925    -1.42   0.155      .693045    1.060052
Obese II..)  |   .9393983   .0907738    -0.65   0.518     .7773175    1.135275
             |
hh_total_cat |
        3-5  |    .809576   .0606035    -2.82   0.005     .6990981    .9375127
       6-10  |          1  (empty)
             |
         stp |
          2  |   1.053079   .1735694     0.31   0.754     .7623686    1.454644
          3  |   1.205745   .1926985     1.17   0.242     .8814937    1.649271
          4  |   .8933398   .1541292    -0.65   0.513     .6370266    1.252783
          5  |   1.027866   .1705383     0.17   0.868     .7425218    1.422864
          6  |   1.053594   .1748118     0.31   0.753     .7611014    1.458493
          7  |   1.066894    .175831     0.39   0.694      .772392    1.473685
          8  |   1.036495    .171384     0.22   0.828     .7495857     1.43322
          9  |   .8235184   .1440528    -1.11   0.267     .5844914    1.160295
         10  |   .9288689   .1576156    -0.43   0.664     .6660669    1.295362
             |
rural_urban5 |
Urban min..  |    1.01499    .168384     0.09   0.929     .7332466    1.404992
Urban cit..  |   .9757273   .1408867    -0.17   0.865     .7352283    1.294896
Rural tow..  |   .9598859   .1389586    -0.28   0.777     .7227611    1.274807
Rural vil..  |   1.026936   .1340229     0.20   0.839      .795161    1.326269
             |
  start_week |
23Nov-29Nov  |   .9397555   .1080994    -0.54   0.589     .7500699    1.177411
30Nov-06Dec  |     .89065   .1047213    -0.98   0.325     .7073332    1.121476
07Dec-13Dec  |   1.040124   .1193903     0.34   0.732     .8305775    1.302537
14Dec-20Dec  |   1.100513    .137116     0.77   0.442     .8620686    1.404911
             |
       _cons |    .016856   .0048282   -14.25   0.000     .0096148    .0295509
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_comorbX

. 
. * Test for interaction
. lrtest e_no_int e_comorbX

Likelihood-ratio test                                 LR chi2(2)  =      2.64
(Assumption: e_no_int nested in e_comorbX)            Prob > chi2 =    0.2665

. 
. * Comorbidities VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // no comorbs

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.14484    .316967     0.49   0.625     .6653901     1.96976
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.comorb_cat, eform      // 1 comorb

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#1.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.332897   .2109953     1.82   0.069     .9773564    1.817776
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.comorb_cat, eform      // 2+ comorbs

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.comorb_cat = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.662746    .153856     5.50   0.000     1.386958    1.993374
------------------------------------------------------------------------------

. 
. * Comorbidity marginal risks
. margins sgtf, over(comorb_cat)

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : comorb_cat

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  comorb_cat#|
        sgtf |
No comorb.. #|
    non-VOC  |   .0153361   .0031723     4.83   0.000     .0091185    .0215537
No comorb.. #|
        VOC  |   .0175574   .0032303     5.44   0.000     .0112262    .0238886
1 comorbi.. #|
    non-VOC  |   .0137042   .0016501     8.30   0.000       .01047    .0169385
1 comorbi.. #|
        VOC  |   .0182663   .0018762     9.74   0.000     .0145891    .0219436
2+ comorb.. #|
    non-VOC  |   .0109753   .0008068    13.60   0.000     .0093941    .0125565
2+ comorb.. #|
        VOC  |   .0182491   .0010251    17.80   0.000       .01624    .0202583
------------------------------------------------------------------------------

. 
. 
. /* IMD */
. glm risk_28 i.sgtf##ib1.imd i.agegroup i.male ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t ib1.start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7553.8138  
Iteration 1:   log likelihood = -3646.0496  
Iteration 2:   log likelihood =   -3632.01  
Iteration 3:   log likelihood = -3631.6353  
Iteration 4:   log likelihood = -3631.6351  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,937
                                                  Scale parameter =          1
Deviance         =  7265.276682                   (1/df) Deviance =   .1547878
Pearson          =  46813.32855                   (1/df) Pearson  =   .9973652

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =    .156591
Log likelihood   =  -3631.63511                   BIC             =  -497662.4

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.546174   .2190285     3.08   0.002     1.171328    2.040978
             |
         imd |
          2  |   1.131089   .1925198     0.72   0.469      .810244    1.578984
          3  |    .871007   .1585594    -0.76   0.448     .6096318    1.244445
          4  |   1.150846   .1958199     0.83   0.409     .8244849    1.606393
5 most de..  |   1.015934   .2251819     0.07   0.943      .657956     1.56868
             |
    sgtf#imd |
      VOC#2  |   .8445632   .1865905    -0.76   0.444     .5477408    1.302235
      VOC#3  |   1.204275   .2745399     0.82   0.415     .7703291    1.882673
      VOC#4  |    .964742   .2087629    -0.17   0.868     .6312735    1.474364
        VOC #|
5 most de..  |   1.003175   .2848785     0.01   0.991     .5749828    1.750242
             |
    agegroup |
     18-<30  |   .9185659   .1160799    -0.67   0.501     .7170399    1.176731
     30-<40  |   .9283131   .1228134    -0.56   0.574     .7162798    1.203112
     40-<50  |   1.094865   .1390726     0.71   0.476      .853569    1.404373
     50-<60  |   .9497216   .1238811    -0.40   0.692     .7354719    1.226384
     60-<70  |   1.088806   .1455756     0.64   0.525     .8378053    1.415005
     70-<80  |   1.034558   .1549565     0.23   0.821     .7713681    1.387549
        80+  |   .6438906   .1430369    -1.98   0.048     .4166027    .9951808
             |
        male |
          M  |   1.094434   .0816973     1.21   0.227     .9454727    1.266864
             |
        eth5 |
South Asian  |   1.075621    .179241     0.44   0.662     .7759174    1.491088
      Black  |   1.212716   .1948673     1.20   0.230     .8850794    1.661635
      Mixed  |   1.079545   .1777532     0.46   0.642     .7817816    1.490719
      Other  |   .9502792   .1216351    -0.40   0.690     .7394316     1.22125
             |
smoke_nomiss |
     Former  |   1.262402   .2990331     0.98   0.325      .793539    2.008294
    Current  |   .9590338   .1125679    -0.36   0.722     .7619438    1.207105
             |
   obese4cat |
Obese I ..)  |   .9010619   .0953321    -0.98   0.325     .7323147    1.108693
Obese II..)  |   .8578845   .0930074    -1.41   0.157      .693659    1.060991
Obese II..)  |   .9407673   .0909153    -0.63   0.527     .7784352    1.136951
             |
hh_total_cat |
        3-5  |   .8103438   .0606679    -2.81   0.005     .6997493    .9384176
       6-10  |          1  (empty)
             |
         stp |
          2  |   1.057615   .1743249     0.34   0.734     .7656414    1.460931
          3  |   1.206257   .1928015     1.17   0.241     .8818374    1.650028
          4  |   .8951943   .1544583    -0.64   0.521     .6383365    1.255408
          5  |   1.031127   .1711086     0.18   0.853     .7448365    1.427458
          6  |   1.056577   .1753392     0.33   0.740     .7632097     1.46271
          7  |    1.06961   .1762894     0.41   0.683     .7743435    1.477467
          8  |   1.040241   .1720223     0.24   0.811     .7522683    1.438452
          9  |   .8261673   .1445251    -1.09   0.275      .586359    1.164052
         10  |   .9317099   .1581028    -0.42   0.677     .6680968    1.299338
             |
rural_urban5 |
Urban min..  |   1.018091   .1689246     0.11   0.914     .7354498    1.409356
Urban cit..  |     .97841   .1412953    -0.15   0.880     .7372184    1.298511
Rural tow..  |   .9633108   .1394676    -0.26   0.796     .7253204     1.27939
Rural vil..  |   1.030247   .1344813     0.23   0.819     .7976848    1.330611
             |
  comorb_cat |
1 comorbi..  |   .9690422   .1532403    -0.20   0.842     .7107833    1.321138
2+ comorb..  |   .8900283   .1286485    -0.81   0.420     .6704517    1.181517
             |
  start_week |
23Nov-29Nov  |   .9400406   .1081487    -0.54   0.591     .7502717    1.177808
30Nov-06Dec  |   .8934807   .1050587    -0.96   0.338     .7095743    1.125052
07Dec-13Dec  |   1.039475   .1193244     0.34   0.736      .830046    1.301745
14Dec-20Dec  |   1.097212   .1367292     0.74   0.457     .8594444    1.400758
             |
       _cons |   .0142715   .0037809   -16.04   0.000     .0084911    .0239868
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_imdX

. 
. * Test for interaction
. lrtest e_no_int e_imdX

Likelihood-ratio test                                 LR chi2(7)  =      0.14
(Assumption: e_no_int nested in e_imdX)               Prob > chi2 =    1.0000

. 
. * IMD VOC vs. non-VOC RR
. lincom 1.sgtf, eform                            // 1 least deprived

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.546174   .2190285     3.08   0.002     1.171328    2.040978
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.imd, eform     // 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.305842   .2213627     1.57   0.115     .9366932    1.820472
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.imd, eform     // 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.862019   .3325791     3.48   0.001     1.312047    2.642524
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.imd, eform     // 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.491659    .244021     2.44   0.015     1.082484    2.055502
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.imd, eform     // 5 most deprived

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.imd = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.551083   .3817313     1.78   0.074     .9575222    2.512587
------------------------------------------------------------------------------

. 
. * Epi week marginal risks
. margins sgtf, over(imd)

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : imd

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    imd#sgtf |
1 least d.. #|
    non-VOC  |   .0114745   .0012834     8.94   0.000     .0089592    .0139899
1 least d.. #|
        VOC  |   .0177417   .0015418    11.51   0.000     .0147198    .0207635
  2#non-VOC  |   .0129661   .0016627     7.80   0.000     .0097072     .016225
      2#VOC  |   .0169317   .0018764     9.02   0.000     .0132539    .0206094
  3#non-VOC  |   .0100363   .0014411     6.96   0.000     .0072118    .0128609
      3#VOC  |   .0186878   .0019842     9.42   0.000     .0147988    .0225769
  4#non-VOC  |   .0132419   .0016978     7.80   0.000     .0099142    .0165696
      4#VOC  |   .0197524   .0020059     9.85   0.000      .015821    .0236839
5 most de.. #|
    non-VOC  |   .0116711   .0022327     5.23   0.000     .0072952    .0160471
5 most de.. #|
        VOC  |   .0181029   .0028012     6.46   0.000     .0126127    .0235932
------------------------------------------------------------------------------

. 
. 
. 
. /* Epi week */
. glm risk_28 i.sgtf##ib1.start_week i.agegroupA i.male ib1.imd ib1.eth5 ib1.sm
> oke_nomiss ib1.obese4cat ///
>                         ib1.hh_total_cat i.stp ib1.rural_urban5 ib0.comorb_ca
> t, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7553.2904  
Iteration 1:   log likelihood = -3645.0133  
Iteration 2:   log likelihood =  -3630.824  
Iteration 3:   log likelihood = -3630.4226  
Iteration 4:   log likelihood = -3630.4223  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,940
                                                  Scale parameter =          1
Deviance         =  7262.873787                   (1/df) Deviance =   .1547268
Pearson          =  46794.29173                   (1/df) Pearson  =   .9968959

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1564116
Log likelihood   = -3630.422316                   BIC             =  -497697.1

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.680782   .2895127     3.01   0.003     1.199204    2.355753
             |
  start_week |
23Nov-29Nov  |   .9212143   .1764389    -0.43   0.668     .6328944    1.340881
30Nov-06Dec  |   1.044612   .1967414     0.23   0.817     .7221713    1.511018
07Dec-13Dec  |   1.177751   .2177667     0.88   0.376     .8197211    1.692159
14Dec-20Dec  |   1.097294   .2277848     0.45   0.655     .7305066    1.648246
             |
        sgtf#|
  start_week |
        VOC #|
23Nov-29Nov  |   1.035118   .2479627     0.14   0.885     .6472681    1.655371
        VOC #|
30Nov-06Dec  |   .7715653   .1862825    -1.07   0.283      .480688     1.23846
        VOC #|
07Dec-13Dec  |    .815125   .1924637    -0.87   0.387     .5131476     1.29481
        VOC #|
14Dec-20Dec  |   1.004421   .2606639     0.02   0.986      .603969    1.670385
             |
   agegroupA |
     50-<65  |   .9793561   .0960098    -0.21   0.831     .8081543    1.186826
     65-<75  |   1.218008   .1421329     1.69   0.091     .9689938    1.531015
     75-<85  |   .7857483   .1408595    -1.35   0.179     .5529556    1.116546
        85+  |   .5313772   .1781616    -1.89   0.059     .2754291     1.02517
             |
        male |
          M  |   1.094665   .0817137     1.21   0.226     .9456734    1.267129
             |
         imd |
          2  |   1.023236   .1108745     0.21   0.832     .8274511    1.265346
          3  |   .9777818     .10715    -0.21   0.838     .7887933     1.21205
          4  |   1.127174   .1184756     1.14   0.255     .9173236    1.385031
5 most de..  |   1.012966   .1403442     0.09   0.926     .7720813    1.329006
             |
        eth5 |
South Asian  |   1.079205   .1798317     0.46   0.647     .7785122    1.496038
      Black  |    1.20876   .1942063     1.18   0.238     .8822285    1.656147
      Mixed  |   1.080592   .1779221     0.47   0.638     .7825451    1.492156
      Other  |   .9505632   .1216601    -0.40   0.692     .7396698    1.221586
             |
smoke_nomiss |
     Former  |   1.265849   .2998246     1.00   0.320     .7957369    2.013699
    Current  |   .9603125   .1127044    -0.35   0.730      .762981     1.20868
             |
   obese4cat |
Obese I ..)  |   .9019088   .0954158    -0.98   0.329     .7330123    1.109721
Obese II..)  |    .857921   .0930118    -1.41   0.158     .6936876    1.061037
Obese II..)  |   .9410304   .0909333    -0.63   0.529     .7786649    1.137252
             |
hh_total_cat |
        3-5  |   .8097379   .0606159    -2.82   0.005     .6992375    .9377008
       6-10  |          1  (empty)
             |
         stp |
          2  |   1.052529   .1734746     0.31   0.756     .7619767    1.453873
          3  |   1.200196   .1918478     1.14   0.254     .8773851    1.641778
          4  |   .8927669   .1540295    -0.66   0.511     .6366193    1.251977
          5  |   1.028623   .1706633     0.17   0.865     .7430704    1.423911
          6  |   1.052501    .174628     0.31   0.758      .760315    1.456973
          7  |   1.067063   .1758554     0.39   0.694     .7725194    1.473909
          8  |   1.036986   .1714641     0.22   0.826     .7499428    1.433897
          9  |   .8226507   .1439074    -1.12   0.264     .5838666     1.15909
         10  |   .9271279   .1573159    -0.45   0.656     .6648245    1.292922
             |
rural_urban5 |
Urban min..  |   1.011882   .1678851     0.07   0.943     .7309775    1.400735
Urban cit..  |   .9749147   .1407865    -0.18   0.860     .7345908    1.293861
Rural tow..  |   .9596572   .1389283    -0.28   0.776     .7225847    1.274511
Rural vil..  |   1.025682   .1338686     0.19   0.846     .7941758    1.324673
             |
  comorb_cat |
1 comorbi..  |   .9710511    .153553    -0.19   0.853      .712264    1.323863
2+ comorb..  |    .892798   .1290433    -0.78   0.433     .6725462     1.18518
             |
       _cons |   .0133814   .0035514   -16.25   0.000     .0079541    .0225117
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_weekX

. 
. * Test for interaction
. lrtest e_no_int e_weekX

Likelihood-ratio test                                 LR chi2(4)  =      2.57
(Assumption: e_no_int nested in e_weekX)              Prob > chi2 =    0.6322

. 
. * Epi week VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                            // week 1

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.680782   .2895127     3.01   0.003     1.199204    2.355753
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.start_week, eform      // week 2

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.739807   .2895695     3.33   0.001     1.255536    2.410866
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.start_week, eform      // week 3

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.296833   .2194235     1.54   0.124     .9308101    1.806787
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.start_week, eform      // week 4

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.370047   .2213057     1.95   0.051      .998251    1.880318
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.start_week, eform      // week 5

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.start_week = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.688212    .327705     2.70   0.007     1.153977    2.469772
------------------------------------------------------------------------------

. capture lincom 1.sgtf + 1.sgtf#6.start_week, eform      // week 6

. capture lincom 1.sgtf + 1.sgtf#7.start_week, eform      // week 7

. 
. * Epi week marginal risks
. margins sgtf, over(start_week)

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : start_week

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  start_week#|
        sgtf |
16Nov-22Nov #|
    non-VOC  |   .0113592    .001566     7.25   0.000     .0082899    .0144284
16Nov-22Nov #|
        VOC  |   .0190923   .0019709     9.69   0.000     .0152295    .0229551
23Nov-29Nov #|
    non-VOC  |   .0104456   .0013885     7.52   0.000     .0077241     .013167
23Nov-29Nov #|
        VOC  |   .0181733   .0018188     9.99   0.000     .0146084    .0217381
30Nov-06Dec #|
    non-VOC  |   .0118914   .0015258     7.79   0.000     .0089008     .014882
30Nov-06Dec #|
        VOC  |   .0154212      .0017     9.07   0.000     .0120893    .0187531
07Dec-13Dec #|
    non-VOC  |   .0133835   .0016487     8.12   0.000     .0101521    .0166148
07Dec-13Dec #|
        VOC  |    .018336   .0019146     9.58   0.000     .0145833    .0220886
14Dec-20Dec #|
    non-VOC  |   .0124713   .0019352     6.44   0.000     .0086783    .0162643
14Dec-20Dec #|
        VOC  |   .0210542   .0024542     8.58   0.000     .0162442    .0258643
------------------------------------------------------------------------------

. 
. 
. /* NHS region */
. /* No STP adjustment for these models */
. 
. glm risk_28 i.sgtf i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_nomiss ib1.o
> bese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week i.region, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7554.4924  
Iteration 1:   log likelihood = -3648.0011  
Iteration 2:   log likelihood = -3634.4531  
Iteration 3:   log likelihood = -3634.0947  
Iteration 4:   log likelihood = -3634.0945  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,945
                                                  Scale parameter =          1
Deviance         =  7270.244978                   (1/df) Deviance =   .1548673
Pearson          =  46845.52181                   (1/df) Pearson  =    .997881

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1563551
Log likelihood   = -3634.094491                   BIC             =  -497743.5

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.533759   .1175562     5.58   0.000     1.319824    1.782371
             |
   agegroupA |
     50-<65  |    .978785   .0959606    -0.22   0.827      .807672     1.18615
     65-<75  |   1.216879   .1420137     1.68   0.093     .9680756    1.529626
     75-<85  |   .7870193   .1410959    -1.34   0.182     .5538382    1.118376
        85+  |   .5284129   .1771592    -1.90   0.057     .2739012    1.019419
             |
        male |
          M  |   1.093437   .0816137     1.20   0.231     .9446266    1.265689
             |
         imd |
          2  |   1.023348   .1108821     0.21   0.831     .8275489    1.265473
          3  |   .9789064   .1072843    -0.19   0.846     .7896831    1.213471
          4  |   1.128924   .1186652     1.15   0.249     .9187388    1.387195
5 most de..  |    1.01426   .1405178     0.10   0.919     .7730761    1.330689
             |
        eth5 |
South Asian  |   1.081253   .1801859     0.47   0.639     .7799713    1.498913
      Black  |   1.213615   .1949897     1.20   0.228     .8857678    1.662809
      Mixed  |   1.085913   .1788044     0.50   0.617     .7863899     1.49952
      Other  |   .9509502   .1217184    -0.39   0.694     .7399577    1.222106
             |
smoke_nomiss |
     Former  |   1.262779   .2990902     0.99   0.325     .7938155    2.008792
    Current  |   .9579114   .1124408    -0.37   0.714      .761045    1.205703
             |
   obese4cat |
Obese I ..)  |   .9004006   .0952532    -0.99   0.321     .7317915    1.107858
Obese II..)  |   .8567194   .0928863    -1.43   0.154     .6927085    1.059563
Obese II..)  |   .9396202   .0907891    -0.64   0.519     .7775111    1.135529
             |
hh_total_cat |
        3-5  |   .8104345   .0606677    -2.81   0.005     .6998395    .9385067
       6-10  |          1  (empty)
             |
rural_urban5 |
Urban min..  |   1.015347    .168444     0.09   0.927     .7335026    1.405488
Urban cit..  |   .9758824   .1409196    -0.17   0.866     .7353296    1.295129
Rural tow..  |   .9600839   .1390085    -0.28   0.778     .7228789    1.275125
Rural vil..  |   1.026097   .1339323     0.20   0.844     .7944829    1.325233
             |
  comorb_cat |
1 comorbi..  |   .9792499   .1548485    -0.13   0.895     .7182792    1.335038
2+ comorb..  |   .8978242    .129766    -0.75   0.456     .6763382    1.191842
             |
  start_week |
23Nov-29Nov  |   .9429951   .1084702    -0.51   0.610     .7526584    1.181465
30Nov-06Dec  |   .8925976   .1049602    -0.97   0.334     .7088646    1.123953
07Dec-13Dec  |   1.040701   .1194764     0.35   0.728     .8310069    1.303308
14Dec-20Dec  |    1.09919   .1369785     0.76   0.448     .8609895     1.40329
             |
      region |
East Midl..  |   .9635384   .1639928    -0.22   0.827     .6902332    1.345062
     London  |   1.019403   .1484059     0.13   0.895     .7663501    1.356017
 North East  |   1.033138   .1720895     0.20   0.845     .7453733    1.431999
 North West  |   1.042816    .173686     0.25   0.801     .7523776    1.445371
 South East  |   1.129254   .1845249     0.74   0.457     .8197883    1.555541
 South West  |   .9126944   .1572165    -0.53   0.596     .6511805    1.279232
West Midl..  |   1.053575   .1743394     0.32   0.752     .7617517    1.457193
Yorkshire..  |   .9362314   .1606175    -0.38   0.701     .6688877    1.310428
             |
       _cons |   .0140217   .0034702   -17.24   0.000     .0086325    .0227752
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_region

. 
. 
. glm risk_28 i.sgtf##i.region i.agegroupA i.male ib1.imd ib1.eth5 ib1.smoke_no
> miss ib1.obese4cat ///
>                         ib1.hh_total_cat ib1.rural_urban5 ib0.comorb_cat ib1.
> start_week, ///
>                         family(bin) link(log) eform
note: 3.hh_total_cat != 0 predicts failure perfectly
      3.hh_total_cat dropped and 64 obs not used


Iteration 0:   log likelihood = -7553.5518  
Iteration 1:   log likelihood = -3645.7288  
Iteration 2:   log likelihood =  -3631.594  
Iteration 3:   log likelihood = -3631.2045  
Iteration 4:   log likelihood = -3631.2042  

Generalized linear models                         Number of obs   =     46,920
Optimization     : ML                             Residual df     =     46,937
                                                  Scale parameter =          1
Deviance         =  7264.456723                   (1/df) Deviance =   .1547704
Pearson          =  46851.09102                   (1/df) Pearson  =   .9981697

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =   .1565726
Log likelihood   = -3631.204249                   BIC             =  -497663.2

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |    2.37003   .6250153     3.27   0.001     1.413443    3.974015
             |
      region |
East Midl..  |   1.406379   .4066634     1.18   0.238     .7979432     2.47875
     London  |   1.459203   .3757136     1.47   0.142     .8809469     2.41703
 North East  |   1.198858   .3579367     0.61   0.544     .6677735    2.152318
 North West  |   1.444676   .4177635     1.27   0.203     .8196431    2.546339
 South East  |   1.560937   .4452927     1.56   0.119     .8924028    2.730298
 South West  |   1.305165   .3831302     0.91   0.364     .7341684    2.320251
West Midl..  |   1.278482    .378356     0.83   0.406     .7157952    2.283498
Yorkshire..  |    1.38622   .4037791     1.12   0.262     .7832379    2.453414
             |
 sgtf#region |
        VOC #|
East Midl..  |   .5560026   .2000715    -1.63   0.103      .274651     1.12557
 VOC#London  |    .576304   .1805245    -1.76   0.079     .3119011    1.064845
        VOC #|
 North East  |   .8074658   .2906224    -0.59   0.552     .3988048    1.634887
        VOC #|
 North West  |    .609254   .2161962    -1.40   0.163     .3039108    1.221379
        VOC #|
 South East  |   .6117052   .2135029    -1.41   0.159      .308637    1.212373
        VOC #|
 South West  |   .5764823   .2100512    -1.51   0.131     .2822514    1.177432
        VOC #|
West Midl..  |    .751856   .2685323    -0.80   0.425     .3733535    1.514081
        VOC #|
Yorkshire..  |   .5434068     .19699    -1.68   0.092     .2670279    1.105843
             |
   agegroupA |
     50-<65  |   .9786339   .0959477    -0.22   0.826     .8075442    1.185971
     65-<75  |   1.214941   .1417818     1.67   0.095      .966543    1.527176
     75-<85  |   .7846785   .1406783    -1.35   0.176     .5521882    1.115055
        85+  |   .5280632   .1770442    -1.90   0.057     .2737177    1.018753
             |
        male |
          M  |   1.094266   .0816736     1.21   0.227     .9453462    1.266644
             |
         imd |
          2  |   1.024243   .1109806     0.22   0.825     .8282701    1.266583
          3  |   .9786379   .1072522    -0.20   0.844     .7894707    1.213132
          4  |   1.130958   .1188787     1.17   0.242      .920394    1.389693
5 most de..  |   1.015047   .1406261     0.11   0.914      .773677     1.33172
             |
        eth5 |
South Asian  |   1.079438    .179893     0.46   0.646     .7786484    1.496422
      Black  |   1.211054   .1945785     1.19   0.233     .8838979      1.6593
      Mixed  |   1.085995   .1788223     0.50   0.616     .7864432    1.499646
      Other  |   .9496883   .1215689    -0.40   0.687     .7389574    1.220514
             |
smoke_nomiss |
     Former  |   1.266985   .3000796     1.00   0.318     .7964681    2.015462
    Current  |   .9595894   .1126391    -0.35   0.725     .7623759    1.207819
             |
   obese4cat |
Obese I ..)  |   .9003512   .0952447    -0.99   0.321     .7317565     1.10779
Obese II..)  |    .855943   .0928044    -1.43   0.151     .6920771    1.058608
Obese II..)  |   .9398075   .0908054    -0.64   0.521     .7776689    1.135751
             |
hh_total_cat |
        3-5  |   .8092065   .0605792    -2.83   0.005     .6987733    .9370923
       6-10  |          1  (empty)
             |
rural_urban5 |
Urban min..  |   1.014971   .1683817     0.09   0.929     .7332308    1.404967
Urban cit..  |   .9766631   .1410336    -0.16   0.870      .735916    1.296168
Rural tow..  |   .9605468   .1390689    -0.28   0.781     .7232371    1.275723
Rural vil..  |   1.024217    .133685     0.18   0.855     .7930303      1.3228
             |
  comorb_cat |
1 comorbi..  |   .9826016   .1554067    -0.11   0.912     .7206972    1.339683
2+ comorb..  |   .9000812   .1301208    -0.73   0.467     .6779962    1.194913
             |
  start_week |
23Nov-29Nov  |   .9407846   .1082276    -0.53   0.596     .7508759    1.178724
30Nov-06Dec  |   .8914562   .1048267    -0.98   0.329     .7079569    1.122518
07Dec-13Dec  |   1.038812    .119265     0.33   0.740     .8294905    1.300956
14Dec-20Dec  |   1.098116   .1368604     0.75   0.453     .8601244    1.401959
             |
       _cons |   .0104975   .0032258   -14.83   0.000      .005748    .0191712
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

.                         
. est store e_regionX

. 
. * Test for interaction
. lrtest e_region e_regionX

Likelihood-ratio test                                 LR chi2(8)  =      5.78
(Assumption: e_region nested in e_regionX)            Prob > chi2 =    0.6718

. 
. * NHS region VOC vs. non-VOC RR
. lincom 1.sgtf, eform                                    // East

 ( 1)  [risk_28]1.sgtf = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    2.37003   .6250153     3.27   0.001     1.413443    3.974015
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#1.region, eform  // East mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#1.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.317743   .3225926     1.13   0.260     .8155501    2.129172
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#2.region, eform  // London

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#2.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.365858   .2308683     1.84   0.065      .980683    1.902315
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#3.region, eform  // North E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#3.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.913718   .4687036     2.65   0.008     1.184142    3.092804
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#4.region, eform  // North W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#4.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.44395   .3428748     1.55   0.122     .9066283    2.299722
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#5.region, eform  // South E

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#5.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.44976   .3313637     1.62   0.104     .9262785    2.269084
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#6.region, eform  // South W

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#6.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.36628   .3435047     1.24   0.214     .8347072     2.23638
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#7.region, eform  // West mids

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#7.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.781921   .4292455     2.40   0.016     1.111331    2.857155
------------------------------------------------------------------------------

. lincom 1.sgtf + 1.sgtf#8.region, eform  // Yorks & Hum

 ( 1)  [risk_28]1.sgtf + [risk_28]1.sgtf#8.region = 0

------------------------------------------------------------------------------
     risk_28 |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.287891   .3203542     1.02   0.309     .7909487    2.097054
------------------------------------------------------------------------------

. 
. * NHS region marginal risks
. margins sgtf, over(region)

Predictive margins                              Number of obs     =     46,920
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
over         : region

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 region#sgtf |
       East #|
    non-VOC  |   .0087736    .001953     4.49   0.000     .0049458    .0126015
   East#VOC  |   .0207938   .0029388     7.08   0.000     .0150339    .0265537
East Midl.. #|
    non-VOC  |   .0123865   .0022855     5.42   0.000      .007907     .016866
East Midl.. #|
        VOC  |   .0163222   .0026254     6.22   0.000     .0111766    .0214678
     London #|
    non-VOC  |   .0128034   .0016559     7.73   0.000     .0095579    .0160489
 London#VOC  |   .0174876   .0019023     9.19   0.000     .0137592    .0212161
 North East #|
    non-VOC  |   .0105748   .0021035     5.03   0.000     .0064522    .0146975
 North East #|
        VOC  |   .0202373   .0028907     7.00   0.000     .0145717    .0259029
 North West #|
    non-VOC  |   .0126915   .0023417     5.42   0.000     .0081018    .0172812
 North West #|
        VOC  |   .0183259    .002737     6.70   0.000     .0129614    .0236904
 South East #|
    non-VOC  |   .0136977   .0024431     5.61   0.000     .0089094     .018486
 South East #|
        VOC  |   .0198583    .002837     7.00   0.000      .014298    .0254187
 South West #|
    non-VOC  |   .0114463   .0021898     5.23   0.000     .0071543    .0157382
 South West #|
        VOC  |   .0156388   .0025503     6.13   0.000     .0106403    .0206374
West Midl.. #|
    non-VOC  |   .0112161    .002187     5.13   0.000     .0069298    .0155025
West Midl.. #|
        VOC  |   .0199863   .0028259     7.07   0.000     .0144477    .0255249
Yorkshire.. #|
    non-VOC  |   .0121634   .0022843     5.32   0.000     .0076863    .0166406
Yorkshire.. #|
        VOC  |   .0156652   .0025544     6.13   0.000     .0106587    .0206716
------------------------------------------------------------------------------

. 
. 
. 
. *********************************************************************
. /* Causal min adjustment set - age as spline, comorbidities,       */
. /* deprivation index, and smoking status                                     
>               */
. *********************************************************************
. 
. glm risk_28 i.sgtf i.comorb_cat ib1.imd i.smoke_nomiss age1 age2 age3, ///
>                         family(bin) link(log) eform

Iteration 0:   log likelihood = -10315.171  
Iteration 1:   log likelihood = -4987.0869  
Iteration 2:   log likelihood = -4973.8548  
Iteration 3:   log likelihood = -4973.6308  
Iteration 4:   log likelihood = -4973.6307  

Generalized linear models                         Number of obs   =     64,091
Optimization     : ML                             Residual df     =     64,078
                                                  Scale parameter =          1
Deviance         =  9947.261427                   (1/df) Deviance =   .1552368
Pearson          =  64042.38467                   (1/df) Pearson  =   .9994442

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = ln(u)                   [Log]

                                                  AIC             =    .155611
Log likelihood   = -4973.630714                   BIC             =  -699271.8

------------------------------------------------------------------------------
             |                 OIM
     risk_28 | Risk Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
        VOC  |   1.441208   .0940426     5.60   0.000     1.268188    1.637834
             |
  comorb_cat |
1 comorbi..  |   .9720895   .1336192    -0.21   0.837     .7425125    1.272649
2+ comorb..  |   .9214661   .1154557    -0.65   0.514     .7208211    1.177962
             |
         imd |
          2  |   1.035006   .0960881     0.37   0.711     .8628175    1.241558
          3  |   1.051153   .0968518     0.54   0.588     .8774804      1.2592
          4  |   1.066288   .0979368     0.70   0.485     .8906213    1.276603
5 most de..  |   1.002866   .1194982     0.02   0.981     .7939926    1.266687
             |
smoke_nomiss |
     Former  |   1.096277   .2402037     0.42   0.675     .7135344    1.684325
    Current  |   .9859673   .0977418    -0.14   0.887     .8118587    1.197415
             |
        age1 |   1.001277   .0068337     0.19   0.852     .9879728    1.014761
        age2 |   1.017089   .0223688     0.77   0.441     .9741784     1.06189
        age3 |   .9289869   .0578622    -1.18   0.237      .822228    1.049607
       _cons |   .0114886   .0019896   -25.79   0.000     .0081819    .0161317
------------------------------------------------------------------------------
Note: _cons estimates baseline risk.

. 
. 
. * Adjusted absolute risk
. margins sgtf

Predictive margins                              Number of obs     =     64,091
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0122681    .000619    19.82   0.000     .0110549    .0134813
        VOC  |   .0176808   .0007314    24.17   0.000     .0162472    .0191144
------------------------------------------------------------------------------

. margins sgtf, asbalanced

Predictive margins                              Number of obs     =     64,091
Model VCE    : OIM

Expression   : Predicted mean risk_28, predict()
at           : sgtf             (asbalanced)
               comorb_cat       (asbalanced)
               imd              (asbalanced)
               smoke_nomiss     (asbalanced)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        sgtf |
    non-VOC  |   .0129422   .0012416    10.42   0.000     .0105088    .0153756
        VOC  |   .0186524    .001708    10.92   0.000     .0153047    .0220001
------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/an_risk_models.log
  log type:  text
 closed on:  11 Feb 2021, 11:45:44
-------------------------------------------------------------------------------
