-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 opened on:  12 Feb 2021, 16:48:19

. 
. clear

. 
. /*
> import delimited "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output
> \input.csv"
> merge m:1 msoa using "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\lo
> okups\MSOA_lookup"
> drop if _merge==2
> drop _merge
> */
. 
. import delimited ./output/input.csv
(58 vars, 400,000 obs)

. merge m:1 msoa using ./lookups/MSOA_lookup

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           400,000  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(0 observations deleted)

. drop _merge

. 
. 
. rename hiv hiv_code

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. gen study_start = date(sgss_pos_inrange, "YMD")
(79,999 missing values generated)

. summ study_start

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 study_start |    320,001    22260.02    14.15691      22236      22284

. noi disp "MINIMUM START DATE: " %td r(min)
MINIMUM START DATE: 17nov2020

. 
. gen study_end = date("04jan2021", "DMY")

. format %td study_start study_end

. 
. * DROP IF NO POSITIVE PCR TEST IN SGSS DURING STUDY PERIOD
. noi di "NO POSITIVE TEST IN STUDY PERIOD"
NO POSITIVE TEST IN STUDY PERIOD

. drop if sgss_pos_inrange == ""
(79,999 observations deleted)

. 
. * DROP IF DIED ON/BEFORE STUDY START DATE
. noi di "DIED ON/BEFORE STUDY START DATE:" 
DIED ON/BEFORE STUDY START DATE:

. drop if date(died_date_ons, "YMD") <= study_start
(21,753 observations deleted)

. 
. * DROP IF COVID POSITIVE ON/BEFORE STUDY START DATE
. noi di "COVID POSITIVE BEFORE STUDY START DATE:" 
COVID POSITIVE BEFORE STUDY START DATE:

. drop if date(covid_tpp_probable, "YMD") <= study_start
(26,853 observations deleted)

. drop if date(first_pos_test_sgss, "YMD") <= study_start
(81,879 observations deleted)

. 
. * DROP IF VACCINATED ON/BEFORE STUDY START DATE
. noi di "VACCINATED ON/BEFORE STUDY START DATE:" 
VACCINATED ON/BEFORE STUDY START DATE:

. drop if date(covid_vacc_date, "YMD") <= study_start
(5,008 observations deleted)

. 
. * Age: Exclude children
. *noi di "DROPPING AGE<18:" 
. *drop if age<18
. 
. * Age: Exclude those with implausible ages
. assert age<.

. noi di "DROPPING AGE>105:" 
DROPPING AGE>105:

. drop if age>105
(25 observations deleted)

. 
. * Sex: Exclude categories other than M and F
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. 
. **************************
. *  CREATE SGTF VARIABLE  *
. **************************
. 
. desc sgtf

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
sgtf            byte    %8.0g                 

. 
. replace sgtf=99 if sgtf==.
(18,407 real changes made)

. 
. gen has_sgtf=0

. replace has_sgtf=1 if inrange(sgtf,0,1)
(147,741 real changes made)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(36,742 observations deleted)

. 
. label define sgtfLab 0 "non-VOC" 1 "VOC" 9 "Unclassified" 99 "Blank"

. label values sgtf sgtfLab

. 
. 
. ******************************
. *  Convert strings to dates  *
. ******************************
. 
. * Covariates
. foreach var of varlist  bp_sys_date                                     ///
>                                                 bp_dias_date                 
>                    ///
>                                                 hba1c_percentage_date        
>            ///
>                                                 hba1c_mmol_per_mol_date      
>            ///
>                                                 hypertension                 
>                    ///
>                                                 bmi_date_measured            
>                    ///
>                                                 chronic_respiratory_disease  
>    ///
>                                                 chronic_cardiac_disease      
>            ///
>                                                 diabetes                     
>                            ///
>                                                 lung_cancer                  
>                    ///
>                                                 haem_cancer                  
>                            ///
>                                                 other_cancer                 
>                    ///
>                                                 chronic_liver_disease        
>            ///
>                                                 stroke                       
>                            ///
>                                                 dementia                     
>                            ///
>                                                 other_neuro                  
>                    ///
>                                                 organ_transplant             
>                    ///     
>                                                 dysplenia                    
>                            ///
>                                                 sickle_cell                  
>                    ///
>                                                 aplastic_anaemia             
>                    ///
>                                                 hiv_date                     
>                            ///
>                                                 permanent_immunodeficiency   
>            ///
>                                                 temporary_immunodeficiency   
>            ///
>                                                 ra_sle_psoriasis  dialysis   
>    {
  2.         confirm string variable `var'
  3.         replace `var' = `var' + "-15"
  4.         rename `var' `var'_dstr
  5.         replace `var'_dstr = " " if `var'_dstr == "-15"
  6.         gen `var'_date = date(`var'_dstr, "YMD") 
  7.         order `var'_date, after(`var'_dstr)
  8.         drop `var'_dstr
  9.         format `var'_date %td
 10. }
variable bp_sys_date_measured was str7 now str10
(147,741 real changes made)
(7,387 real changes made)
(7,387 missing values generated)
variable bp_dias_date_measured was str7 now str10
(147,741 real changes made)
(7,535 real changes made)
(7,535 missing values generated)
variable hba1c_percentage_date was str7 now str10
(147,741 real changes made)
(7,371 real changes made)
(7,371 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(147,741 real changes made)
(7,377 real changes made)
(7,377 missing values generated)
variable hypertension was str7 now str10
(147,741 real changes made)
(118,094 real changes made)
(118,094 missing values generated)
variable bmi_date_measured was str7 now str10
(147,741 real changes made)
(7,431 real changes made)
(7,431 missing values generated)
variable chronic_respiratory_disease was str7 now str10
(147,741 real changes made)
(118,207 real changes made)
(118,207 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(147,741 real changes made)
(118,271 real changes made)
(118,271 missing values generated)
variable diabetes was str7 now str10
(147,741 real changes made)
(118,095 real changes made)
(118,095 missing values generated)
variable lung_cancer was str7 now str10
(147,741 real changes made)
(118,063 real changes made)
(118,063 missing values generated)
variable haem_cancer was str7 now str10
(147,741 real changes made)
(118,245 real changes made)
(118,245 missing values generated)
variable other_cancer was str7 now str10
(147,741 real changes made)
(118,153 real changes made)
(118,153 missing values generated)
variable chronic_liver_disease was str7 now str10
(147,741 real changes made)
(118,410 real changes made)
(118,410 missing values generated)
variable stroke was str7 now str10
(147,741 real changes made)
(118,159 real changes made)
(118,159 missing values generated)
variable dementia was str7 now str10
(147,741 real changes made)
(118,129 real changes made)
(118,129 missing values generated)
variable other_neuro was str7 now str10
(147,741 real changes made)
(118,249 real changes made)
(118,249 missing values generated)
variable organ_transplant was str7 now str10
(147,741 real changes made)
(118,003 real changes made)
(118,003 missing values generated)
variable dysplenia was str7 now str10
(147,741 real changes made)
(118,076 real changes made)
(118,076 missing values generated)
variable sickle_cell was str7 now str10
(147,741 real changes made)
(118,048 real changes made)
(118,048 missing values generated)
variable aplastic_anaemia was str7 now str10
(147,741 real changes made)
(118,224 real changes made)
(118,224 missing values generated)
variable hiv_date was str7 now str10
(147,741 real changes made)
(118,368 real changes made)
(118,368 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(147,741 real changes made)
(118,137 real changes made)
(118,137 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(147,741 real changes made)
(118,347 real changes made)
(118,347 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(147,741 real changes made)
(118,264 real changes made)
(118,264 missing values generated)
variable dialysis was str7 now str10
(147,741 real changes made)
(118,360 real changes made)
(118,360 missing values generated)

. 
. rename bmi_date_measured_date      bmi_date_measured

. rename bp_dias_date_measured_date  bp_dias_date

. rename bp_sys_date_measured_date   bp_sys_date

. rename hba1c_percentage_date_date  hba1c_percentage_date

. rename hba1c_mmol_per_mol_date_date  hba1c_mmol_per_mol_date

. rename hiv_date_date hiv_date

. 
. * Dates of: covid tests, ONS death
. foreach var of varlist  dereg_date died_date_ons covid_tpp_probable covid_vac
> c_date ///
>                                                 first_pos_test_sgss sgss_pos_
> inrange {
  2.                 confirm string variable `var'
  3.                 rename `var' _tmp
  4.                 gen `var' = date(_tmp, "YMD")
  5.                 drop _tmp
  6.                 format %d `var'
  7. }
(147,741 missing values generated)
(142,450 missing values generated)
(129,650 missing values generated)
(121,505 missing values generated)
(126,845 missing values generated)

.  
.  
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. * BMI 
. 
. * Only keep if within certain time period? using bmi_date_measured ?
. * NB: Some BMI dates in future or after cohort entry
. 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(20,000 real changes made, 20,000 to missing)

. 
. * Sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. 
. label define maleLab 0 "F" 1 "M"

. label values male maleLab

. 
. 
. * Smoking
. label define smoke_nomissLab 1 "Never" 2 "Former" 3 "Current" 

. 
. gen     smoke = 1  if smoking_status=="N"
(141,831 missing values generated)

. replace smoke = 2  if smoking_status=="E"
(2,915 real changes made)

. replace smoke = 3  if smoking_status=="S"
(17,708 real changes made)

. replace smoke = . if smoking_status=="M"
(0 real changes made)

. label values smoke smoke_nomissLab

. drop smoking_status

. 
. * Ethnicity (5 category)
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicityLab       1 "White"                                    
>    ///
>                                                         2 "Mixed"            
>                            ///
>                                                         3 "Asian or Asian Bri
> tish"      ///
>                                                         4 "Black"            
>                            ///
>                                                         5 "Other"            
>                            

.                                                 
. label values ethnicity ethnicityLab

. 
. * Re-order ethnicity
. gen eth5=1 if ethnicity==1
(64,592 missing values generated)

. replace eth5=2 if ethnicity==3
(5,546 real changes made)

. replace eth5=3 if ethnicity==4
(5,655 real changes made)

. replace eth5=4 if ethnicity==2
(5,488 real changes made)

. replace eth5=5 if ethnicity==5
(10,877 real changes made)

. replace eth5=. if ethnicity==.
(0 real changes made)

. 
. label define eth5Lab    1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    

.  
. label values eth5 eth5Lab

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = . if ethnicity==.
(27,732 real changes made, 27,732 to missing)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British or Mixed British" 
>            ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Black Caribbean"  
>            ///
>                                                 5 "White + Black African"    
>                    ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian or British Indian" 
>            ///
>                                                 9 "Pakistani or British Pakis
> tani"      ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    

.                                                 
. label values ethnicity_16 ethnicity_16

. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen ethnicity_16_combinemixed = ethnicity_16
(64,667 missing values generated)

. recode ethnicity_16_combinemixed 4/7 = 4
(ethnicity_16_combinemixed: 8433 changes made)

. label define ethnicity_16_combinemixed  ///
>                                                 1 "British or Mixed British" 
> ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "All mixed" ///
>                                                 8 "Indian or British Indian" 
> ///
>                                                 9 "Pakistani or British Pakis
> tani" ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian" ///
>                                                 12 "Caribbean" ///
>                                                 13 "African" ///
>                                                 14 "Other Black" ///
>                                                 15 "Chinese" ///
>                                                 16 "Other" 

.                                                 
. label values ethnicity_16_combinemixed ethnicity_16_combinemixed

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(147,731 missing values generated)

. replace stp = sum(stp)
(147,740 real changes made)

. drop stp_old

. 
. * MSOA/UTLA
. 
. egen n_msoa = tag(msoa)

. count if n_msoa
  6,791

. 
. bysort msoa: gen count1 = _N

. summ count1, d

                           count1
-------------------------------------------------------------
      Percentiles      Smallest
 1%           13              8
 5%           15              8
10%           17              8       Obs             147,741
25%           20              8       Sum of Wgt.     147,741

50%           23                      Mean           22.76868
                        Largest       Std. Dev.      4.716105
75%           26             39
90%           29             39       Variance       22.24164
95%           31             39       Skewness       .2480909
99%           35             39       Kurtosis       3.022859

. 
. egen n_utla = tag(utla)

. count if n_utla
  151

. 
. bysort utla: gen count2 = _N

. summ count2, d

                           count2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          356             19
 5%          452             19
10%          523             19       Obs             147,741
25%          719             19       Sum of Wgt.     147,741

50%         1267                      Mean            1537.43
                        Largest       Std. Dev.      1027.966
75%         2125           3941
90%         3305           3941       Variance        1056715
95%         3757           3941       Skewness       .9088277
99%         3941           3941       Kurtosis       2.678705

. 
. * Regroup UTLAs with small case numbers
. 
. gen utla_group = utla_name

. tab utla_group

          utla_group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Barking and Dagenham |        492        0.33        0.33
              Barnet |        903        0.61        0.94
            Barnsley |        659        0.45        1.39
 Bath and North East |        580        0.39        1.78
             Bedford |        406        0.27        2.06
              Bexley |        637        0.43        2.49
          Birmingham |      2,904        1.97        4.45
Blackburn with Darwe |        392        0.27        4.72
           Blackpool |        452        0.31        5.03
              Bolton |        759        0.51        5.54
Bournemouth, Christc |      1,046        0.71        6.25
    Bracknell Forest |        347        0.23        6.48
            Bradford |      1,395        0.94        7.43
               Brent |        755        0.51        7.94
   Brighton and Hove |        735        0.50        8.44
    Bristol, City of |      1,177        0.80        9.23
             Bromley |        849        0.57        9.81
     Buckinghamshire |      1,483        1.00       10.81
                Bury |        554        0.37       11.19
          Calderdale |        599        0.41       11.59
      Cambridgeshire |      1,643        1.11       12.70
              Camden |        589        0.40       13.10
Central Bedfordshire |        729        0.49       13.59
       Cheshire East |      1,147        0.78       14.37
Cheshire West and Ch |      1,015        0.69       15.06
      City of London |         21        0.01       15.07
            Cornwall |      1,663        1.13       16.20
       County Durham |      1,485        1.01       17.20
            Coventry |        880        0.60       17.80
             Croydon |        962        0.65       18.45
             Cumbria |      1,360        0.92       19.37
          Darlington |        356        0.24       19.61
               Derby |        679        0.46       20.07
          Derbyshire |      2,073        1.40       21.47
               Devon |      2,327        1.58       23.05
           Doncaster |        877        0.59       23.64
              Dorset |      1,007        0.68       24.32
              Dudley |        922        0.62       24.95
              Ealing |        830        0.56       25.51
East Riding of Yorks |        894        0.61       26.12
         East Sussex |      1,530        1.04       27.15
             Enfield |        807        0.55       27.70
               Essex |      3,757        2.54       30.24
           Gateshead |        571        0.39       30.63
     Gloucestershire |      1,618        1.10       31.72
           Greenwich |        739        0.50       32.22
             Hackney |        620        0.42       32.64
              Halton |        326        0.22       32.86
Hammersmith and Fulh |        527        0.36       33.22
           Hampshire |      3,607        2.44       35.66
            Haringey |        786        0.53       36.19
              Harrow |        699        0.47       36.67
          Hartlepool |        256        0.17       36.84
            Havering |        623        0.42       37.26
Herefordshire, Count |        512        0.35       37.61
       Hertfordshire |      3,311        2.24       39.85
          Hillingdon |        719        0.49       40.33
            Hounslow |        629        0.43       40.76
       Isle of Wight |        402        0.27       41.03
     Isles of Scilly |         19        0.01       41.05
           Islington |        501        0.34       41.38
Kensington and Chels |        450        0.30       41.69
                Kent |      3,941        2.67       44.36
 Kingston upon Hull, |        724        0.49       44.85
Kingston upon Thames |        437        0.30       45.14
            Kirklees |      1,269        0.86       46.00
            Knowsley |        441        0.30       46.30
             Lambeth |        724        0.49       46.79
          Lancashire |      3,305        2.24       49.03
               Leeds |      2,325        1.57       50.60
           Leicester |        741        0.50       51.10
      Leicestershire |      1,807        1.22       52.33
            Lewisham |        781        0.53       52.85
        Lincolnshire |      1,913        1.29       54.15
           Liverpool |      1,267        0.86       55.01
               Luton |        457        0.31       55.32
          Manchester |      1,277        0.86       56.18
              Medway |        788        0.53       56.71
              Merton |        515        0.35       57.06
       Middlesbrough |        373        0.25       57.31
       Milton Keynes |        679        0.46       57.77
 Newcastle upon Tyne |        634        0.43       58.20
              Newham |        814        0.55       58.75
             Norfolk |      2,414        1.63       60.39
North East Lincolnsh |        503        0.34       60.73
  North Lincolnshire |        478        0.32       61.05
      North Somerset |        543        0.37       61.42
      North Tyneside |        627        0.42       61.84
     North Yorkshire |      1,650        1.12       62.96
    Northamptonshire |      1,943        1.32       64.28
      Northumberland |        845        0.57       64.85
          Nottingham |        841        0.57       65.42
     Nottinghamshire |      2,125        1.44       66.86
              Oldham |        716        0.48       67.34
         Oxfordshire |      1,857        1.26       68.60
        Peterborough |        501        0.34       68.94
            Plymouth |        722        0.49       69.42
          Portsmouth |        545        0.37       69.79
             Reading |        389        0.26       70.06
           Redbridge |        716        0.48       70.54
Redcar and Cleveland |        398        0.27       70.81
Richmond upon Thames |        458        0.31       71.12
            Rochdale |        541        0.37       71.49
           Rotherham |        718        0.49       71.97
             Rutland |        115        0.08       72.05
             Salford |        605        0.41       72.46
            Sandwell |        790        0.53       73.00
              Sefton |        841        0.57       73.56
           Sheffield |      1,521        1.03       74.59
          Shropshire |        796        0.54       75.13
              Slough |        295        0.20       75.33
            Solihull |        630        0.43       75.76
            Somerset |      1,527        1.03       76.79
South Gloucestershir |        725        0.49       77.28
      South Tyneside |        554        0.37       77.66
         Southampton |        719        0.49       78.14
     Southend-on-Sea |        396        0.27       78.41
           Southwark |        749        0.51       78.92
          St. Helens |        480        0.32       79.24
       Staffordshire |      2,441        1.65       80.90
           Stockport |        916        0.62       81.52
    Stockton-on-Tees |        529        0.36       81.88
      Stoke-on-Trent |        725        0.49       82.37
             Suffolk |      1,921        1.30       83.67
          Sunderland |        784        0.53       84.20
              Surrey |      3,216        2.18       86.37
              Sutton |        523        0.35       86.73
             Swindon |        632        0.43       87.16
            Tameside |        693        0.47       87.62
  Telford and Wrekin |        508        0.34       87.97
            Thurrock |        432        0.29       88.26
              Torbay |        389        0.26       88.52
       Tower Hamlets |        718        0.49       89.01
            Trafford |        585        0.40       89.41
           Wakefield |      1,026        0.69       90.10
             Walsall |        897        0.61       90.71
      Waltham Forest |        568        0.38       91.09
          Wandsworth |        885        0.60       91.69
          Warrington |        510        0.35       92.04
        Warwickshire |      1,380        0.93       92.97
      West Berkshire |        487        0.33       93.30
         West Sussex |      2,202        1.49       94.79
         Westminster |        543        0.37       95.16
               Wigan |        852        0.58       95.73
           Wiltshire |      1,372        0.93       96.66
Windsor and Maidenhe |        400        0.27       96.93
              Wirral |        936        0.63       97.57
           Wokingham |        473        0.32       97.89
       Wolverhampton |        688        0.47       98.35
      Worcestershire |      1,870        1.27       99.62
                York |        563        0.38      100.00
---------------------+-----------------------------------
               Total |    147,741      100.00

. 
. /*
> replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Barki
> ng and Dagenham"
> replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Redbr
> idge"
> 
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Buckingh
> amshire"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Oxfordsh
> ire"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Swindon"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "West Ber
> kshire"
> 
> replace utla_group = "Camden and Westminster" if utla_name == "Camden"
> replace utla_group = "Camden and Westminster" if utla_name == "Westminster"
> 
> replace utla_group = "" if utla_name == "Isles of Scilly"
> 
> replace utla_group = "Richmond and Hounslow" if utla_name == "Richmond upon T
> hames"
> replace utla_group = "Richmond and Hounslow" if utla_name == "Hounslow"
> 
> replace utla_group = "Rutland and Lincoln" if utla_name == "Rutland"
> replace utla_group = "Rutland and Lincoln" if utla_name == "Lincolnshire"
> 
> replace utla_group = "Bolton and Tameside" if utla_name == "Bolton"
> replace utla_group = "Bolton and Tameside" if utla_name == "Tameside"
> 
> tab utla_group
> */
. 
. 
. * NHS England regions
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |     14,727        9.97        9.97
         East of England |     14,670        9.93       19.90
                  London |     29,662       20.08       39.97
              North East |     14,917       10.10       50.07
              North West |     14,630        9.90       59.97
              South East |     14,712        9.96       69.93
              South West |     14,730        9.97       79.90
           West Midlands |     15,003       10.15       90.06
Yorkshire and the Humber |     14,690        9.94      100.00
-------------------------+-----------------------------------
                   Total |    147,741      100.00

. 
. gen region2=.
(147,741 missing values generated)

. replace region2=0 if region=="East of England"
(14,670 real changes made)

. replace region2=1 if region=="East Midlands"
(14,727 real changes made)

. replace region2=2 if region=="London"
(29,662 real changes made)

. replace region2=3 if region=="North East"
(14,917 real changes made)

. replace region2=4 if region=="North West"
(14,630 real changes made)

. replace region2=5 if region=="South East"
(14,712 real changes made)

. replace region2=6 if region=="South West"
(14,730 real changes made)

. replace region2=7 if region=="West Midlands"
(15,003 real changes made)

. replace region2=8 if region=="Yorkshire and the Humber"
(14,690 real changes made)

. 
. drop region

. rename region2 region

. 
. label define regionLab  0 "East" ///
>                                                 1 "East Midlands"  ///
>                                                 2 "London" ///
>                                                 3 "North East" ///
>                                                 4 "North West" ///
>                                                 5 "South East" ///
>                                                 6 "South West" ///
>                                                 7 "West Midlands" ///
>                                                 8 "Yorkshire and Humber"

.                                                 
. label values region regionLab

. 
. 
. **************************
. *  Categorise variables  *
. **************************
. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(145996 differences between age and agegroup)

. 
. label define agegroupLab        0 "0-<18" ///
>                                                         1 "18-<30" ///
>                                                         2 "30-<40" ///
>                                                         3 "40-<50" ///
>                                                         4 "50-<60" ///
>                                                         5 "60-<70" ///
>                                                         6 "70-<80" ///
>                                                         7 "80+"

.                                                 
. label values agegroup agegroupLab

. 
. * For subgroup analysis
. recode age      0/49.9999=1 ///
>                         50/64.9999=2 ///
>                         65/74.9999=3 ///
>                         75/84.9999=4 ///
>                         85/max=5, gen(agegroupA) 
(146033 differences between age and agegroupA)

. 
. label define agegroupALab       1 "0-<50"  ///
>                                                         2 "50-<65" ///
>                                                         3 "65-<75" ///
>                                                         4 "75-<85" ///
>                                                         5 "85+"

.                                                         
. label values agegroupA agegroupALab

. 
. 
. * Create binary age
. recode age min/69.999=0 70/max=1, gen(age70)
(145996 differences between age and age70)

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. assert age70<.

. 
. * Create restricted cubic splines fir age
. mkspline age = age, cubic nknots(4)

. 
. 
. /*  Body Mass Index  */
. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(147,741 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 3767 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 15204 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 21090 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 26837 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 27112 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 33731 changes made)

. replace bmicat = . if bmi>=.
(0 real changes made)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    

.                                         
. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 . = 1 4=2 5=3 6=4, gen(obese4cat)
(143974 differences between bmicat and obese4cat)

. 
. label define obese4catLab       1 "No record of obesity"        ///
>                                                         2 "Obese I (30-34.9)"
>            ///
>                                                         3 "Obese II (35-39.9)
> "          ///
>                                                         4 "Obese III (40+)"  
>            

. label values obese4cat obese4catLab

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Create non-missing 3-category variable for current smoking
. recode smoke .=1, gen(smoke_nomiss)
(121208 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke_nomissLab

. 
. 
. /*  Asthma  */
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3 .=1
(asthmacat: 147741 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(140,203 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(2 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(158 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(140,043 real changes made)

. replace bpcat = . if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(14,549 real changes made, 14,549 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 

. label values bpcat bpcat

. 
. recode bpcat .=1, gen(bpcat_nomiss)
(14549 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. order bpcat bphigh, after(bp_dias_date)

. 
. 
. /*  IMD  */
. 
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(147,741 real changes made)

. replace imd = . if imd_o==-1
(0 real changes made)

. drop imd_o

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     14,730        9.97        9.97
          2 |     29,715       20.11       30.08
          3 |     29,615       20.05       50.13
          4 |     29,380       19.89       70.01
          5 |     44,301       29.99      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. * Reverse the order (so high is more deprived)
. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 118126 changes made)

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     44,301       29.99       29.99
          2 |     29,380       19.89       49.87
          3 |     29,615       20.05       69.92
          4 |     29,715       20.11       90.03
          5 |     14,730        9.97      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. label define imdLab 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived
> " 

. label values imd imdLab 

. 
. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. 
. /*  HOUSEHOLD SIZE  */
. 
. gen hh_total_cat=.
(147,741 missing values generated)

. replace hh_total_cat=1 if household_size >=1 & household_size<=2
(70,149 real changes made)

. replace hh_total_cat=2 if household_size >=3 & household_size<=5
(74,074 real changes made)

. replace hh_total_cat=3 if household_size >=6 & household_size<=10
(210 real changes made)

. replace hh_total_cat=4 if household_size >=11
(0 real changes made)

. 
. label define hh_total_catLab    1 "1-2" ///
>                                                                 2 "3-5" ///
>                                                                 3 "6-10" ///
>                                                                 4 "11+"

.                                                                              
>            
. label values hh_total_cat hh_total_catLab

. 
. 
. /*  RURAL OR URBAN  */
. 
. * Create a 4 category rural urban variable based upon meeting with Roz 21st O
> ctober
. gen rural_urban5=.
(147,741 missing values generated)

. replace rural_urban5=1 if rural_urban==1
(14,742 real changes made)

. replace rural_urban5=2 if rural_urban==2
(14,912 real changes made)

. replace rural_urban5=3 if rural_urban==3|rural_urban==4
(29,379 real changes made)

. replace rural_urban5=4 if rural_urban==5|rural_urban==6
(29,537 real changes made)

. replace rural_urban5=5 if rural_urban==7|rural_urban==8
(59,171 real changes made)

. 
. label define rural_urban5Lab    1 "Urban major conurbation" ///
>                                                                 2 "Urban mino
> r conurbation" ///
>                                                                 3 "Urban city
>  and town" ///
>                                                                 4 "Rural town
>  and fringe" ///
>                                                                 5 "Rural vill
> age and dispersed"

.                                                                 
. label values rural_urban5 rural_urban5Lab

. tab rural_urban5, m

               rural_urban5 |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |     14,742        9.98        9.98
    Urban minor conurbation |     14,912       10.09       20.07
        Urban city and town |     29,379       19.89       39.96
      Rural town and fringe |     29,537       19.99       59.95
Rural village and dispersed |     59,171       40.05      100.00
----------------------------+-----------------------------------
                      Total |    147,741      100.00

. 
. 
. /*  CARE HOME TYPE  */
. 
. tab care_home_type, m

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |      7,636        5.17        5.17
         PN |      7,433        5.03       10.20
         PS |      7,306        4.95       15.14
          U |    125,366       84.86      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. gen home_bin=0

. replace home_bin=1 if care_home_type=="PC" | care_home_type=="PN" | care_home
> _type=="PS"
(22,375 real changes made)

. 
. tab care_home_type home_bin, m

care_home_ |       home_bin
      type |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      7,636 |     7,636 
        PN |         0      7,433 |     7,433 
        PS |         0      7,306 |     7,306 
         U |   125,366          0 |   125,366 
-----------+----------------------+----------
     Total |   125,366     22,375 |   147,741 

. 
. label define home_binLab        0 "Private home" ///
>                                                         1 "Care home"

. 
. label values home_bin home_binLab

. 
. 
. /*  Centred age, sex, IMD, ethnicity (for adjusted KM plots)  */ 
. 
. * Centre age (linear)
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    147,741    40.26787    23.69763          0        105

. gen c_age = age-r(mean)

. 
. * "Centre" sex to be coded -1 +1 
. recode male 0=-1, gen(c_male)
(75118 differences between male and c_male)

. 
. * "Centre" IMD
. gen c_imd = imd - 3

. 
. * "Centre" ethnicity
. gen c_ethnicity = ethnicity - 3
(37,026 missing values generated)

. 
. 
. **************************************************
. *  Create binary comorbidity indices from dates  *
. **************************************************
. 
. * Comorbidities ever before study_start
. foreach var of varlist  chronic_respiratory_disease_date        ///
>                                                 chronic_cardiac_disease_date 
>            ///
>                                                 diabetes_date                
>                            ///
>                                                 chronic_liver_disease_date   
>                    ///
>                                                 stroke_date                  
>                                    ///
>                                                 dementia_date                
>                            ///
>                                                 other_neuro_date             
>                            ///
>                                                 organ_transplant_date        
>                    ///
>                                                 aplastic_anaemia_date        
>                    ///
>                                                 hypertension_date            
>                            ///
>                                                 dysplenia_date               
>                            ///
>                                                 sickle_cell_date             
>                            ///
>                                                 hiv_date                     
>                                    ///
>                                                 permanent_immunodeficiency_da
> te         ///
>                                                 temporary_immunodeficiency_da
> te         ///
>                                                 ra_sle_psoriasis_date dialysi
> s_date {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'< study_start)
  4.         order `newvar', after(`var')
  5. }

. 
. 
. **************************
. *  Epidemiological week  *
. **************************
. 
. gen start_week = 53 if study_start <= date("04jan2021", "DMY")

. replace start_week = 52 if study_start <= date("27dec2020", "DMY")
(127,293 real changes made)

. replace start_week = 51 if study_start <= date("20dec2020", "DMY")
(108,204 real changes made)

. replace start_week = 50 if study_start <= date("13dec2020", "DMY")
(87,866 real changes made)

. replace start_week = 49 if study_start <= date("06dec2020", "DMY")
(66,363 real changes made)

. replace start_week = 48 if study_start <= date("29nov2020", "DMY")
(43,751 real changes made)

. replace start_week = 47 if study_start <= date("22nov2020", "DMY")
(20,659 real changes made)

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
         47 |     20,659       13.98       13.98
         48 |     23,092       15.63       29.61
         49 |     22,612       15.31       44.92
         50 |     21,503       14.55       59.47
         51 |     20,338       13.77       73.24
         52 |     19,089       12.92       86.16
         53 |     20,448       13.84      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. replace start_week = start_week-46
(147,741 real changes made)

. 
. label define start_weekLab      1 "16Nov-22Nov" ///
>                                                         2 "23Nov-29Nov" ///
>                                                         3 "30Nov-06Dec" ///
>                                                         4 "07Dec-13Dec" ///
>                                                         5 "14Dec-20Dec" ///
>                                                         6 "21Dec-27Dec" ///
>                                                         7 "28Dec-04Jan" ///
>                                                         

. label values start_week start_weekLab

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
16Nov-22Nov |     20,659       13.98       13.98
23Nov-29Nov |     23,092       15.63       29.61
30Nov-06Dec |     22,612       15.31       44.92
07Dec-13Dec |     21,503       14.55       59.47
14Dec-20Dec |     20,338       13.77       73.24
21Dec-27Dec |     19,089       12.92       86.16
28Dec-04Jan |     20,448       13.84      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. 
. ***************************
. *  Grouped comorbidities  *
. ***************************
. 
. /*  Neurological  */
. 
. * Stroke and dementia
. egen stroke_dementia = rowmax(stroke dementia)

. order stroke_dementia, after(dementia_date)

. 
. 
. /*  Spleen  */
. 
. * Spleen problems (dysplenia/splenectomy/etc and sickle cell disease)   
. egen spleen = rowmax(dysplenia sickle_cell) 

. order spleen, after(sickle_cell)

. 
. 
. /*  Cancer  */
. 
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. local fiveybefore = study_start-5*365.25

. local oneybefore = study_start-365.25

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(haem_cancer_date, d(1/1/1900), `fiveyb
> efore')
(121,130 missing values generated)

. replace cancer_haem_cat = 3 if inrange(haem_cancer_date, `fiveybefore', `oney
> before')
(2,210 real changes made)

. replace cancer_haem_cat = 2 if inrange(haem_cancer_date, `oneybefore', study_
> start)
(570 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 118350 changes made)

. label values cancer_haem_cat cancer

. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(lung_cancer_date,  d(1/1/1900), `fiv
> eybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, d(1/1/1900), `fiveybefore') 
(99,247 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(lung_cancer_date,  `fiveybefore', `o
> neybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, `fiveybefore', `oneybefore') 
(4,612 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(lung_cancer_date,  `oneybefore', stu
> dy_start) | ///
>                                                                  inrange(othe
> r_cancer_date, `oneybefore', study_start)
(1,065 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 94602 changes made)

. label values cancer_exhaem_cat cancer

. 
. * Put variables together
. order cancer_exhaem_cat cancer_haem_cat, after(other_cancer_date)

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * HIV, permanent immunodeficiency ever, OR 
. * temporary immunodeficiency or aplastic anaemia last year
. gen temp1  = max(hiv, permanent_immunodeficiency)

. gen temp2  = inrange(temporary_immunodeficiency_date, `oneybefore', study_sta
> rt)

. gen temp3  = inrange(aplastic_anaemia_date, `oneybefore', study_start)

. 
. egen other_immunosuppression = rowmax(temp1 temp2 temp3)

. drop temp1 temp2 temp3

. order other_immunosuppression, after(temporary_immunodeficiency)

. 
. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 2930 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(7,958 real changes made, 7,958 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(7,958 missing values generated)

. 
. gen min=.
(147,741 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(71,100 real changes made)

. replace min = SCr_adj/0.9 if male==1
(68,683 real changes made)

. replace min = min^-0.329  if male==0
(71,100 real changes made)

. replace min = min^-0.411  if male==1
(68,683 real changes made)

. replace min = 1 if min<1
(38,447 real changes made)

. 
. gen max=.
(147,741 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(71,100 real changes made)

. replace max=SCr_adj/0.9 if male==1
(68,683 real changes made)

. replace max=max^-1.209
(139,783 real changes made)

. replace max=1 if max>1
(109,294 real changes made)

. 
. * egfr calculated using CKD-EPI formula with no eth
. gen egfr=min*max*141
(7,958 missing values generated)

. replace egfr=egfr*(0.993^age)
(138,134 real changes made)

. replace egfr=egfr*1.018 if male==0
(71,100 real changes made)

. 
. * Categorise into ckd stages
. * CKD stage calc without eth
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(7958 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(139783 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
. 
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(138462 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(7,958 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. 
. *More detailed version incorporating stage 5 or dialysis as a separate catego
> ry 
. recode ckd 0=1 2/3=2 4=3 5=4, gen(reduced_kidney_function_cat2)
(138462 differences between ckd and reduced_kidney_function_cat2)

. replace reduced_kidney_function_cat2 = 1 if creatinine==. 
(7,958 real changes made)

. replace reduced_kidney_function_cat2 = 4 if dialysis==1 
(29,280 real changes made)

. 
. label define reduced_kidney_function_cat2lab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4 egfr 15-<30" 4 "
> Stage 5 egfr <15 or dialysis"

. label values reduced_kidney_function_cat2 reduced_kidney_function_cat2lab 

.  
.         
. ***********
. *  Hba1c  *
. ***********
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage<=0
(8,224 real changes made, 8,224 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol<=0
(10,615 real changes made, 10,615 to missing)

. 
. local fifteenmbefore = study_start-15*(365.25/12)

. 
. * Only consider measurements in last 15 months
. replace hba1c_percentage   = . if hba1c_percentage_date   < `fifteenmbefore'
(138,366 real changes made, 138,366 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol_date < `fifteenmbefore'
(135,922 real changes made, 135,922 to missing)

. 
. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      1,151    4.970939    1.945856   .0484899   12.39934
hba1c_mmol~l |      1,204    40.61933    18.47322   .5745187   112.3456

. gen     hba1c_pct = hba1c_percentage 
(146,590 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(1,204 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(2,349 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(146,067 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(348 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(117 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(137 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(73 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      1,674       71.26       71.26
  >=6.5-7.4 |        348       14.81       86.08
  >=7.5-7.9 |        117        4.98       91.06
    >=8-8.9 |        137        5.83       96.89
        >=9 |         73        3.11      100.00
------------+-----------------------------------
      Total |      2,349      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if diabetes==0
(29,545 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(415 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(73 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(29,057 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. * Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. 
. ******************************
. *  Aggregated comorbidities  *
. ******************************
. 
. /*
>         Create a comorbidities variable based upon Fizz's JCVI work that has 
> 0, 1, 2 or more of 
>         the following comorbdities: 
>         (1) respiratory disease, (2) severe asthma, (3) chronic cardiac disea
> se, (4) diabetes, 
>         (5) non-haematological cancer (diagnosed in last year), (6) haematolo
> gical cancer (diagnosed within 5 years), 
>         (7) liver disease, (8) stroke, (9) dementia, (10) poor kidney functio
> n, (11) organ transplant, 
>         (12) asplenia, (13) other immunosuppression.
> */
. 
. 
. *(1) respiratory disease
. tab chronic_respiratory_disease

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,312       80.08       80.08
          1 |     29,429       19.92      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *think I need level "3" of this, as this is asthma that requires OCS
. *(2) severe asthma
. tab asthmacat

   asthmacat |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |    141,757       95.95       95.95
 Yes, no OCS |      2,927        1.98       97.93
Yes with OCS |      3,057        2.07      100.00
-------------+-----------------------------------
       Total |    147,741      100.00

. generate asthma_severe=0

. replace asthma_severe=1 if asthmacat==3
(3,057 real changes made)

. tab asthma_severe

asthma_seve |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    144,684       97.93       97.93
          1 |      3,057        2.07      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(3) cardiac disease
. tab chronic_cardiac_disease

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,361       80.11       80.11
          1 |     29,380       19.89      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(4) diabetes
. tab diabcat

                   diabcat |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
               No diabetes |    118,196       80.00       80.00
       Controlled diabetes |        415        0.28       80.28
     Uncontrolled diabetes |         73        0.05       80.33
Diabetes, no hba1c measure |     29,057       19.67      100.00
---------------------------+-----------------------------------
                     Total |    147,741      100.00

. tab diabcat, nolabel

    diabcat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    118,196       80.00       80.00
          2 |        415        0.28       80.28
          3 |         73        0.05       80.33
          4 |     29,057       19.67      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. generate dm=0

. replace dm=1 if diabcat>1
(29,545 real changes made)

. tab dm

         dm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,196       80.00       80.00
          1 |     29,545       20.00      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. tab dm diabcat

           |                   diabcat
        dm | No diabet  Controlle  Uncontrol  Diabetes, |     Total
-----------+--------------------------------------------+----------
         0 |   118,196          0          0          0 |   118,196 
         1 |         0        415         73     29,057 |    29,545 
-----------+--------------------------------------------+----------
     Total |   118,196        415         73     29,057 |   147,741 

. 
. *(5) non-haem cancer (in previous year)
. tab cancer_exhaem

cancer_exhaem |
         _cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     94,602       64.03       64.03
    Last year |      1,065        0.72       64.75
2-5 years ago |      4,594        3.11       67.86
     5+ years |     47,480       32.14      100.00
--------------+-----------------------------------
        Total |    147,741      100.00

. tab cancer_exhaem, nolab

cancer_exha |
     em_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,602       64.03       64.03
          2 |      1,065        0.72       64.75
          3 |      4,594        3.11       67.86
          4 |     47,480       32.14      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. generate cancer_nonhaemPrevYear=0

. replace cancer_nonhaemPrevYear=1 if cancer_exhaem_cat==2
(1,065 real changes made)

. tab cancer_nonhaemPrevYear

cancer_nonh |
aemPrevYear |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    146,676       99.28       99.28
          1 |      1,065        0.72      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(6) haem cancer (within previous 5 years)
. tab cancer_haem

cancer_haem_c |
           at |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |    118,350       80.11       80.11
    Last year |        570        0.39       80.49
2-5 years ago |      2,210        1.50       81.99
     5+ years |     26,611       18.01      100.00
--------------+-----------------------------------
        Total |    147,741      100.00

. tab cancer_haem, nolab

cancer_haem |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    118,350       80.11       80.11
          2 |        570        0.39       80.49
          3 |      2,210        1.50       81.99
          4 |     26,611       18.01      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. generate cancer_haemPrev5Years=0

. replace cancer_haemPrev5Years=1 if inrange(cancer_haem_cat,2,3)
(2,780 real changes made)

. tab cancer_haemPrev5Years

cancer_haem |
 Prev5Years |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    144,961       98.12       98.12
          1 |      2,780        1.88      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(7) liver disease
. tab chronic_liver_disease

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,502       80.21       80.21
          1 |     29,239       19.79      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(8 and 9) stroke or dementia
. tab stroke_dementia

stroke_deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     94,539       63.99       63.99
          1 |     53,202       36.01      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(10) poor kidney function
. tab reduced_kidney_function_cat2

    RECODE of ckd (RECODE of |
                   egfr_cat) |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |    117,388       79.46       79.46
Stage 3a/3b egfr 30-60       |      1,073        0.73       80.18
Stage 5 egfr <15 or dialysis |     29,280       19.82      100.00
-----------------------------+-----------------------------------
                       Total |    147,741      100.00

. tab reduced_kidney_function_cat2, nolabel

  RECODE of |
ckd (RECODE |
         of |
  egfr_cat) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    117,388       79.46       79.46
          2 |      1,073        0.73       80.18
          4 |     29,280       19.82      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. gen egfr60 = 0

. replace egfr60 = 1 if reduced_kidney_function_cat2 > 1
(30,353 real changes made)

. tab egfr60 reduced_kidney_function_cat2

           |     RECODE of ckd (RECODE of
           |            egfr_cat)
    egfr60 |      None  Stage 3a/  Stage 5 e |     Total
-----------+---------------------------------+----------
         0 |   117,388          0          0 |   117,388 
         1 |         0      1,073     29,280 |    30,353 
-----------+---------------------------------+----------
     Total |   117,388      1,073     29,280 |   147,741 

. 
. *(11) organ transplant
. tab organ_transplant

organ_trans |
      plant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,104       79.94       79.94
          1 |     29,637       20.06      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(12) asplenia
. tab spleen

     spleen |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     94,415       63.91       63.91
          1 |     53,326       36.09      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *(13) other immunosuppression
. tab other_immuno

other_immun |
osuppressio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     94,104       63.70       63.70
          1 |     53,637       36.30      100.00
------------+-----------------------------------
      Total |    147,741      100.00

. 
. *create a total comborb var
. order chronic_respiratory_disease asthma_severe chronic_cardiac_disease dm ca
> ncer_nonhaemPrevYear cancer_haemPrev5Years chronic_liver_disease stroke_demen
> tia egfr60 organ_transplant spleen other_immuno

. egen totComorbsOfInterest=rowtotal(chronic_respiratory_disease - other_immuno
> )

. summ totComorbsOfInterest, d

                    totComorbsOfInterest
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs             147,741
25%            1              0       Sum of Wgt.     147,741

50%            2                      Mean           2.332799
                        Largest       Std. Dev.      1.304305
75%            3              8
90%            4              8       Variance       1.701211
95%            5              8       Skewness       .3667105
99%            6              8       Kurtosis       2.946018

. order totComorbsOfInterest

. 
. *create the covariate var I need
. generate comorb_cat=.
(147,741 missing values generated)

. replace comorb_cat=0 if totComorbsOfInterest==0
(9,708 real changes made)

. replace comorb_cat=1 if totComorbsOfInterest==1
(30,930 real changes made)

. replace comorb_cat=2 if totComorbsOfInterest>1
(107,103 real changes made)

. 
. label define comorb_catLab      0 "No comorbidity"      ///
>                                                         1 "1 comorbidity"    
>            ///
>                                                         2 "2+ comorbidities" 
>                    

. label values comorb_cat comorb_catLab

. tab comorb_cat, m

      comorb_cat |      Freq.     Percent        Cum.
-----------------+-----------------------------------
  No comorbidity |      9,708        6.57        6.57
   1 comorbidity |     30,930       20.94       27.51
2+ comorbidities |    107,103       72.49      100.00
-----------------+-----------------------------------
           Total |    147,741      100.00

. 
. 
. 
. ********************************
. *  Outcomes and survival time  *
. ********************************
. 
. /*  28-day risk censoring dates  */
. noi di "REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD"
REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD

. gen ons_data_date = date("29jan2021", "DMY")

. gen ons_data_cens = ons_data_date-14                    // Censor 14 days pri
> or to ONS death data upload

. gen risk_28_days = study_start+28

. gen risk_40_days = study_start+40

. 
. * 28-day risk population
. gen risk_pop = (risk_28_days <= ons_data_cens)  // Indicator for has 28-days 
> follow-up

. gen time_check_28 = ons_data_cens-study_start

. summ time_check_28 if risk_pop == 1, d

                        time_check_28
-------------------------------------------------------------
      Percentiles      Smallest
 1%           28             28
 5%           29             28
10%           31             28       Obs             102,429
25%           36             28       Sum of Wgt.     102,429

50%           44                      Mean           43.99031
                        Largest       Std. Dev.      9.192327
75%           52             59
90%           57             59       Variance       84.49888
95%           58             59       Skewness      -.0618207
99%           59             59       Kurtosis       1.807374

. 
. * 40-day risk population
. gen risk_pop_40 = (risk_40_days <= ons_data_cens)       // Indicator for has 
> 40-days follow-up

. gen time_check_40 = ons_data_cens-study_start

. summ time_check_40 if risk_pop_40 == 1, d

                        time_check_40
-------------------------------------------------------------
      Percentiles      Smallest
 1%           40             40
 5%           41             40
10%           42             40       Obs              66,363
25%           45             40       Sum of Wgt.      66,363

50%           50                      Mean           49.64277
                        Largest       Std. Dev.      5.767702
75%           55             59
90%           58             59       Variance       33.26639
95%           59             59       Skewness      -.0340448
99%           59             59       Kurtosis        1.78879

. 
. /*   Outcomes   */
. 
. * 28-day risk indicator
. gen died_pre_cens = (died_date_ons < ons_data_cens)

. gen death_time = died_date_ons-study_start if died_pre_cens == 1
(144,779 missing values generated)

. summ death_time, d

                         death_time
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            4              1       Obs               2,962
25%            9              1       Sum of Wgt.       2,962

50%           19                      Mean           20.95476
                        Largest       Std. Dev.      13.83269
75%           31             57
90%           41             57       Variance       191.3434
95%           46             58       Skewness       .4994578
99%           54             58       Kurtosis       2.365099

. 
. gen risk_28 = (death_time <= 28)

. tab died_pre_cens risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_28
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |   144,779          0 |   144,779 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |       860      2,102 |     2,962 
           |     29.03      70.97 |    100.00 
-----------+----------------------+----------
     Total |   145,639      2,102 |   147,741 
           |     98.58       1.42 |    100.00 

. 
. * 40-day risk indicator
. gen risk_40 = (death_time <= 40)

. tab died_pre_cens risk_40, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_40
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |   144,779          0 |   144,779 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |       318      2,644 |     2,962 
           |     10.74      89.26 |    100.00 
-----------+----------------------+----------
     Total |   145,097      2,644 |   147,741 
           |     98.21       1.79 |    100.00 

. 
. /* Survival time */
. 
. * Censoring date for Cox
. gen vacc_cens = covid_vacc_date - 7 if covid_vacc_date != .
(121,505 missing values generated)

. gen cox_pop = (study_start < vacc_cens)                 // Exclude if vaccina
> ted within 7 days

. 
. * Censor at death, ons data censor, or 7 days prior to vaccine
. gen stime_death = min(died_date_ons, ons_data_cens, vacc_cens)

. 
. gen cox_death = (died_date_ons < .)

. replace cox_death = 0 if (died_date_ons > stime_death)
(2,478 real changes made)

. 
. gen cox_time = stime_death-study_start

. 
. * Format date variables
. format ons_data_date ons_data_cens risk_28_days risk_40_days stime_death %td 

. 
.                 
. *********************
. *  Label variables  *
. *********************
. 
. * Remove old labels
. foreach var of varlist _all {
  2.         label var `var' ""
  3. }

. 
. * Demographics
. label var patient_id                                    "Patient ID"

. label var start_week                                    "Epidemiological week
>  of study"

. label var age                                                   "Age (years)"

. label var agegroup                                              "Grouped age"

. label var agegroupA                                             "Age subgroup
> s"

. label var age70                                                 "70 years and
>  older"

. label var age1                                                  "Age spline 1
> "

. label var age2                                                  "Age spline 2
> "

. label var age3                                                  "Age spline 3
> "

. label var male                                                  "Male"

. label var bmi                                                   "Body Mass In
> dex (BMI, kg/m2)"

. label var bmicat                                                "Grouped BMI"

. label var bmi_date                                      "Body Mass Index (BMI
> , kg/m2), date measured"

. label var obese4cat                                             "Evidence of 
> obesity (missing set to none)"

. label var smoke                                                 "Smoking stat
> us"

. label var smoke_nomiss                                  "Smoking status (miss
> ing set to never)"

. label var imd                                                   "Index of Mul
> tiple Deprivation (IMD)"

. label var eth5                                                  "Ethnicity in
>  5 categories"

. label var ethnicity_16                                  "Ethnicity in 16 cate
> gories"

. label var ethnicity_16_combinemixed             "Ethnicity detailed with mixe
> d groups combined"

. label var stp                                                   "Sustainabili
> ty and Transformation Partnership"

. label var region                                                "NHS England 
> region"

. label var utla_group                                    "UTLA"

. label var rural_urban                                   "Rural urban classifi
> cation"

. label var rural_urban5                                  "Rural Urban in five 
> categories"

. 
. label var household_size                                "Household size"

. label var hh_total_cat                                  "Categorical househol
> d size"

. label var care_home_type                                "Care home status"

. label var home_bin                                              "Binary care 
> home status"

. 
. /*
> label var hba1ccat                                              "Categorised 
> hba1c"
> label var egfr_cat                                              "Calculated e
> GFR"
> label var bp_sys                                                "Systolic blo
> od pressure"
> label var bp_sys_date                                   "Systolic blood press
> ure, date"
> label var bp_dias                                               "Diastolic bl
> ood pressure"
> label var bp_dias_date                                  "Diastolic blood pres
> sure, date"
> label var bpcat                                                 "Grouped bloo
> d pressure"
> label var bphigh                                                "Binary high 
> (stage 1/2) blood pressure"
> label var htdiag_or_highbp                              "Diagnosed hypertensi
> on or high blood pressure"
> */
. 
. /*
> label var c_age                                                 "Centred age"
> label var c_male                                                "Centred sex 
> (code: -1/+1)"
> label var c_imd                                                 "Centred Inde
> x of Multiple Deprivation (values: -2/+2)"
> label var c_ethnicity                                   "Centred ethnicity (v
> alues: -2/+2)"
> */
. 
. * Comorbidities
. /*
> label var chronic_respiratory_disease   "Respiratory disease (excl. asthma)"
> label var asthmacat                                             "Asthma, grou
> ped by severity (OCS use)"
> label var asthma                                                "Asthma"
> label var chronic_cardiac_disease               "Heart disease"
> label var diabetes                                              "Diabetes"
> label var diabcat                                               "Diabetes, gr
> ouped"
> label var cancer_exhaem_cat                             "Cancer (exc. haemato
> logical), grouped by time since diagnosis"
> label var cancer_haem_cat                               "Haematological malig
> nancy, grouped by time since diagnosis"
> label var chronic_liver_disease                 "Chronic liver disease"
> label var stroke_dementia                               "Stroke or dementia"
> label var other_neuro                                   "Neuro condition othe
> r than stroke/dementia"    
> label var reduced_kidney_function_cat   "Reduced kidney function" 
> label var organ_transplant                              "Organ transplant rec
> ipient"
> label var dysplenia                                             "Dysplenia (s
> plenectomy, other, not sickle cell)"
> label var sickle_cell                                   "Sickle cell"
> label var spleen                                                "Spleen probl
> ems (dysplenia, sickle cell)"
> label var ra_sle_psoriasis                              "RA, SLE, Psoriasis (
> autoimmune disease)"
> label var aplastic_anaemia                              "Aplastic anaemia"
> label var hiv                                                   "HIV"
> label var permanent_immunodeficiency    "Permanent immunodeficiency"
> label var temporary_immunodeficiency    "Temporary immunosuppression"
> label var other_immunosuppression               "Immunosuppressed (combinatio
> n algorithm)"
> label var chronic_respiratory_disease_date      "Respiratory disease (excl. a
> sthma), date"
> label var chronic_cardiac_disease_date  "Heart disease, date"
> label var diabetes_date                                 "Diabetes, date"
> label var lung_cancer_date                              "Lung cancer, date"
> label var haem_cancer_date                              "Haem. cancer, date"
> label var other_cancer_date                             "Any cancer, date"
> label var chronic_liver_disease_date    "Liver, date"
> label var stroke_date                                   "Stroke, date"
> label var dementia_date                                 "Dementia, date"
> label var other_neuro_date                              "Neuro condition othe
> r than stroke/dementia, date"      
> label var organ_transplant_date                 "Organ transplant recipient, 
> date"
> label var dysplenia_date                                "Splenectomy etc, dat
> e"
> label var sickle_cell_date                              "Sickle cell, date"
> label var ra_sle_psoriasis_date                 "RA, SLE, Psoriasis (autoimmu
> ne disease), date"
> label var aplastic_anaemia_date                 "Aplastic anaemia, date"
> label var hiv_date                                              "HIV, date"
> label var permanent_immunodeficiency_date "Permanent immunodeficiency, date"
> label var temporary_immunodeficiency_date "Temporary immunosuppression, date"
> label var dialysis                                              "Dialysis"
> */
. label var comorb_cat                                    "Categorical number o
> f comorbidites"

. 
.         
. * Outcomes and follow-up
. label var study_start                                   "Date of study entry"

. label var study_end                                             "Date of last
>  entry"

. label var risk_pop                                              "1=Population
>  for 28-day risk analysis"

. label var risk_pop_40                                   "1=Population for 40-
> day risk analysis"

. label var risk_28                                               "28-day outco
> me"

. label var risk_40                                               "40-day outco
> me"

. label var cox_pop                                               "1=Population
>  for Cox analysis"

. label var stime_death                                   "Date of study exit"

. label var cox_death                                             "Outcome for 
> Cox"

. label var cox_time                                              "Survival tim
> e"

. label var sgtf                                                  "Exposure: 0=
> VOC; 1=non-VOC"

. 
. 
. ***************
. *  Tidy data  *
. ***************
. 
. * REDUCE DATASET SIZE TO VARIABLES NEEDED - KEEP THOSE WITH LABELS
. ds , has(varl)
bmi_date_m~d  study_start   region        imd           risk_40
sgtf          study_end     agegroup      hh_total_cat  cox_pop
age           male          agegroupA     rural_urban5  stime_death
rural_urban   smoke         age70         home_bin      cox_death
household_~e  smoke_nomiss  age1          start_week    cox_time
care_home_~e  eth5          age2          comorb_cat
bmi           ethnicity_~d  age3          risk_pop
ethnicity_16  stp           bmicat        risk_pop_40
patient_id    utla_group    obese4cat     risk_28

. keep `r(varlist)'

. 
. 
. ***************
. *  Save data  *
. ***************
. 
. sort patient_id

. order patient_id risk_pop risk_pop_40 risk_28 risk_40 cox_pop cox_death stime
> _death cox_time sgtf

. 
. label data "SGTF CFR ANALYSIS DATASET: $S_DATE"

. 
. save ./output/cr_analysis_dataset.dta, replace
(note: file ./output/cr_analysis_dataset.dta not found)
file ./output/cr_analysis_dataset.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 closed on:  12 Feb 2021, 16:48:51
-------------------------------------------------------------------------------
