-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 opened on:  14 Feb 2021, 20:47:38

. 
. clear

. 
. /*
> import delimited "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output
> \input.csv"
> merge m:1 msoa using "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\lo
> okups\MSOA_lookup"
> drop if _merge==2
> drop _merge
> */
. 
. import delimited ./output/input.csv
(58 vars, 400,000 obs)

. merge m:1 msoa using ./lookups/MSOA_lookup

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           400,000  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(0 observations deleted)

. drop _merge

. 
. 
. rename hiv hiv_code

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. gen study_start = date(sgss_pos_inrange, "YMD")
(79,999 missing values generated)

. summ study_start

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 study_start |    320,001    22259.96    14.15358      22236      22284

. noi disp "MINIMUM START DATE: " %td r(min)
MINIMUM START DATE: 17nov2020

. 
. gen study_end = date("04jan2021", "DMY")

. format %td study_start study_end

. 
. * DROP IF NO POSITIVE PCR TEST IN SGSS DURING STUDY PERIOD
. noi di "NO POSITIVE TEST IN STUDY PERIOD"
NO POSITIVE TEST IN STUDY PERIOD

. drop if sgss_pos_inrange == ""
(79,999 observations deleted)

. 
. * DROP IF DIED ON/BEFORE STUDY START DATE
. noi di "DIED ON/BEFORE STUDY START DATE:" 
DIED ON/BEFORE STUDY START DATE:

. drop if date(died_date_ons, "YMD") <= study_start
(21,625 observations deleted)

. 
. * DROP IF COVID POSITIVE ON/BEFORE STUDY START DATE
. noi di "COVID POSITIVE BEFORE STUDY START DATE:" 
COVID POSITIVE BEFORE STUDY START DATE:

. drop if date(covid_tpp_probable, "YMD") < study_start
(26,216 observations deleted)

. drop if date(first_pos_test_sgss, "YMD") < study_start
(81,271 observations deleted)

. 
. * DROP IF VACCINATED ON/BEFORE STUDY START DATE
. noi di "VACCINATED ON/BEFORE STUDY START DATE:" 
VACCINATED ON/BEFORE STUDY START DATE:

. drop if date(covid_vacc_date, "YMD") <= study_start
(5,022 observations deleted)

. 
. * Age: Exclude children
. *noi di "DROPPING AGE<18:" 
. *drop if age<18
. 
. * Age: Exclude those with implausible ages
. assert age<.

. noi di "DROPPING AGE>105:" 
DROPPING AGE>105:

. drop if age>105
(23 observations deleted)

. 
. * Sex: Exclude categories other than M and F
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. 
. **************************
. *  CREATE SGTF VARIABLE  *
. **************************
. 
. desc sgtf

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
sgtf            byte    %8.0g                 

. 
. replace sgtf=99 if sgtf==.
(18,528 real changes made)

. 
. gen has_sgtf=0

. replace has_sgtf=1 if inrange(sgtf,0,1)
(148,809 real changes made)

. 
. label define sgtfLab 0 "non-VOC" 1 "VOC" 9 "Unclassified" 99 "Blank"

. label values sgtf sgtfLab

. 
. 
. ******************************
. *  Convert strings to dates  *
. ******************************
. 
. * Covariates
. foreach var of varlist  bp_sys_date                                     ///
>                                                 bp_dias_date                 
>                    ///
>                                                 hba1c_percentage_date        
>            ///
>                                                 hba1c_mmol_per_mol_date      
>            ///
>                                                 hypertension                 
>                    ///
>                                                 bmi_date_measured            
>                    ///
>                                                 chronic_respiratory_disease  
>    ///
>                                                 chronic_cardiac_disease      
>            ///
>                                                 diabetes                     
>                            ///
>                                                 lung_cancer                  
>                    ///
>                                                 haem_cancer                  
>                            ///
>                                                 other_cancer                 
>                    ///
>                                                 chronic_liver_disease        
>            ///
>                                                 stroke                       
>                            ///
>                                                 dementia                     
>                            ///
>                                                 other_neuro                  
>                    ///
>                                                 organ_transplant             
>                    ///     
>                                                 dysplenia                    
>                            ///
>                                                 sickle_cell                  
>                    ///
>                                                 aplastic_anaemia             
>                    ///
>                                                 hiv_date                     
>                            ///
>                                                 permanent_immunodeficiency   
>            ///
>                                                 temporary_immunodeficiency   
>            ///
>                                                 ra_sle_psoriasis  dialysis   
>    {
  2.         confirm string variable `var'
  3.         replace `var' = `var' + "-15"
  4.         rename `var' `var'_dstr
  5.         replace `var'_dstr = " " if `var'_dstr == "-15"
  6.         gen `var'_date = date(`var'_dstr, "YMD") 
  7.         order `var'_date, after(`var'_dstr)
  8.         drop `var'_dstr
  9.         format `var'_date %td
 10. }
variable bp_sys_date_measured was str7 now str10
(185,844 real changes made)
(9,240 real changes made)
(9,240 missing values generated)
variable bp_dias_date_measured was str7 now str10
(185,844 real changes made)
(9,300 real changes made)
(9,300 missing values generated)
variable hba1c_percentage_date was str7 now str10
(185,844 real changes made)
(9,375 real changes made)
(9,375 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(185,844 real changes made)
(9,338 real changes made)
(9,338 missing values generated)
variable hypertension was str7 now str10
(185,844 real changes made)
(148,672 real changes made)
(148,672 missing values generated)
variable bmi_date_measured was str7 now str10
(185,844 real changes made)
(9,304 real changes made)
(9,304 missing values generated)
variable chronic_respiratory_disease was str7 now str10
(185,844 real changes made)
(148,636 real changes made)
(148,636 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(185,844 real changes made)
(148,618 real changes made)
(148,618 missing values generated)
variable diabetes was str7 now str10
(185,844 real changes made)
(148,717 real changes made)
(148,717 missing values generated)
variable lung_cancer was str7 now str10
(185,844 real changes made)
(148,684 real changes made)
(148,684 missing values generated)
variable haem_cancer was str7 now str10
(185,844 real changes made)
(148,509 real changes made)
(148,509 missing values generated)
variable other_cancer was str7 now str10
(185,844 real changes made)
(148,656 real changes made)
(148,656 missing values generated)
variable chronic_liver_disease was str7 now str10
(185,844 real changes made)
(148,581 real changes made)
(148,581 missing values generated)
variable stroke was str7 now str10
(185,844 real changes made)
(148,578 real changes made)
(148,578 missing values generated)
variable dementia was str7 now str10
(185,844 real changes made)
(148,763 real changes made)
(148,763 missing values generated)
variable other_neuro was str7 now str10
(185,844 real changes made)
(148,749 real changes made)
(148,749 missing values generated)
variable organ_transplant was str7 now str10
(185,844 real changes made)
(148,781 real changes made)
(148,781 missing values generated)
variable dysplenia was str7 now str10
(185,844 real changes made)
(148,486 real changes made)
(148,486 missing values generated)
variable sickle_cell was str7 now str10
(185,844 real changes made)
(148,492 real changes made)
(148,492 missing values generated)
variable aplastic_anaemia was str7 now str10
(185,844 real changes made)
(148,545 real changes made)
(148,545 missing values generated)
variable hiv_date was str7 now str10
(185,844 real changes made)
(148,707 real changes made)
(148,707 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(185,844 real changes made)
(148,685 real changes made)
(148,685 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(185,844 real changes made)
(148,647 real changes made)
(148,647 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(185,844 real changes made)
(148,829 real changes made)
(148,829 missing values generated)
variable dialysis was str7 now str10
(185,844 real changes made)
(148,805 real changes made)
(148,805 missing values generated)

. 
. rename bmi_date_measured_date      bmi_date_measured

. rename bp_dias_date_measured_date  bp_dias_date

. rename bp_sys_date_measured_date   bp_sys_date

. rename hba1c_percentage_date_date  hba1c_percentage_date

. rename hba1c_mmol_per_mol_date_date  hba1c_mmol_per_mol_date

. rename hiv_date_date hiv_date

. 
. * Dates of: covid tests, ONS death
. foreach var of varlist  dereg_date died_date_ons covid_tpp_probable covid_vac
> c_date ///
>                                                 first_pos_test_sgss sgss_pos_
> inrange {
  2.                 confirm string variable `var'
  3.                 rename `var' _tmp
  4.                 gen `var' = date(_tmp, "YMD")
  5.                 drop _tmp
  6.                 format %d `var'
  7. }
(185,844 missing values generated)
(179,245 missing values generated)
(162,725 missing values generated)
(152,741 missing values generated)
(158,809 missing values generated)

.  
.  
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. * BMI 
. 
. * Only keep if within certain time period? using bmi_date_measured ?
. * NB: Some BMI dates in future or after cohort entry
. 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(25,100 real changes made, 25,100 to missing)

. 
. * Sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. 
. label define maleLab 0 "F" 1 "M"

. label values male maleLab

. 
. 
. * Smoking
. label define smoke_nomissLab 1 "Never" 2 "Former" 3 "Current" 

. 
. gen     smoke = 1  if smoking_status=="N"
(178,454 missing values generated)

. replace smoke = 2  if smoking_status=="E"
(3,629 real changes made)

. replace smoke = 3  if smoking_status=="S"
(22,413 real changes made)

. replace smoke = . if smoking_status=="M"
(0 real changes made)

. label values smoke smoke_nomissLab

. drop smoking_status

. 
. * Ethnicity (5 category)
. tab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    104,379       56.16       56.16
          2 |      7,104        3.82       59.99
          3 |      6,975        3.75       63.74
          4 |      6,938        3.73       67.47
          5 |     13,835        7.44       74.92
          . |     46,613       25.08      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicityLab       1 "White"                                    
>    ///
>                                                         2 "Mixed"            
>                            ///
>                                                         3 "Asian or Asian Bri
> tish"      ///
>                                                         4 "Black"            
>                            ///
>                                                         5 "Other"            
>                            

.                                                 
. label values ethnicity ethnicityLab

. 
. * Re-order ethnicity
. gen eth5=1 if ethnicity==1
(81,465 missing values generated)

. replace eth5=2 if ethnicity==3
(6,975 real changes made)

. replace eth5=3 if ethnicity==4
(6,938 real changes made)

. replace eth5=4 if ethnicity==2
(7,104 real changes made)

. replace eth5=5 if ethnicity==5
(13,835 real changes made)

. replace eth5=9 if ethnicity==.
(46,613 real changes made)

. 
. label define eth5Lab    1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 9 "Missing"

.  
. label values eth5 eth5Lab

. 
. recode eth5 2/4=5, gen(eth2)
(21017 differences between eth5 and eth2)

. order eth2, after(eth5)

. 
. label values eth2 eth5Lab

. 
. tab eth2, m

  RECODE of |
       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |    104,379       56.16       56.16
      Other |     34,852       18.75       74.92
    Missing |     46,613       25.08      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. 
. * Ethnicity (16 category)
. replace ethnicity_16 = . if ethnicity==.
(35,081 real changes made, 35,081 to missing)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British or Mixed British" 
>            ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Black Caribbean"  
>            ///
>                                                 5 "White + Black African"    
>                    ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian or British Indian" 
>            ///
>                                                 9 "Pakistani or British Pakis
> tani"      ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    

.                                                 
. label values ethnicity_16 ethnicity_16

. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen ethnicity_16_combinemixed = ethnicity_16
(81,538 missing values generated)

. recode ethnicity_16_combinemixed 4/7 = 4
(ethnicity_16_combinemixed: 10425 changes made)

. label define ethnicity_16_combinemixed  ///
>                                                 1 "British or Mixed British" 
> ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "All mixed" ///
>                                                 8 "Indian or British Indian" 
> ///
>                                                 9 "Pakistani or British Pakis
> tani" ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian" ///
>                                                 12 "Caribbean" ///
>                                                 13 "African" ///
>                                                 14 "Other Black" ///
>                                                 15 "Chinese" ///
>                                                 16 "Other" 

.                                                 
. label values ethnicity_16_combinemixed ethnicity_16_combinemixed

. 
. * STP 
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     18,482        9.94        9.94
      STP10 |     18,557        9.99       19.93
       STP2 |     18,568        9.99       29.92
       STP3 |     18,726       10.08       40.00
       STP4 |     18,580       10.00       50.00
       STP5 |     18,688       10.06       60.05
       STP6 |     18,587       10.00       70.05
       STP7 |     18,564        9.99       80.04
       STP8 |     18,696       10.06       90.10
       STP9 |     18,396        9.90      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(185,834 missing values generated)

. replace stp = sum(stp)
(185,843 real changes made)

. drop stp_old

. 
. * MSOA/UTLA
. 
. egen n_msoa = tag(msoa)

. count if n_msoa
  6,791

. 
. bysort msoa: gen count1 = _N

. summ count1, d

                           count1
-------------------------------------------------------------
      Percentiles      Smallest
 1%           17             11
 5%           20             11
10%           22             11       Obs             185,844
25%           25             11       Sum of Wgt.     185,844

50%           28                      Mean           28.37778
                        Largest       Std. Dev.       5.25593
75%           32             47
90%           35             47       Variance        27.6248
95%           37             47       Skewness       .1774752
99%           41             47       Kurtosis       2.979996

. 
. egen n_utla = tag(utla)

. count if n_utla
  151

. 
. bysort utla: gen count2 = _N

. summ count2, d

                           count2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          432             20
 5%          574             20
10%          650             20       Obs             185,844
25%          885             20       Sum of Wgt.     185,844

50%         1585                      Mean           1953.247
                        Largest       Std. Dev.      1319.336
75%         2767           5061
90%         4218           5061       Variance        1740648
95%         4908           5061       Skewness       .9220343
99%         5061           5061       Kurtosis       2.728723

. 
. * Regroup UTLAs with small case numbers
. 
. gen utla_group = utla_name

. tab utla_group

          utla_group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Barking and Dagenham |        600        0.32        0.32
              Barnet |      1,123        0.60        0.93
            Barnsley |        836        0.45        1.38
 Bath and North East |        705        0.38        1.76
             Bedford |        574        0.31        2.07
              Bexley |        774        0.42        2.48
          Birmingham |      3,621        1.95        4.43
Blackburn with Darwe |        464        0.25        4.68
           Blackpool |        475        0.26        4.94
              Bolton |        983        0.53        5.46
Bournemouth, Christc |      1,387        0.75        6.21
    Bracknell Forest |        414        0.22        6.43
            Bradford |      1,675        0.90        7.33
               Brent |        897        0.48        7.82
   Brighton and Hove |        901        0.48        8.30
    Bristol, City of |      1,499        0.81        9.11
             Bromley |      1,107        0.60        9.70
     Buckinghamshire |      1,834        0.99       10.69
                Bury |        713        0.38       11.07
          Calderdale |        730        0.39       11.47
      Cambridgeshire |      2,055        1.11       12.57
              Camden |        817        0.44       13.01
Central Bedfordshire |        873        0.47       13.48
       Cheshire East |      1,374        0.74       14.22
Cheshire West and Ch |      1,309        0.70       14.93
      City of London |         20        0.01       14.94
            Cornwall |      2,007        1.08       16.02
       County Durham |      1,847        0.99       17.01
            Coventry |      1,121        0.60       17.61
             Croydon |      1,165        0.63       18.24
             Cumbria |      1,794        0.97       19.21
          Darlington |        440        0.24       19.44
               Derby |        813        0.44       19.88
          Derbyshire |      2,773        1.49       21.37
               Devon |      2,954        1.59       22.96
           Doncaster |      1,038        0.56       23.52
              Dorset |      1,303        0.70       24.22
              Dudley |      1,204        0.65       24.87
              Ealing |      1,099        0.59       25.46
East Riding of Yorks |      1,197        0.64       26.11
         East Sussex |      1,915        1.03       27.14
             Enfield |        997        0.54       27.67
               Essex |      4,908        2.64       30.31
           Gateshead |        756        0.41       30.72
     Gloucestershire |      2,059        1.11       31.83
           Greenwich |        918        0.49       32.32
             Hackney |        787        0.42       32.75
              Halton |        415        0.22       32.97
Hammersmith and Fulh |        687        0.37       33.34
           Hampshire |      4,494        2.42       35.76
            Haringey |        988        0.53       36.29
              Harrow |        825        0.44       36.73
          Hartlepool |        335        0.18       36.91
            Havering |        808        0.43       37.35
Herefordshire, Count |        660        0.36       37.70
       Hertfordshire |      4,188        2.25       39.96
          Hillingdon |        868        0.47       40.42
            Hounslow |        754        0.41       40.83
       Isle of Wight |        488        0.26       41.09
     Isles of Scilly |         37        0.02       41.11
           Islington |        597        0.32       41.43
Kensington and Chels |        595        0.32       41.75
                Kent |      5,061        2.72       44.48
 Kingston upon Hull, |        885        0.48       44.95
Kingston upon Thames |        562        0.30       45.25
            Kirklees |      1,606        0.86       46.12
            Knowsley |        520        0.28       46.40
             Lambeth |        935        0.50       46.90
          Lancashire |      4,218        2.27       49.17
               Leeds |      2,930        1.58       50.75
           Leicester |      1,020        0.55       51.30
      Leicestershire |      2,308        1.24       52.54
            Lewisham |      1,027        0.55       53.09
        Lincolnshire |      2,462        1.32       54.42
           Liverpool |      1,652        0.89       55.30
               Luton |        619        0.33       55.64
          Manchester |      1,570        0.84       56.48
              Medway |        990        0.53       57.02
              Merton |        670        0.36       57.38
       Middlesbrough |        533        0.29       57.66
       Milton Keynes |        900        0.48       58.15
 Newcastle upon Tyne |        847        0.46       58.60
              Newham |      1,044        0.56       59.16
             Norfolk |      3,021        1.63       60.79
North East Lincolnsh |        611        0.33       61.12
  North Lincolnshire |        651        0.35       61.47
      North Somerset |        692        0.37       61.84
      North Tyneside |        816        0.44       62.28
     North Yorkshire |      2,076        1.12       63.40
    Northamptonshire |      2,467        1.33       64.72
      Northumberland |      1,127        0.61       65.33
          Nottingham |      1,032        0.56       65.89
     Nottinghamshire |      2,691        1.45       67.33
              Oldham |        874        0.47       67.80
         Oxfordshire |      2,317        1.25       69.05
        Peterborough |        584        0.31       69.37
            Plymouth |        874        0.47       69.84
          Portsmouth |        638        0.34       70.18
             Reading |        452        0.24       70.42
           Redbridge |        807        0.43       70.86
Redcar and Cleveland |        544        0.29       71.15
Richmond upon Thames |        639        0.34       71.49
            Rochdale |        680        0.37       71.86
           Rotherham |        906        0.49       72.35
             Rutland |        153        0.08       72.43
             Salford |        820        0.44       72.87
            Sandwell |      1,075        0.58       73.45
              Sefton |      1,063        0.57       74.02
           Sheffield |      1,952        1.05       75.07
          Shropshire |      1,035        0.56       75.63
              Slough |        370        0.20       75.83
            Solihull |        762        0.41       76.24
            Somerset |      2,036        1.10       77.33
South Gloucestershir |        873        0.47       77.80
      South Tyneside |        593        0.32       78.12
         Southampton |        866        0.47       78.59
     Southend-on-Sea |        432        0.23       78.82
           Southwark |        908        0.49       79.31
          St. Helens |        553        0.30       79.61
       Staffordshire |      3,039        1.64       81.24
           Stockport |      1,129        0.61       81.85
    Stockton-on-Tees |        650        0.35       82.20
      Stoke-on-Trent |        929        0.50       82.70
             Suffolk |      2,415        1.30       84.00
          Sunderland |        984        0.53       84.53
              Surrey |      4,085        2.20       86.73
              Sutton |        633        0.34       87.07
             Swindon |        747        0.40       87.47
            Tameside |        834        0.45       87.92
  Telford and Wrekin |        627        0.34       88.25
            Thurrock |        568        0.31       88.56
              Torbay |        477        0.26       88.82
       Tower Hamlets |        837        0.45       89.27
            Trafford |        738        0.40       89.66
           Wakefield |      1,223        0.66       90.32
             Walsall |      1,068        0.57       90.90
      Waltham Forest |        772        0.42       91.31
          Wandsworth |        996        0.54       91.85
          Warrington |        682        0.37       92.21
        Warwickshire |      1,807        0.97       93.19
      West Berkshire |        614        0.33       93.52
         West Sussex |      2,767        1.49       95.01
         Westminster |        643        0.35       95.35
               Wigan |      1,097        0.59       95.94
           Wiltshire |      1,585        0.85       96.80
Windsor and Maidenhe |        485        0.26       97.06
              Wirral |      1,060        0.57       97.63
           Wokingham |        538        0.29       97.92
       Wolverhampton |        911        0.49       98.41
      Worcestershire |      2,318        1.25       99.65
                York |        643        0.35      100.00
---------------------+-----------------------------------
               Total |    185,844      100.00

. 
. 
. replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Barki
> ng and Dagenham"
variable utla_group was str20 now str31
(600 real changes made)

. replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Redbr
> idge"
(807 real changes made)

. 
. replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Buckingh
> amshire"
(1,834 real changes made)

. replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Oxfordsh
> ire"
(2,317 real changes made)

. replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Swindon"
(747 real changes made)

. replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "West Ber
> kshire"
(614 real changes made)

. 
. replace utla_group = "Camden and Westminster" if utla_name == "Camden"
(817 real changes made)

. replace utla_group = "Camden and Westminster" if utla_name == "Westminster"
(643 real changes made)

. 
. replace utla_group = "" if utla_name == "Isles of Scilly"
(37 real changes made)

. 
. replace utla_group = "Richmond and Hounslow" if utla_name == "Richmond upon T
> hames"
(639 real changes made)

. replace utla_group = "Richmond and Hounslow" if utla_name == "Hounslow"
(754 real changes made)

. 
. replace utla_group = "Rutland and Lincoln" if utla_name == "Rutland"
(153 real changes made)

. replace utla_group = "Rutland and Lincoln" if utla_name == "Lincolnshire"
(2,462 real changes made)

. 
. replace utla_group = "Bolton and Tameside" if utla_name == "Bolton"
(983 real changes made)

. replace utla_group = "Bolton and Tameside" if utla_name == "Tameside"
(834 real changes made)

. 
. tab utla_group, m

                     utla_group |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                                |         37        0.02        0.02
                         Barnet |      1,123        0.60        0.62
                       Barnsley |        836        0.45        1.07
            Bath and North East |        705        0.38        1.45
                        Bedford |        574        0.31        1.76
                         Bexley |        774        0.42        2.18
                     Birmingham |      3,621        1.95        4.13
           Blackburn with Darwe |        464        0.25        4.38
                      Blackpool |        475        0.26        4.63
            Bolton and Tameside |      1,817        0.98        5.61
           Bournemouth, Christc |      1,387        0.75        6.36
               Bracknell Forest |        414        0.22        6.58
                       Bradford |      1,675        0.90        7.48
                          Brent |        897        0.48        7.96
              Brighton and Hove |        901        0.48        8.45
               Bristol, City of |      1,499        0.81        9.25
                        Bromley |      1,107        0.60        9.85
   Bucks/Ox/West. Berks/Swindon |      5,512        2.97       12.82
                           Bury |        713        0.38       13.20
                     Calderdale |        730        0.39       13.59
                 Cambridgeshire |      2,055        1.11       14.70
         Camden and Westminster |      1,460        0.79       15.48
           Central Bedfordshire |        873        0.47       15.95
                  Cheshire East |      1,374        0.74       16.69
           Cheshire West and Ch |      1,309        0.70       17.40
                 City of London |         20        0.01       17.41
                       Cornwall |      2,007        1.08       18.49
                  County Durham |      1,847        0.99       19.48
                       Coventry |      1,121        0.60       20.09
                        Croydon |      1,165        0.63       20.71
                        Cumbria |      1,794        0.97       21.68
                     Darlington |        440        0.24       21.91
                          Derby |        813        0.44       22.35
                     Derbyshire |      2,773        1.49       23.84
                          Devon |      2,954        1.59       25.43
                      Doncaster |      1,038        0.56       25.99
                         Dorset |      1,303        0.70       26.69
                         Dudley |      1,204        0.65       27.34
                         Ealing |      1,099        0.59       27.93
           East Riding of Yorks |      1,197        0.64       28.58
                    East Sussex |      1,915        1.03       29.61
                        Enfield |        997        0.54       30.14
                          Essex |      4,908        2.64       32.78
                      Gateshead |        756        0.41       33.19
                Gloucestershire |      2,059        1.11       34.30
                      Greenwich |        918        0.49       34.79
                        Hackney |        787        0.42       35.22
                         Halton |        415        0.22       35.44
           Hammersmith and Fulh |        687        0.37       35.81
                      Hampshire |      4,494        2.42       38.23
                       Haringey |        988        0.53       38.76
                         Harrow |        825        0.44       39.20
                     Hartlepool |        335        0.18       39.38
                       Havering |        808        0.43       39.82
           Herefordshire, Count |        660        0.36       40.17
                  Hertfordshire |      4,188        2.25       42.43
                     Hillingdon |        868        0.47       42.89
                  Isle of Wight |        488        0.26       43.16
                      Islington |        597        0.32       43.48
           Kensington and Chels |        595        0.32       43.80
                           Kent |      5,061        2.72       46.52
            Kingston upon Hull, |        885        0.48       47.00
           Kingston upon Thames |        562        0.30       47.30
                       Kirklees |      1,606        0.86       48.16
                       Knowsley |        520        0.28       48.44
                        Lambeth |        935        0.50       48.95
                     Lancashire |      4,218        2.27       51.22
                          Leeds |      2,930        1.58       52.79
                      Leicester |      1,020        0.55       53.34
                 Leicestershire |      2,308        1.24       54.58
                       Lewisham |      1,027        0.55       55.14
                      Liverpool |      1,652        0.89       56.02
                          Luton |        619        0.33       56.36
                     Manchester |      1,570        0.84       57.20
                         Medway |        990        0.53       57.74
                         Merton |        670        0.36       58.10
                  Middlesbrough |        533        0.29       58.38
                  Milton Keynes |        900        0.48       58.87
            Newcastle upon Tyne |        847        0.46       59.32
                         Newham |      1,044        0.56       59.88
                        Norfolk |      3,021        1.63       61.51
           North East Lincolnsh |        611        0.33       61.84
             North Lincolnshire |        651        0.35       62.19
                 North Somerset |        692        0.37       62.56
                 North Tyneside |        816        0.44       63.00
                North Yorkshire |      2,076        1.12       64.12
               Northamptonshire |      2,467        1.33       65.45
                 Northumberland |      1,127        0.61       66.05
                     Nottingham |      1,032        0.56       66.61
                Nottinghamshire |      2,691        1.45       68.05
                         Oldham |        874        0.47       68.53
                   Peterborough |        584        0.31       68.84
                       Plymouth |        874        0.47       69.31
                     Portsmouth |        638        0.34       69.65
                        Reading |        452        0.24       69.90
Redbridge, Barking and Dagenham |      1,407        0.76       70.65
           Redcar and Cleveland |        544        0.29       70.95
          Richmond and Hounslow |      1,393        0.75       71.70
                       Rochdale |        680        0.37       72.06
                      Rotherham |        906        0.49       72.55
            Rutland and Lincoln |      2,615        1.41       73.96
                        Salford |        820        0.44       74.40
                       Sandwell |      1,075        0.58       74.98
                         Sefton |      1,063        0.57       75.55
                      Sheffield |      1,952        1.05       76.60
                     Shropshire |      1,035        0.56       77.16
                         Slough |        370        0.20       77.35
                       Solihull |        762        0.41       77.76
                       Somerset |      2,036        1.10       78.86
           South Gloucestershir |        873        0.47       79.33
                 South Tyneside |        593        0.32       79.65
                    Southampton |        866        0.47       80.11
                Southend-on-Sea |        432        0.23       80.35
                      Southwark |        908        0.49       80.84
                     St. Helens |        553        0.30       81.13
                  Staffordshire |      3,039        1.64       82.77
                      Stockport |      1,129        0.61       83.38
               Stockton-on-Tees |        650        0.35       83.73
                 Stoke-on-Trent |        929        0.50       84.23
                        Suffolk |      2,415        1.30       85.52
                     Sunderland |        984        0.53       86.05
                         Surrey |      4,085        2.20       88.25
                         Sutton |        633        0.34       88.59
             Telford and Wrekin |        627        0.34       88.93
                       Thurrock |        568        0.31       89.24
                         Torbay |        477        0.26       89.49
                  Tower Hamlets |        837        0.45       89.94
                       Trafford |        738        0.40       90.34
                      Wakefield |      1,223        0.66       91.00
                        Walsall |      1,068        0.57       91.57
                 Waltham Forest |        772        0.42       91.99
                     Wandsworth |        996        0.54       92.52
                     Warrington |        682        0.37       92.89
                   Warwickshire |      1,807        0.97       93.86
                    West Sussex |      2,767        1.49       95.35
                          Wigan |      1,097        0.59       95.94
                      Wiltshire |      1,585        0.85       96.80
           Windsor and Maidenhe |        485        0.26       97.06
                         Wirral |      1,060        0.57       97.63
                      Wokingham |        538        0.29       97.92
                  Wolverhampton |        911        0.49       98.41
                 Worcestershire |      2,318        1.25       99.65
                           York |        643        0.35      100.00
--------------------------------+-----------------------------------
                          Total |    185,844      100.00

. 
. 
. 
. * NHS England regions
. tab region, m

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |     18,601       10.01       10.01
         East of England |     18,844       10.14       20.15
                  London |     37,161       20.00       40.14
              North East |     18,518        9.96       50.11
              North West |     18,516        9.96       60.07
              South East |     18,694       10.06       70.13
              South West |     18,547        9.98       80.11
           West Midlands |     18,468        9.94       90.05
Yorkshire and The Humber |     18,495        9.95      100.00
-------------------------+-----------------------------------
                   Total |    185,844      100.00

. 
. gen region2=.
(185,844 missing values generated)

. replace region2=0 if region=="East"
(0 real changes made)

. replace region2=1 if region=="East Midlands"
(18,601 real changes made)

. replace region2=2 if region=="London"
(37,161 real changes made)

. replace region2=3 if region=="North East"
(18,518 real changes made)

. replace region2=4 if region=="North West"
(18,516 real changes made)

. replace region2=5 if region=="South East"
(18,694 real changes made)

. replace region2=6 if region=="South West"
(18,547 real changes made)

. replace region2=7 if region=="West Midlands"
(18,468 real changes made)

. replace region2=8 if region=="Yorkshire and The Humber"
(18,495 real changes made)

. 
. drop region

. rename region2 region

. 
. label define regionLab  0 "East" ///
>                                                 1 "East Midlands"  ///
>                                                 2 "London" ///
>                                                 3 "North East" ///
>                                                 4 "North West" ///
>                                                 5 "South East" ///
>                                                 6 "South West" ///
>                                                 7 "West Midlands" ///
>                                                 8 "Yorkshire and the Humber"

.                                                 
. label values region regionLab

. 
. 
. **************************
. *  Categorise variables  *
. **************************
. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(183641 differences between age and agegroup)

. 
. label define agegroupLab        0 "0-<18" ///
>                                                         1 "18-<30" ///
>                                                         2 "30-<40" ///
>                                                         3 "40-<50" ///
>                                                         4 "50-<60" ///
>                                                         5 "60-<70" ///
>                                                         6 "70-<80" ///
>                                                         7 "80+"

.                                                 
. label values agegroup agegroupLab

. 
. * For subgroup analysis
. recode age      0/64.9999=1 ///
>                         65/74.9999=2 ///
>                         75/84.9999=3 ///
>                         85/max=4, gen(agegroupA) 
(183650 differences between age and agegroupA)

. 
. label define agegroupALab       1 "0-<65" ///
>                                                         2 "65-<75" ///
>                                                         3 "75-<85" ///
>                                                         4 "85+"

.                                                         
. label values agegroupA agegroupALab

. 
. 
. * Create binary age
. recode age min/69.999=0 70/max=1, gen(age70)
(183641 differences between age and age70)

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. assert age70<.

. 
. * Create restricted cubic splines for age centred on 65
. gen age65 = age - 65

. mkspline age = age65, cubic nknots(4)

. 
. 
. /*  Body Mass Index  */
. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(185,844 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 4740 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 19244 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 26518 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 33632 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 33815 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 42795 changes made)

. replace bmicat = . if bmi>=.
(0 real changes made)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    

.                                         
. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 . = 1 4=2 5=3 6=4, gen(obese4cat)
(181104 differences between bmicat and obese4cat)

. 
. label define obese4catLab       1 "No record of obesity"        ///
>                                                         2 "Obese I (30-34.9)"
>            ///
>                                                         3 "Obese II (35-39.9)
> "          ///
>                                                         4 "Obese III (40+)"  
>            

. label values obese4cat obese4catLab

. order obese4cat, after(bmicat)

. 
. tab obese4cat, m

    RECODE of bmicat |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     75,602       40.68       40.68
   Obese I (30-34.9) |     33,632       18.10       58.78
  Obese II (35-39.9) |     33,815       18.20       76.97
     Obese III (40+) |     42,795       23.03      100.00
---------------------+-----------------------------------
               Total |    185,844      100.00

. 
. 
. /*  Smoking  */
. 
. * Create non-missing 3-category variable for current smoking
. recode smoke .=1, gen(smoke_nomiss)
(152412 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke_nomissLab

. 
. recode smoke_nomiss 3=2, gen(smoke_nomiss2)
(22413 differences between smoke_nomiss and smoke_nomiss2)

. order smoke_nomiss2, after(smoke_nomiss)

. 
. label values smoke_nomiss2 smoke_nomissLab

. 
. tab smoke_nomiss2, m

  RECODE of |
smoke_nomis |
  s (RECODE |
  of smoke) |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |    159,802       85.99       85.99
     Former |     26,042       14.01      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. /*  Asthma  */
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3 .=1
(asthmacat: 185844 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(176,541 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(236 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(176,305 real changes made)

. replace bpcat = . if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(18,093 real changes made, 18,093 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 

. label values bpcat bpcat

. 
. recode bpcat .=1, gen(bpcat_nomiss)
(18093 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. order bpcat bphigh, after(bp_dias_date)

. 
. 
. /*  IMD  */
. 
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(185,844 real changes made)

. replace imd = . if imd_o==-1
(0 real changes made)

. drop imd_o

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,699       10.06       10.06
          2 |     37,215       20.02       30.09
          3 |     37,270       20.05       50.14
          4 |     36,902       19.86       70.00
          5 |     55,758       30.00      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. * Reverse the order (so high is more deprived)
. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 148574 changes made)

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     55,758       30.00       30.00
          2 |     36,902       19.86       49.86
          3 |     37,270       20.05       69.91
          4 |     37,215       20.02       89.94
          5 |     18,699       10.06      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. label define imdLab 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived
> " 

. label values imd imdLab 

. 
. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. 
. /*  HOUSEHOLD SIZE  */
. 
. gen hh_total_cat=.
(185,844 missing values generated)

. replace hh_total_cat=1 if household_size >=1 & household_size<=2
(88,857 real changes made)

. replace hh_total_cat=2 if household_size >=3 & household_size<=5
(92,474 real changes made)

. replace hh_total_cat=3 if household_size >=6 & household_size<=10
(251 real changes made)

. replace hh_total_cat=4 if household_size >=11 & household_size !=.
(0 real changes made)

. 
. label define hh_total_catLab    1 "1-2" ///
>                                                                 2 "3-5" ///
>                                                                 3 "6-10" ///
>                                                                 4 "11+"

.                                                                              
>            
. label values hh_total_cat hh_total_catLab

. 
. tab hh_total_cat, m

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        1-2 |     88,857       47.81       47.81
        3-5 |     92,474       49.76       97.57
       6-10 |        251        0.14       97.71
          . |      4,262        2.29      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. 
. /*  RURAL OR URBAN  */
. 
. * Create a 4 category rural urban variable based upon meeting with Roz 21st O
> ctober
. gen rural_urban5=.
(185,844 missing values generated)

. replace rural_urban5=1 if rural_urban==1
(18,574 real changes made)

. replace rural_urban5=2 if rural_urban==2
(18,526 real changes made)

. replace rural_urban5=3 if rural_urban==3|rural_urban==4
(37,217 real changes made)

. replace rural_urban5=4 if rural_urban==5|rural_urban==6
(37,154 real changes made)

. replace rural_urban5=5 if rural_urban==7|rural_urban==8
(74,373 real changes made)

. 
. label define rural_urban5Lab    1 "Urban major conurbation" ///
>                                                                 2 "Urban mino
> r conurbation" ///
>                                                                 3 "Urban city
>  and town" ///
>                                                                 4 "Rural town
>  and fringe" ///
>                                                                 5 "Rural vill
> age and dispersed"

.                                                                 
. label values rural_urban5 rural_urban5Lab

. tab rural_urban5, m

               rural_urban5 |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |     18,574        9.99        9.99
    Urban minor conurbation |     18,526        9.97       19.96
        Urban city and town |     37,217       20.03       39.99
      Rural town and fringe |     37,154       19.99       59.98
Rural village and dispersed |     74,373       40.02      100.00
----------------------------+-----------------------------------
                      Total |    185,844      100.00

. 
. 
. /*  CARE HOME TYPE  */
. 
. tab care_home_type, m

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |      9,361        5.04        5.04
         PN |      9,341        5.03       10.06
         PS |      9,433        5.08       15.14
          U |    157,709       84.86      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. gen home_bin=0

. replace home_bin=1 if care_home_type=="PC" | care_home_type=="PN" | care_home
> _type=="PS"
(28,135 real changes made)

. 
. tab care_home_type home_bin, m

care_home_ |       home_bin
      type |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      9,361 |     9,361 
        PN |         0      9,341 |     9,341 
        PS |         0      9,433 |     9,433 
         U |   157,709          0 |   157,709 
-----------+----------------------+----------
     Total |   157,709     28,135 |   185,844 

. 
. label define home_binLab        0 "Private home" ///
>                                                         1 "Care home"

. 
. label values home_bin home_binLab

. 
. 
. /*  Centred age, sex, IMD, ethnicity (for adjusted KM plots)  */ 
. 
. * Centre age (linear)
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    185,844    40.19747    23.72469          0        105

. gen c_age = age-r(mean)

. 
. * "Centre" sex to be coded -1 +1 
. recode male 0=-1, gen(c_male)
(94763 differences between male and c_male)

. 
. * "Centre" IMD
. gen c_imd = imd - 3

. 
. * "Centre" ethnicity
. gen c_ethnicity = ethnicity - 3
(46,613 missing values generated)

. 
. 
. **************************************************
. *  Create binary comorbidity indices from dates  *
. **************************************************
. 
. * Comorbidities ever before study_start
. foreach var of varlist  chronic_respiratory_disease_date        ///
>                                                 chronic_cardiac_disease_date 
>            ///
>                                                 diabetes_date                
>                            ///
>                                                 chronic_liver_disease_date   
>                    ///
>                                                 stroke_date                  
>                                    ///
>                                                 dementia_date                
>                            ///
>                                                 other_neuro_date             
>                            ///
>                                                 organ_transplant_date        
>                    ///
>                                                 aplastic_anaemia_date        
>                    ///
>                                                 hypertension_date            
>                            ///
>                                                 dysplenia_date               
>                            ///
>                                                 sickle_cell_date             
>                            ///
>                                                 hiv_date                     
>                                    ///
>                                                 permanent_immunodeficiency_da
> te         ///
>                                                 temporary_immunodeficiency_da
> te         ///
>                                                 ra_sle_psoriasis_date dialysi
> s_date {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'< study_start)
  4.         order `newvar', after(`var')
  5. }

. 
. 
. **************************
. *  Epidemiological week  *
. **************************
. 
. gen start_week = 53 if study_start <= date("04jan2021", "DMY")

. replace start_week = 52 if study_start <= date("27dec2020", "DMY")
(159,968 real changes made)

. replace start_week = 51 if study_start <= date("20dec2020", "DMY")
(135,951 real changes made)

. replace start_week = 50 if study_start <= date("13dec2020", "DMY")
(110,455 real changes made)

. replace start_week = 49 if study_start <= date("06dec2020", "DMY")
(83,407 real changes made)

. replace start_week = 48 if study_start <= date("29nov2020", "DMY")
(55,399 real changes made)

. replace start_week = 47 if study_start <= date("22nov2020", "DMY")
(26,145 real changes made)

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
         47 |     26,145       14.07       14.07
         48 |     29,254       15.74       29.81
         49 |     28,008       15.07       44.88
         50 |     27,048       14.55       59.43
         51 |     25,496       13.72       73.15
         52 |     24,017       12.92       86.08
         53 |     25,876       13.92      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. replace start_week = start_week-46
(185,844 real changes made)

. 
. label define start_weekLab      1 "16Nov-22Nov" ///
>                                                         2 "23Nov-29Nov" ///
>                                                         3 "30Nov-06Dec" ///
>                                                         4 "07Dec-13Dec" ///
>                                                         5 "14Dec-20Dec" ///
>                                                         6 "21Dec-27Dec" ///
>                                                         7 "28Dec-04Jan" ///
>                                                         

. label values start_week start_weekLab

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
16Nov-22Nov |     26,145       14.07       14.07
23Nov-29Nov |     29,254       15.74       29.81
30Nov-06Dec |     28,008       15.07       44.88
07Dec-13Dec |     27,048       14.55       59.43
14Dec-20Dec |     25,496       13.72       73.15
21Dec-27Dec |     24,017       12.92       86.08
28Dec-04Jan |     25,876       13.92      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. 
. ***************************
. *  Grouped comorbidities  *
. ***************************
. 
. /*  Neurological  */
. 
. * Stroke and dementia
. egen stroke_dementia = rowmax(stroke dementia)

. order stroke_dementia, after(dementia_date)

. 
. 
. /*  Spleen  */
. 
. * Spleen problems (dysplenia/splenectomy/etc and sickle cell disease)   
. egen spleen = rowmax(dysplenia sickle_cell) 

. order spleen, after(sickle_cell)

. 
. 
. /*  Cancer  */
. 
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. local fiveybefore = study_start-5*365.25

. local oneybefore = study_start-365.25

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(haem_cancer_date, d(1/1/1900), `fiveyb
> efore')
(152,264 missing values generated)

. replace cancer_haem_cat = 3 if inrange(haem_cancer_date, `fiveybefore', `oney
> before')
(2,912 real changes made)

. replace cancer_haem_cat = 2 if inrange(haem_cancer_date, `oneybefore', study_
> start)
(718 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 148634 changes made)

. label values cancer_haem_cat cancer

. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(lung_cancer_date,  d(1/1/1900), `fiv
> eybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, d(1/1/1900), `fiveybefore') 
(124,990 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(lung_cancer_date,  `fiveybefore', `o
> neybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, `fiveybefore', `oneybefore') 
(5,725 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(lung_cancer_date,  `oneybefore', stu
> dy_start) | ///
>                                                                  inrange(othe
> r_cancer_date, `oneybefore', study_start)
(1,422 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 119168 changes made)

. label values cancer_exhaem_cat cancer

. 
. * Put variables together
. order cancer_exhaem_cat cancer_haem_cat, after(other_cancer_date)

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * HIV, permanent immunodeficiency ever, OR 
. * temporary immunodeficiency or aplastic anaemia last year
. gen temp1  = max(hiv, permanent_immunodeficiency)

. gen temp2  = inrange(temporary_immunodeficiency_date, `oneybefore', study_sta
> rt)

. gen temp3  = inrange(aplastic_anaemia_date, `oneybefore', study_start)

. 
. egen other_immunosuppression = rowmax(temp1 temp2 temp3)

. drop temp1 temp2 temp3

. order other_immunosuppression, after(temporary_immunodeficiency)

. 
. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 3576 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(9,850 real changes made, 9,850 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(9,850 missing values generated)

. 
. gen min=.
(185,844 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(89,761 real changes made)

. replace min = SCr_adj/0.9 if male==1
(86,233 real changes made)

. replace min = min^-0.329  if male==0
(89,761 real changes made)

. replace min = min^-0.411  if male==1
(86,233 real changes made)

. replace min = 1 if min<1
(48,902 real changes made)

. 
. gen max=.
(185,844 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(89,761 real changes made)

. replace max=SCr_adj/0.9 if male==1
(86,233 real changes made)

. replace max=max^-1.209
(175,994 real changes made)

. replace max=1 if max>1
(136,942 real changes made)

. 
. * egfr calculated using CKD-EPI formula with no eth
. gen egfr=min*max*141
(9,850 missing values generated)

. replace egfr=egfr*(0.993^age)
(173,925 real changes made)

. replace egfr=egfr*1.018 if male==0
(89,761 real changes made)

. 
. * Categorise into ckd stages
. * CKD stage calc without eth
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(9850 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(175994 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
. 
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(174398 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(9,850 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. 
. *More detailed version incorporating stage 5 or dialysis as a separate catego
> ry 
. recode ckd 0=1 2/3=2 4=3 5=4, gen(reduced_kidney_function_cat2)
(174398 differences between ckd and reduced_kidney_function_cat2)

. replace reduced_kidney_function_cat2 = 1 if creatinine==. 
(9,850 real changes made)

. replace reduced_kidney_function_cat2 = 4 if dialysis==1 
(36,903 real changes made)

. 
. label define reduced_kidney_function_cat2lab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4 egfr 15-<30" 4 "
> Stage 5 egfr <15 or dialysis"

. label values reduced_kidney_function_cat2 reduced_kidney_function_cat2lab 

.  
.         
. ***********
. *  Hba1c  *
. ***********
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage<=0
(10,518 real changes made, 10,518 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol<=0
(13,375 real changes made, 13,375 to missing)

. 
. local fifteenmbefore = study_start-15*(365.25/12)

. 
. * Only consider measurements in last 15 months
. replace hba1c_percentage   = . if hba1c_percentage_date   < `fifteenmbefore'
(173,925 real changes made, 173,925 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol_date < `fifteenmbefore'
(170,958 real changes made, 170,958 to missing)

. 
. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      1,401     4.99437    1.966484   .0489529   12.60682
hba1c_mmol~l |      1,511    41.36571    18.80816   .4841393   102.0625

. gen     hba1c_pct = hba1c_percentage 
(184,443 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(1,511 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(2,901 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(183,842 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(469 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(159 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(178 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(93 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      2,002       69.01       69.01
  >=6.5-7.4 |        469       16.17       85.18
  >=7.5-7.9 |        159        5.48       90.66
    >=8-8.9 |        178        6.14       96.79
        >=9 |         93        3.21      100.00
------------+-----------------------------------
      Total |      2,901      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if diabetes==0
(37,015 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(512 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(83 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(36,420 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. * Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. 
. ******************************
. *  Aggregated comorbidities  *
. ******************************
. 
. /*
>         Create a comorbidities variable based upon Fizz's JCVI work that has 
> 0, 1, 2 or more of 
>         the following comorbdities: 
>         (1) respiratory disease, (2) severe asthma, (3) chronic cardiac disea
> se, (4) diabetes, 
>         (5) non-haematological cancer (diagnosed in last year), (6) haematolo
> gical cancer (diagnosed within 5 years), 
>         (7) liver disease, (8) stroke, (9) dementia, (10) poor kidney functio
> n, (11) organ transplant, 
>         (12) asplenia, (13) other immunosuppression.
> */
. 
. 
. *(1) respiratory disease
. tab chronic_respiratory_disease

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    148,773       80.05       80.05
          1 |     37,071       19.95      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *think I need level "3" of this, as this is asthma that requires OCS
. *(2) severe asthma
. tab asthmacat

   asthmacat |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |    178,396       95.99       95.99
 Yes, no OCS |      3,773        2.03       98.02
Yes with OCS |      3,675        1.98      100.00
-------------+-----------------------------------
       Total |    185,844      100.00

. generate asthma_severe=0

. replace asthma_severe=1 if asthmacat==3
(3,675 real changes made)

. tab asthma_severe

asthma_seve |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    182,169       98.02       98.02
          1 |      3,675        1.98      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(3) cardiac disease
. tab chronic_cardiac_disease

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    148,734       80.03       80.03
          1 |     37,110       19.97      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(4) diabetes
. tab diabcat

                   diabcat |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
               No diabetes |    148,829       80.08       80.08
       Controlled diabetes |        512        0.28       80.36
     Uncontrolled diabetes |         83        0.04       80.40
Diabetes, no hba1c measure |     36,420       19.60      100.00
---------------------------+-----------------------------------
                     Total |    185,844      100.00

. tab diabcat, nolabel

    diabcat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    148,829       80.08       80.08
          2 |        512        0.28       80.36
          3 |         83        0.04       80.40
          4 |     36,420       19.60      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. generate dm=0

. replace dm=1 if diabcat>1
(37,015 real changes made)

. tab dm

         dm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    148,829       80.08       80.08
          1 |     37,015       19.92      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. tab dm diabcat

           |                   diabcat
        dm | No diabet  Controlle  Uncontrol  Diabetes, |     Total
-----------+--------------------------------------------+----------
         0 |   148,829          0          0          0 |   148,829 
         1 |         0        512         83     36,420 |    37,015 
-----------+--------------------------------------------+----------
     Total |   148,829        512         83     36,420 |   185,844 

. 
. *(5) non-haem cancer (in previous year)
. tab cancer_exhaem

cancer_exhaem |
         _cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |    119,168       64.12       64.12
    Last year |      1,422        0.77       64.89
2-5 years ago |      5,700        3.07       67.95
     5+ years |     59,554       32.05      100.00
--------------+-----------------------------------
        Total |    185,844      100.00

. tab cancer_exhaem, nolab

cancer_exha |
     em_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    119,168       64.12       64.12
          2 |      1,422        0.77       64.89
          3 |      5,700        3.07       67.95
          4 |     59,554       32.05      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. generate cancer_nonhaemPrevYear=0

. replace cancer_nonhaemPrevYear=1 if cancer_exhaem_cat==2
(1,422 real changes made)

. tab cancer_nonhaemPrevYear

cancer_nonh |
aemPrevYear |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    184,422       99.23       99.23
          1 |      1,422        0.77      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(6) haem cancer (within previous 5 years)
. tab cancer_haem

cancer_haem_c |
           at |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |    148,634       79.98       79.98
    Last year |        718        0.39       80.36
2-5 years ago |      2,912        1.57       81.93
     5+ years |     33,580       18.07      100.00
--------------+-----------------------------------
        Total |    185,844      100.00

. tab cancer_haem, nolab

cancer_haem |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    148,634       79.98       79.98
          2 |        718        0.39       80.36
          3 |      2,912        1.57       81.93
          4 |     33,580       18.07      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. generate cancer_haemPrev5Years=0

. replace cancer_haemPrev5Years=1 if inrange(cancer_haem_cat,2,3)
(3,630 real changes made)

. tab cancer_haemPrev5Years

cancer_haem |
 Prev5Years |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    182,214       98.05       98.05
          1 |      3,630        1.95      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(7) liver disease
. tab chronic_liver_disease

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    148,703       80.01       80.01
          1 |     37,141       19.99      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(8 and 9) stroke or dementia
. tab stroke_dementia

stroke_deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    119,174       64.13       64.13
          1 |     66,670       35.87      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(10) poor kidney function
. tab reduced_kidney_function_cat2

    RECODE of ckd (RECODE of |
                   egfr_cat) |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |    147,659       79.45       79.45
Stage 3a/3b egfr 30-60       |      1,282        0.69       80.14
Stage 5 egfr <15 or dialysis |     36,903       19.86      100.00
-----------------------------+-----------------------------------
                       Total |    185,844      100.00

. tab reduced_kidney_function_cat2, nolabel

  RECODE of |
ckd (RECODE |
         of |
  egfr_cat) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    147,659       79.45       79.45
          2 |      1,282        0.69       80.14
          4 |     36,903       19.86      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. gen egfr60 = 0

. replace egfr60 = 1 if reduced_kidney_function_cat2 > 1
(38,185 real changes made)

. tab egfr60 reduced_kidney_function_cat2

           |     RECODE of ckd (RECODE of
           |            egfr_cat)
    egfr60 |      None  Stage 3a/  Stage 5 e |     Total
-----------+---------------------------------+----------
         0 |   147,659          0          0 |   147,659 
         1 |         0      1,282     36,903 |    38,185 
-----------+---------------------------------+----------
     Total |   147,659      1,282     36,903 |   185,844 

. 
. *(11) organ transplant
. tab organ_transplant

organ_trans |
      plant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    148,909       80.13       80.13
          1 |     36,935       19.87      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(12) asplenia
. tab spleen

     spleen |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,852       63.95       63.95
          1 |     66,992       36.05      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *(13) other immunosuppression
. tab other_immuno

other_immun |
osuppressio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,215       63.61       63.61
          1 |     67,629       36.39      100.00
------------+-----------------------------------
      Total |    185,844      100.00

. 
. *create a total comborb var
. order chronic_respiratory_disease asthma_severe chronic_cardiac_disease dm ca
> ncer_nonhaemPrevYear cancer_haemPrev5Years chronic_liver_disease stroke_demen
> tia egfr60 organ_transplant spleen other_immuno

. egen totComorbsOfInterest=rowtotal(chronic_respiratory_disease - other_immuno
> )

. summ totComorbsOfInterest, d

                    totComorbsOfInterest
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs             185,844
25%            1              0       Sum of Wgt.     185,844

50%            2                      Mean           2.332467
                        Largest       Std. Dev.      1.302783
75%            3              8
90%            4              8       Variance       1.697244
95%            5              9       Skewness       .3651779
99%            6              9       Kurtosis       2.930096

. order totComorbsOfInterest

. 
. *create the covariate var I need
. generate comorb_cat=.
(185,844 missing values generated)

. replace comorb_cat=0 if totComorbsOfInterest==0
(11,997 real changes made)

. replace comorb_cat=1 if totComorbsOfInterest==1
(39,481 real changes made)

. replace comorb_cat=2 if totComorbsOfInterest>1
(134,366 real changes made)

. 
. label define comorb_catLab      0 "No comorbidity"      ///
>                                                         1 "1 comorbidity"    
>            ///
>                                                         2 "2+ comorbidities" 
>                    

. label values comorb_cat comorb_catLab

. tab comorb_cat, m

      comorb_cat |      Freq.     Percent        Cum.
-----------------+-----------------------------------
  No comorbidity |     11,997        6.46        6.46
   1 comorbidity |     39,481       21.24       27.70
2+ comorbidities |    134,366       72.30      100.00
-----------------+-----------------------------------
           Total |    185,844      100.00

. 
. 
. 
. ********************************
. *  Outcomes and survival time  *
. ********************************
. 
. /*  28-day risk censoring dates  */
. noi di "REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD"
REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD

. gen ons_data_date = date("12feb2021", "DMY")

. gen ons_data_cens = ons_data_date-14                    // Censor 14 days pri
> or to ONS death data upload

. gen risk_28_days = study_start+28

. gen risk_40_days = study_start+40

. 
. * 28-day risk population
. gen risk_pop = (risk_28_days <= ons_data_cens)  // Indicator for has 28-days 
> follow-up

. gen time_check_28 = ons_data_cens-study_start

. summ time_check_28 if risk_pop == 1, d

                        time_check_28
-------------------------------------------------------------
      Percentiles      Smallest
 1%           28             28
 5%           30             28
10%           33             28       Obs             176,466
25%           41             28       Sum of Wgt.     176,466

50%           52                      Mean           51.70044
                        Largest       Std. Dev.      13.20709
75%           63             73
90%           69             73       Variance       174.4272
95%           71             73       Skewness      -.1092679
99%           73             73       Kurtosis       1.823738

. 
. * 40-day risk population
. gen risk_pop_40 = (risk_40_days <= ons_data_cens)       // Indicator for has 
> 40-days follow-up

. gen time_check_40 = ons_data_cens-study_start

. summ time_check_40 if risk_pop_40 == 1, d

                        time_check_40
-------------------------------------------------------------
      Percentiles      Smallest
 1%           40             40
 5%           41             40
10%           43             40       Obs             135,951
25%           49             40       Sum of Wgt.     135,951

50%           57                      Mean           57.10465
                        Largest       Std. Dev.      9.781441
75%           66             73
90%           70             73       Variance       95.67659
95%           72             73       Skewness      -.0709911
99%           73             73       Kurtosis       1.808783

. 
. /*   Outcomes   */
. 
. * 28-day risk indicator
. gen died_pre_cens = (died_date_ons < ons_data_cens)

. gen death_time = died_date_ons-study_start if died_pre_cens == 1
(180,848 missing values generated)

. summ death_time, d

                         death_time
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%            5              1       Obs               4,996
25%           13              1       Sum of Wgt.       4,996

50%           26                      Mean           27.23559
                        Largest       Std. Dev.      17.03464
75%           40             71
90%           52             71       Variance       290.1789
95%           58             72       Skewness       .3711158
99%           66             72       Kurtosis       2.243476

. 
. gen risk_28 = (death_time <= 28)

. tab died_pre_cens risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_28
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |   180,848          0 |   180,848 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |     2,218      2,778 |     4,996 
           |     44.40      55.60 |    100.00 
-----------+----------------------+----------
     Total |   183,066      2,778 |   185,844 
           |     98.51       1.49 |    100.00 

. 
. * 40-day risk indicator
. gen risk_40 = (death_time <= 40)

. tab died_pre_cens risk_40, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_40
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |   180,848          0 |   180,848 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |     1,179      3,817 |     4,996 
           |     23.60      76.40 |    100.00 
-----------+----------------------+----------
     Total |   182,027      3,817 |   185,844 
           |     97.95       2.05 |    100.00 

. 
. /* Survival time */
. 
. * Censoring date for Cox
. gen vacc_cens = covid_vacc_date - 7 if covid_vacc_date != .
(152,741 missing values generated)

. gen cox_pop = (study_start < vacc_cens)                 // Exclude if vaccina
> ted within 7 days

. 
. * Censor at death, ons data censor, or 7 days prior to vaccine
. gen stime_death = min(died_date_ons, ons_data_cens, vacc_cens)

. 
. gen cox_death = (died_date_ons < .)

. replace cox_death = 0 if (died_date_ons > stime_death)
(2,069 real changes made)

. 
. gen cox_time = stime_death-study_start

. 
. * Format date variables
. format ons_data_date ons_data_cens risk_28_days risk_40_days stime_death %td 

. 
.                 
. *********************
. *  Label variables  *
. *********************
. 
. * Remove old labels
. foreach var of varlist _all {
  2.         label var `var' ""
  3. }

. 
. * Demographics
. label var patient_id                                    "Patient ID"

. label var start_week                                    "Epidemiological week
>  of study"

. label var age                                                   "Age (years)"

. label var agegroup                                              "Grouped age"

. label var agegroupA                                             "Age subgroup
> s"

. label var age70                                                 "70 years and
>  older"

. label var age1                                                  "Age65 spline
>  1"

. label var age2                                                  "Age65 spline
>  2"

. label var age3                                                  "Age65 spline
>  3"

. label var male                                                  "Male"

. label var bmi                                                   "Body Mass In
> dex (BMI, kg/m2)"

. label var bmicat                                                "Grouped BMI"

. label var bmi_date                                      "Body Mass Index (BMI
> , kg/m2), date measured"

. label var obese4cat                                             "Evidence of 
> obesity (missing set to none)"

. label var smoke                                                 "Smoking stat
> us"

. label var smoke_nomiss                                  "Smoking status (miss
> ing set to never)"

. label var smoke_nomiss2                                 "Binary smoking statu
> s (missing set to never)"

. label var imd                                                   "Index of Mul
> tiple Deprivation (IMD)"

. label var eth5                                                  "Ethnicity in
>  5 categories"

. label var eth2                                                  "Ethnicity in
>  2 catergories"

. label var ethnicity_16                                  "Ethnicity in 16 cate
> gories"

. label var ethnicity_16_combinemixed             "Ethnicity detailed with mixe
> d groups combined"

. label var stp                                                   "Sustainabili
> ty and Transformation Partnership"

. label var region                                                "NHS England 
> region"

. label var utla_group                                    "UTLA"

. label var rural_urban                                   "Rural urban classifi
> cation"

. label var rural_urban5                                  "Rural Urban in five 
> categories"

. 
. label var household_size                                "Household size"

. label var hh_total_cat                                  "Categorical househol
> d size"

. label var care_home_type                                "Care home status"

. label var home_bin                                              "Binary care 
> home status"

. 
. /*
> label var hba1ccat                                              "Categorised 
> hba1c"
> label var egfr_cat                                              "Calculated e
> GFR"
> label var bp_sys                                                "Systolic blo
> od pressure"
> label var bp_sys_date                                   "Systolic blood press
> ure, date"
> label var bp_dias                                               "Diastolic bl
> ood pressure"
> label var bp_dias_date                                  "Diastolic blood pres
> sure, date"
> label var bpcat                                                 "Grouped bloo
> d pressure"
> label var bphigh                                                "Binary high 
> (stage 1/2) blood pressure"
> label var htdiag_or_highbp                              "Diagnosed hypertensi
> on or high blood pressure"
> */
. 
. /*
> label var c_age                                                 "Centred age"
> label var c_male                                                "Centred sex 
> (code: -1/+1)"
> label var c_imd                                                 "Centred Inde
> x of Multiple Deprivation (values: -2/+2)"
> label var c_ethnicity                                   "Centred ethnicity (v
> alues: -2/+2)"
> */
. 
. * Comorbidities
. /*
> label var chronic_respiratory_disease   "Respiratory disease (excl. asthma)"
> label var asthmacat                                             "Asthma, grou
> ped by severity (OCS use)"
> label var asthma                                                "Asthma"
> label var chronic_cardiac_disease               "Heart disease"
> label var diabetes                                              "Diabetes"
> label var diabcat                                               "Diabetes, gr
> ouped"
> label var cancer_exhaem_cat                             "Cancer (exc. haemato
> logical), grouped by time since diagnosis"
> label var cancer_haem_cat                               "Haematological malig
> nancy, grouped by time since diagnosis"
> label var chronic_liver_disease                 "Chronic liver disease"
> label var stroke_dementia                               "Stroke or dementia"
> label var other_neuro                                   "Neuro condition othe
> r than stroke/dementia"    
> label var reduced_kidney_function_cat   "Reduced kidney function" 
> label var organ_transplant                              "Organ transplant rec
> ipient"
> label var dysplenia                                             "Dysplenia (s
> plenectomy, other, not sickle cell)"
> label var sickle_cell                                   "Sickle cell"
> label var spleen                                                "Spleen probl
> ems (dysplenia, sickle cell)"
> label var ra_sle_psoriasis                              "RA, SLE, Psoriasis (
> autoimmune disease)"
> label var aplastic_anaemia                              "Aplastic anaemia"
> label var hiv                                                   "HIV"
> label var permanent_immunodeficiency    "Permanent immunodeficiency"
> label var temporary_immunodeficiency    "Temporary immunosuppression"
> label var other_immunosuppression               "Immunosuppressed (combinatio
> n algorithm)"
> label var chronic_respiratory_disease_date      "Respiratory disease (excl. a
> sthma), date"
> label var chronic_cardiac_disease_date  "Heart disease, date"
> label var diabetes_date                                 "Diabetes, date"
> label var lung_cancer_date                              "Lung cancer, date"
> label var haem_cancer_date                              "Haem. cancer, date"
> label var other_cancer_date                             "Any cancer, date"
> label var chronic_liver_disease_date    "Liver, date"
> label var stroke_date                                   "Stroke, date"
> label var dementia_date                                 "Dementia, date"
> label var other_neuro_date                              "Neuro condition othe
> r than stroke/dementia, date"      
> label var organ_transplant_date                 "Organ transplant recipient, 
> date"
> label var dysplenia_date                                "Splenectomy etc, dat
> e"
> label var sickle_cell_date                              "Sickle cell, date"
> label var ra_sle_psoriasis_date                 "RA, SLE, Psoriasis (autoimmu
> ne disease), date"
> label var aplastic_anaemia_date                 "Aplastic anaemia, date"
> label var hiv_date                                              "HIV, date"
> label var permanent_immunodeficiency_date "Permanent immunodeficiency, date"
> label var temporary_immunodeficiency_date "Temporary immunosuppression, date"
> label var dialysis                                              "Dialysis"
> */
. label var comorb_cat                                    "Categorical number o
> f comorbidites"

. 
.         
. * Outcomes and follow-up
. label var study_start                                   "Date of study entry"

. label var study_end                                             "Date of last
>  entry"

. label var risk_pop                                              "1=Population
>  for 28-day risk analysis"

. label var risk_pop_40                                   "1=Population for 40-
> day risk analysis"

. label var risk_28                                               "28-day outco
> me"

. label var risk_40                                               "40-day outco
> me"

. label var cox_pop                                               "1=Population
>  for Cox analysis"

. label var stime_death                                   "Date of study exit"

. label var cox_death                                             "Outcome for 
> Cox"

. label var cox_time                                              "Survival tim
> e"

. label var sgtf                                                  "SGTF (exposu
> re)"

. label var has_sgtf                                              "1=Has SGTF d
> ata"

. 
. 
. ***************
. *  Tidy data  *
. ***************
. 
. * REDUCE DATASET SIZE TO VARIABLES NEEDED - KEEP THOSE WITH LABELS
. ds , has(varl)
bmi_date_m~d  study_start   ethnicity_~d  age3          risk_pop
sgtf          study_end     stp           bmicat        risk_pop_40
age           has_sgtf      utla_group    obese4cat     risk_28
rural_urban   male          region        imd           risk_40
household_~e  smoke         agegroup      hh_total_cat  cox_pop
care_home_~e  smoke_nomiss  agegroupA     rural_urban5  stime_death
bmi           smoke_nomi~2  age70         home_bin      cox_death
ethnicity_16  eth5          age1          start_week    cox_time
patient_id    eth2          age2          comorb_cat

. keep `r(varlist)'

. 
. 
. ***************
. *  Save data  *
. ***************
. 
. sort patient_id

. order patient_id risk_pop risk_pop_40 risk_28 risk_40 cox_pop cox_death stime
> _death cox_time sgtf

. 
. label data "SGTF CFR ANALYSIS DATASET: $S_DATE"

. 
. save ./output/cr_analysis_dataset.dta, replace
(note: file ./output/cr_analysis_dataset.dta not found)
file ./output/cr_analysis_dataset.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 closed on:  14 Feb 2021, 20:48:18
-------------------------------------------------------------------------------
