-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 opened on:  12 Feb 2021, 15:15:58

. 
. clear

. 
. /*
> import delimited "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output
> \input.csv"
> merge m:1 msoa using "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\lo
> okups\MSOA_lookup"
> drop if _merge==2
> drop _merge
> */
. 
. import delimited ./output/input.csv
(58 vars, 400,000 obs)

. merge m:1 msoa using ./lookups/MSOA_lookup

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           400,000  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(0 observations deleted)

. drop _merge

. 
. 
. rename hiv hiv_code

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. gen study_start = date(sgss_pos_inrange, "YMD")
(79,999 missing values generated)

. summ study_start

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 study_start |    320,001    22260.04    14.14366      22236      22284

. noi disp "MINIMUM START DATE: " %td r(min)
MINIMUM START DATE: 17nov2020

. 
. gen study_end = date("04jan2021", "DMY")

. format %td study_start study_end

. 
. * DROP IF NO POSITIVE PCR TEST IN SGSS DURING STUDY PERIOD
. noi di "NO POSITIVE TEST IN STUDY PERIOD"
NO POSITIVE TEST IN STUDY PERIOD

. drop if sgss_pos_inrange == ""
(79,999 observations deleted)

. 
. * DROP IF DIED ON/BEFORE STUDY START DATE
. noi di "DIED ON/BEFORE STUDY START DATE:" 
DIED ON/BEFORE STUDY START DATE:

. drop if date(died_date_ons, "YMD") <= study_start
(21,879 observations deleted)

. 
. * DROP IF COVID POSITIVE ON/BEFORE STUDY START DATE
. noi di "COVID POSITIVE BEFORE STUDY START DATE:" 
COVID POSITIVE BEFORE STUDY START DATE:

. drop if date(covid_tpp_probable, "YMD") <= study_start
(27,009 observations deleted)

. drop if date(first_pos_test_sgss, "YMD") <= study_start
(81,640 observations deleted)

. 
. * DROP IF VACCINATED ON/BEFORE STUDY START DATE
. noi di "VACCINATED ON/BEFORE STUDY START DATE:" 
VACCINATED ON/BEFORE STUDY START DATE:

. drop if date(covid_vacc_date, "YMD") <= study_start
(4,892 observations deleted)

. 
. * Age: Exclude children
. *noi di "DROPPING AGE<18:" 
. *drop if age<18
. 
. * Age: Exclude those with implausible ages
. assert age<.

. noi di "DROPPING AGE>105:" 
DROPPING AGE>105:

. drop if age>105
(21 observations deleted)

. 
. * Sex: Exclude categories other than M and F
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. 
. **************************
. *  CREATE SGTF VARIABLE  *
. **************************
. 
. replace sgtf=99 if sgtf==.
(18,788 real changes made)

. 
. gen has_sgtf = 1 if inrange(sgtf,0,1)
(37,014 missing values generated)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(0 observations deleted)

. 
. label define sgtfLab 0 "non-VOC" 1 "VOC" 9 "Unclassified" 99 "Blank"

. label values sgtf sgtfLab

. 
. 
. ******************************
. *  Convert strings to dates  *
. ******************************
. 
. * Covariates
. foreach var of varlist  bp_sys_date                                     ///
>                                                 bp_dias_date                 
>                    ///
>                                                 hba1c_percentage_date        
>            ///
>                                                 hba1c_mmol_per_mol_date      
>            ///
>                                                 hypertension                 
>                    ///
>                                                 bmi_date_measured            
>                    ///
>                                                 chronic_respiratory_disease  
>    ///
>                                                 chronic_cardiac_disease      
>            ///
>                                                 diabetes                     
>                            ///
>                                                 lung_cancer                  
>                    ///
>                                                 haem_cancer                  
>                            ///
>                                                 other_cancer                 
>                    ///
>                                                 chronic_liver_disease        
>            ///
>                                                 stroke                       
>                            ///
>                                                 dementia                     
>                            ///
>                                                 other_neuro                  
>                    ///
>                                                 organ_transplant             
>                    ///     
>                                                 dysplenia                    
>                            ///
>                                                 sickle_cell                  
>                    ///
>                                                 aplastic_anaemia             
>                    ///
>                                                 hiv_date                     
>                            ///
>                                                 permanent_immunodeficiency   
>            ///
>                                                 temporary_immunodeficiency   
>            ///
>                                                 ra_sle_psoriasis  dialysis   
>    {
  2.         confirm string variable `var'
  3.         replace `var' = `var' + "-15"
  4.         rename `var' `var'_dstr
  5.         replace `var'_dstr = " " if `var'_dstr == "-15"
  6.         gen `var'_date = date(`var'_dstr, "YMD") 
  7.         order `var'_date, after(`var'_dstr)
  8.         drop `var'_dstr
  9.         format `var'_date %td
 10. }
variable bp_sys_date_measured was str7 now str10
(184,560 real changes made)
(9,220 real changes made)
(9,220 missing values generated)
variable bp_dias_date_measured was str7 now str10
(184,560 real changes made)
(9,075 real changes made)
(9,075 missing values generated)
variable hba1c_percentage_date was str7 now str10
(184,560 real changes made)
(9,287 real changes made)
(9,287 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(184,560 real changes made)
(9,264 real changes made)
(9,264 missing values generated)
variable hypertension was str7 now str10
(184,560 real changes made)
(147,480 real changes made)
(147,480 missing values generated)
variable bmi_date_measured was str7 now str10
(184,560 real changes made)
(9,238 real changes made)
(9,238 missing values generated)
variable chronic_respiratory_disease was str7 now str10
(184,560 real changes made)
(147,482 real changes made)
(147,482 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(184,560 real changes made)
(147,553 real changes made)
(147,553 missing values generated)
variable diabetes was str7 now str10
(184,560 real changes made)
(147,601 real changes made)
(147,601 missing values generated)
variable lung_cancer was str7 now str10
(184,560 real changes made)
(147,749 real changes made)
(147,749 missing values generated)
variable haem_cancer was str7 now str10
(184,560 real changes made)
(147,664 real changes made)
(147,664 missing values generated)
variable other_cancer was str7 now str10
(184,560 real changes made)
(147,660 real changes made)
(147,660 missing values generated)
variable chronic_liver_disease was str7 now str10
(184,560 real changes made)
(147,655 real changes made)
(147,655 missing values generated)
variable stroke was str7 now str10
(184,560 real changes made)
(147,591 real changes made)
(147,591 missing values generated)
variable dementia was str7 now str10
(184,560 real changes made)
(147,736 real changes made)
(147,736 missing values generated)
variable other_neuro was str7 now str10
(184,560 real changes made)
(147,731 real changes made)
(147,731 missing values generated)
variable organ_transplant was str7 now str10
(184,560 real changes made)
(147,386 real changes made)
(147,386 missing values generated)
variable dysplenia was str7 now str10
(184,560 real changes made)
(147,684 real changes made)
(147,684 missing values generated)
variable sickle_cell was str7 now str10
(184,560 real changes made)
(147,744 real changes made)
(147,744 missing values generated)
variable aplastic_anaemia was str7 now str10
(184,560 real changes made)
(147,811 real changes made)
(147,811 missing values generated)
variable hiv_date was str7 now str10
(184,560 real changes made)
(147,703 real changes made)
(147,703 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(184,560 real changes made)
(147,447 real changes made)
(147,447 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(184,560 real changes made)
(147,591 real changes made)
(147,591 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(184,560 real changes made)
(147,797 real changes made)
(147,797 missing values generated)
variable dialysis was str7 now str10
(184,560 real changes made)
(147,844 real changes made)
(147,844 missing values generated)

. 
. rename bmi_date_measured_date      bmi_date_measured

. rename bp_dias_date_measured_date  bp_dias_date

. rename bp_sys_date_measured_date   bp_sys_date

. rename hba1c_percentage_date_date  hba1c_percentage_date

. rename hba1c_mmol_per_mol_date_date  hba1c_mmol_per_mol_date

. rename hiv_date_date hiv_date

. 
. * Dates of: covid tests, ONS death
. foreach var of varlist  dereg_date died_date_ons covid_tpp_probable covid_vac
> c_date ///
>                                                 first_pos_test_sgss sgss_pos_
> inrange {
  2.                 confirm string variable `var'
  3.                 rename `var' _tmp
  4.                 gen `var' = date(_tmp, "YMD")
  5.                 drop _tmp
  6.                 format %d `var'
  7. }
(184,560 missing values generated)
(178,147 missing values generated)
(162,360 missing values generated)
(151,604 missing values generated)
(158,417 missing values generated)

.  
.  
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. * BMI 
. 
. * Only keep if within certain time period? using bmi_date_measured ?
. * NB: Some BMI dates in future or after cohort entry
. 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(24,881 real changes made, 24,881 to missing)

. 
. * Sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. 
. label define maleLab 0 "F" 1 "M"

. label values male maleLab

. 
. 
. * Smoking
. label define smoke_nomissLab 1 "Never" 2 "Former" 3 "Current" 

. 
. gen     smoke = 1  if smoking_status=="N"
(177,284 missing values generated)

. replace smoke = 2  if smoking_status=="E"
(3,716 real changes made)

. replace smoke = 3  if smoking_status=="S"
(22,011 real changes made)

. replace smoke = . if smoking_status=="M"
(0 real changes made)

. label values smoke smoke_nomissLab

. drop smoking_status

. 
. * Ethnicity (5 category)
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicityLab       1 "White"                                    
>    ///
>                                                         2 "Mixed"            
>                            ///
>                                                         3 "Asian or Asian Bri
> tish"      ///
>                                                         4 "Black"            
>                            ///
>                                                         5 "Other"            
>                            

.                                                 
. label values ethnicity ethnicityLab

. 
. * Re-order ethnicity
. gen eth5=1 if ethnicity==1
(80,686 missing values generated)

. replace eth5=2 if ethnicity==3
(6,989 real changes made)

. replace eth5=3 if ethnicity==4
(6,861 real changes made)

. replace eth5=4 if ethnicity==2
(6,898 real changes made)

. replace eth5=5 if ethnicity==5
(13,812 real changes made)

. replace eth5=. if ethnicity==.
(0 real changes made)

. 
. label define eth5Lab    1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    

.  
. label values eth5 eth5Lab

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = . if ethnicity==.
(34,571 real changes made, 34,571 to missing)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British or Mixed British" 
>            ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Black Caribbean"  
>            ///
>                                                 5 "White + Black African"    
>                    ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian or British Indian" 
>            ///
>                                                 9 "Pakistani or British Pakis
> tani"      ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    

.                                                 
. label values ethnicity_16 ethnicity_16

. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen ethnicity_16_combinemixed = ethnicity_16
(80,666 missing values generated)

. recode ethnicity_16_combinemixed 4/7 = 4
(ethnicity_16_combinemixed: 10380 changes made)

. label define ethnicity_16_combinemixed  ///
>                                                 1 "British or Mixed British" 
> ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "All mixed" ///
>                                                 8 "Indian or British Indian" 
> ///
>                                                 9 "Pakistani or British Pakis
> tani" ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian" ///
>                                                 12 "Caribbean" ///
>                                                 13 "African" ///
>                                                 14 "Other Black" ///
>                                                 15 "Chinese" ///
>                                                 16 "Other" 

.                                                 
. label values ethnicity_16_combinemixed ethnicity_16_combinemixed

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(184,550 missing values generated)

. replace stp = sum(stp)
(184,559 real changes made)

. drop stp_old

. 
. * MSOA/UTLA
. 
. egen n_msoa = tag(msoa)

. count if n_msoa
  6,791

. 
. bysort msoa: gen count1 = _N

. summ count1, d

                           count1
-------------------------------------------------------------
      Percentiles      Smallest
 1%           17             10
 5%           20             10
10%           22             10       Obs             184,560
25%           25             10       Sum of Wgt.     184,560

50%           28                      Mean           28.18577
                        Largest       Std. Dev.      5.238736
75%           32             52
90%           35             52       Variance       27.44435
95%           37             52       Skewness       .1999205
99%           41             52       Kurtosis       3.059153

. 
. egen n_utla = tag(utla)

. count if n_utla
  151

. 
. bysort utla: gen count2 = _N

. summ count2, d

                           count2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          465             23
 5%          557             23
10%          655             23       Obs             184,560
25%          871             23       Sum of Wgt.     184,560

50%         1615                      Mean           1929.296
                        Largest       Std. Dev.       1302.03
75%         2738           5084
90%         4180           5084       Variance        1695283
95%         4761           5084       Skewness       .9364096
99%         5084           5084       Kurtosis       2.774759

. 
. * Regroup UTLAs with small case numbers
. 
. gen utla_group = utla_name

. tab utla_group

          utla_group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Barking and Dagenham |        586        0.32        0.32
              Barnet |      1,069        0.58        0.90
            Barnsley |        807        0.44        1.33
 Bath and North East |        757        0.41        1.74
             Bedford |        550        0.30        2.04
              Bexley |        755        0.41        2.45
          Birmingham |      3,616        1.96        4.41
Blackburn with Darwe |        466        0.25        4.66
           Blackpool |        499        0.27        4.93
              Bolton |        935        0.51        5.44
Bournemouth, Christc |      1,304        0.71        6.15
    Bracknell Forest |        418        0.23        6.37
            Bradford |      1,669        0.90        7.28
               Brent |        966        0.52        7.80
   Brighton and Hove |        935        0.51        8.31
    Bristol, City of |      1,474        0.80        9.11
             Bromley |      1,002        0.54        9.65
     Buckinghamshire |      1,796        0.97       10.62
                Bury |        722        0.39       11.01
          Calderdale |        733        0.40       11.41
      Cambridgeshire |      2,100        1.14       12.55
              Camden |        736        0.40       12.95
Central Bedfordshire |        893        0.48       13.43
       Cheshire East |      1,284        0.70       14.13
Cheshire West and Ch |      1,257        0.68       14.81
      City of London |         23        0.01       14.82
            Cornwall |      1,992        1.08       15.90
       County Durham |      1,809        0.98       16.88
            Coventry |      1,201        0.65       17.53
             Croydon |      1,110        0.60       18.13
             Cumbria |      1,703        0.92       19.05
          Darlington |        416        0.23       19.28
               Derby |        835        0.45       19.73
          Derbyshire |      2,688        1.46       21.19
               Devon |      2,863        1.55       22.74
           Doncaster |      1,047        0.57       23.31
              Dorset |      1,332        0.72       24.03
              Dudley |      1,195        0.65       24.68
              Ealing |      1,085        0.59       25.26
East Riding of Yorks |      1,141        0.62       25.88
         East Sussex |      1,892        1.03       26.91
             Enfield |      1,021        0.55       27.46
               Essex |      4,761        2.58       30.04
           Gateshead |        721        0.39       30.43
     Gloucestershire |      2,058        1.12       31.55
           Greenwich |        831        0.45       32.00
             Hackney |        813        0.44       32.44
              Halton |        475        0.26       32.69
Hammersmith and Fulh |        669        0.36       33.06
           Hampshire |      4,536        2.46       35.51
            Haringey |        942        0.51       36.03
              Harrow |        826        0.45       36.47
          Hartlepool |        357        0.19       36.67
            Havering |        798        0.43       37.10
Herefordshire, Count |        679        0.37       37.47
       Hertfordshire |      4,180        2.26       39.73
          Hillingdon |        864        0.47       40.20
            Hounslow |        778        0.42       40.62
       Isle of Wight |        500        0.27       40.89
     Isles of Scilly |         27        0.01       40.91
           Islington |        655        0.35       41.26
Kensington and Chels |        557        0.30       41.56
                Kent |      5,084        2.75       44.32
 Kingston upon Hull, |        883        0.48       44.80
Kingston upon Thames |        540        0.29       45.09
            Kirklees |      1,669        0.90       45.99
            Knowsley |        575        0.31       46.30
             Lambeth |        954        0.52       46.82
          Lancashire |      4,071        2.21       49.03
               Leeds |      2,855        1.55       50.57
           Leicester |        935        0.51       51.08
      Leicestershire |      2,215        1.20       52.28
            Lewisham |      1,004        0.54       52.83
        Lincolnshire |      2,326        1.26       54.09
           Liverpool |      1,618        0.88       54.96
               Luton |        591        0.32       55.28
          Manchester |      1,615        0.88       56.16
              Medway |      1,033        0.56       56.72
              Merton |        679        0.37       57.08
       Middlesbrough |        526        0.29       57.37
       Milton Keynes |        871        0.47       57.84
 Newcastle upon Tyne |        747        0.40       58.25
              Newham |        995        0.54       58.79
             Norfolk |      3,045        1.65       60.44
North East Lincolnsh |        625        0.34       60.77
  North Lincolnshire |        594        0.32       61.10
      North Somerset |        698        0.38       61.47
      North Tyneside |        830        0.45       61.92
     North Yorkshire |      2,111        1.14       63.07
    Northamptonshire |      2,493        1.35       64.42
      Northumberland |      1,042        0.56       64.98
          Nottingham |      1,028        0.56       65.54
     Nottinghamshire |      2,740        1.48       67.02
              Oldham |        871        0.47       67.50
         Oxfordshire |      2,392        1.30       68.79
        Peterborough |        615        0.33       69.13
            Plymouth |        879        0.48       69.60
          Portsmouth |        749        0.41       70.01
             Reading |        507        0.27       70.28
           Redbridge |        871        0.47       70.75
Redcar and Cleveland |        533        0.29       71.04
Richmond upon Thames |        610        0.33       71.37
            Rochdale |        671        0.36       71.74
           Rotherham |        844        0.46       72.19
             Rutland |        118        0.06       72.26
             Salford |        841        0.46       72.71
            Sandwell |      1,030        0.56       73.27
              Sefton |      1,046        0.57       73.84
           Sheffield |      1,941        1.05       74.89
          Shropshire |      1,036        0.56       75.45
              Slough |        377        0.20       75.66
            Solihull |        807        0.44       76.09
            Somerset |      1,961        1.06       77.16
South Gloucestershir |        894        0.48       77.64
      South Tyneside |        596        0.32       77.96
         Southampton |        879        0.48       78.44
     Southend-on-Sea |        465        0.25       78.69
           Southwark |        913        0.49       79.19
          St. Helens |        642        0.35       79.53
       Staffordshire |      2,899        1.57       81.11
           Stockport |      1,092        0.59       81.70
    Stockton-on-Tees |        641        0.35       82.04
      Stoke-on-Trent |        932        0.50       82.55
             Suffolk |      2,423        1.31       83.86
          Sunderland |        953        0.52       84.38
              Surrey |      3,971        2.15       86.53
              Sutton |        665        0.36       86.89
             Swindon |        738        0.40       87.29
            Tameside |        869        0.47       87.76
  Telford and Wrekin |        625        0.34       88.10
            Thurrock |        527        0.29       88.39
              Torbay |        479        0.26       88.64
       Tower Hamlets |        846        0.46       89.10
            Trafford |        767        0.42       89.52
           Wakefield |      1,215        0.66       90.18
             Walsall |      1,059        0.57       90.75
      Waltham Forest |        789        0.43       91.18
          Wandsworth |        971        0.53       91.70
          Warrington |        719        0.39       92.09
        Warwickshire |      1,745        0.95       93.04
      West Berkshire |        623        0.34       93.38
         West Sussex |      2,738        1.48       94.86
         Westminster |        654        0.35       95.22
               Wigan |      1,050        0.57       95.78
           Wiltshire |      1,683        0.91       96.70
Windsor and Maidenhe |        494        0.27       96.96
              Wirral |      1,175        0.64       97.60
           Wokingham |        514        0.28       97.88
       Wolverhampton |        862        0.47       98.35
      Worcestershire |      2,408        1.30       99.65
                York |        645        0.35      100.00
---------------------+-----------------------------------
               Total |    184,560      100.00

. 
. /*
> replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Barki
> ng and Dagenham"
> replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Redbr
> idge"
> 
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Buckingh
> amshire"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Oxfordsh
> ire"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Swindon"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "West Ber
> kshire"
> 
> replace utla_group = "Camden and Westminster" if utla_name == "Camden"
> replace utla_group = "Camden and Westminster" if utla_name == "Westminster"
> 
> replace utla_group = "" if utla_name == "Isles of Scilly"
> 
> replace utla_group = "Richmond and Hounslow" if utla_name == "Richmond upon T
> hames"
> replace utla_group = "Richmond and Hounslow" if utla_name == "Hounslow"
> 
> replace utla_group = "Rutland and Lincoln" if utla_name == "Rutland"
> replace utla_group = "Rutland and Lincoln" if utla_name == "Lincolnshire"
> 
> replace utla_group = "Bolton and Tameside" if utla_name == "Bolton"
> replace utla_group = "Bolton and Tameside" if utla_name == "Tameside"
> 
> tab utla_group
> */
. 
. 
. * NHS England regions
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |     18,312        9.92        9.92
         East of England |     18,456       10.00       19.92
                  London |     36,906       20.00       39.92
              North East |     18,168        9.84       49.76
              North West |     18,575       10.06       59.83
              South East |     18,641       10.10       69.93
              South West |     18,619       10.09       80.02
           West Midlands |     18,345        9.94       89.96
Yorkshire and the Humber |     18,538       10.04      100.00
-------------------------+-----------------------------------
                   Total |    184,560      100.00

. 
. gen region2=.
(184,560 missing values generated)

. replace region2=0 if region=="East of England"
(18,456 real changes made)

. replace region2=1 if region=="East Midlands"
(18,312 real changes made)

. replace region2=2 if region=="London"
(36,906 real changes made)

. replace region2=3 if region=="North East"
(18,168 real changes made)

. replace region2=4 if region=="North West"
(18,575 real changes made)

. replace region2=5 if region=="South East"
(18,641 real changes made)

. replace region2=6 if region=="South West"
(18,619 real changes made)

. replace region2=7 if region=="West Midlands"
(18,345 real changes made)

. replace region2=8 if region=="Yorkshire and the Humber"
(18,538 real changes made)

. 
. drop region

. rename region2 region

. 
. label define regionLab  0 "East" ///
>                                                 1 "East Midlands"  ///
>                                                 2 "London" ///
>                                                 3 "North East" ///
>                                                 4 "North West" ///
>                                                 5 "South East" ///
>                                                 6 "South West" ///
>                                                 7 "West Midlands" ///
>                                                 8 "Yorkshire and Humber"

.                                                 
. label values region regionLab

. 
. 
. **************************
. *  Categorise variables  *
. **************************
. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(182408 differences between age and agegroup)

. 
. label define agegroupLab        0 "0-<18" ///
>                                                         1 "18-<30" ///
>                                                         2 "30-<40" ///
>                                                         3 "40-<50" ///
>                                                         4 "50-<60" ///
>                                                         5 "60-<70" ///
>                                                         6 "70-<80" ///
>                                                         7 "80+"

.                                                 
. label values agegroup agegroupLab

. 
. * For subgroup analysis
. recode age      0/49.9999=1 ///
>                         50/64.9999=2 ///
>                         65/74.9999=3 ///
>                         75/84.9999=4 ///
>                         85/max=5, gen(agegroupA) 
(182344 differences between age and agegroupA)

. 
. label define agegroupALab       1 "0-<50"  ///
>                                                         2 "50-<65" ///
>                                                         3 "65-<75" ///
>                                                         4 "75-<85" ///
>                                                         5 "85+"

.                                                         
. label values agegroupA agegroupALab

. 
. 
. * Create binary age
. recode age min/69.999=0 70/max=1, gen(age70)
(182408 differences between age and age70)

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. assert age70<.

. 
. * Create restricted cubic splines fir age
. mkspline age = age, cubic nknots(4)

. 
. 
. /*  Body Mass Index  */
. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(184,560 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 4503 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 19218 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 26033 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 33935 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 33483 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 42507 changes made)

. replace bmicat = . if bmi>=.
(0 real changes made)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    

.                                         
. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 . = 1 4=2 5=3 6=4, gen(obese4cat)
(180057 differences between bmicat and obese4cat)

. 
. label define obese4catLab       1 "No record of obesity"        ///
>                                                         2 "Obese I (30-34.9)"
>            ///
>                                                         3 "Obese II (35-39.9)
> "          ///
>                                                         4 "Obese III (40+)"  
>            

. label values obese4cat obese4catLab

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Create non-missing 3-category variable for current smoking
. recode smoke .=1, gen(smoke_nomiss)
(151557 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke_nomissLab

. 
. 
. /*  Asthma  */
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3 .=1
(asthmacat: 184560 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(175,480 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(249 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(175,231 real changes made)

. replace bpcat = . if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(17,867 real changes made, 17,867 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 

. label values bpcat bpcat

. 
. recode bpcat .=1, gen(bpcat_nomiss)
(17867 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. order bpcat bphigh, after(bp_dias_date)

. 
. 
. /*  IMD  */
. 
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(184,560 real changes made)

. replace imd = . if imd_o==-1
(0 real changes made)

. drop imd_o

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,360        9.95        9.95
          2 |     36,778       19.93       29.88
          3 |     37,126       20.12       49.99
          4 |     36,645       19.86       69.85
          5 |     55,651       30.15      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. * Reverse the order (so high is more deprived)
. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 147434 changes made)

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     55,651       30.15       30.15
          2 |     36,645       19.86       50.01
          3 |     37,126       20.12       70.12
          4 |     36,778       19.93       90.05
          5 |     18,360        9.95      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. label define imdLab 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived
> " 

. label values imd imdLab 

. 
. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. 
. /*  HOUSEHOLD SIZE  */
. 
. gen hh_total_cat=.
(184,560 missing values generated)

. replace hh_total_cat=1 if household_size >=1 & household_size<=2
(88,021 real changes made)

. replace hh_total_cat=2 if household_size >=3 & household_size<=5
(92,099 real changes made)

. replace hh_total_cat=3 if household_size >=6 & household_size<=10
(253 real changes made)

. replace hh_total_cat=4 if household_size >=11
(0 real changes made)

. 
. label define hh_total_catLab    1 "1-2" ///
>                                                                 2 "3-5" ///
>                                                                 3 "6-10" ///
>                                                                 4 "11+"

.                                                                              
>            
. label values hh_total_cat hh_total_catLab

. 
. 
. /*  RURAL OR URBAN  */
. 
. * Create a 4 category rural urban variable based upon meeting with Roz 21st O
> ctober
. gen rural_urban5=.
(184,560 missing values generated)

. replace rural_urban5=1 if rural_urban==1
(18,516 real changes made)

. replace rural_urban5=2 if rural_urban==2
(18,628 real changes made)

. replace rural_urban5=3 if rural_urban==3|rural_urban==4
(36,909 real changes made)

. replace rural_urban5=4 if rural_urban==5|rural_urban==6
(37,044 real changes made)

. replace rural_urban5=5 if rural_urban==7|rural_urban==8
(73,463 real changes made)

. 
. label define rural_urban5Lab    1 "Urban major conurbation" ///
>                                                                 2 "Urban mino
> r conurbation" ///
>                                                                 3 "Urban city
>  and town" ///
>                                                                 4 "Rural town
>  and fringe" ///
>                                                                 5 "Rural vill
> age and dispersed"

.                                                                 
. label values rural_urban5 rural_urban5Lab

. tab rural_urban5, m

               rural_urban5 |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |     18,516       10.03       10.03
    Urban minor conurbation |     18,628       10.09       20.13
        Urban city and town |     36,909       20.00       40.12
      Rural town and fringe |     37,044       20.07       60.20
Rural village and dispersed |     73,463       39.80      100.00
----------------------------+-----------------------------------
                      Total |    184,560      100.00

. 
. 
. /*  CARE HOME TYPE  */
. 
. tab care_home_type, m

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |      9,210        4.99        4.99
         PN |      9,166        4.97        9.96
         PS |      9,283        5.03       14.99
          U |    156,901       85.01      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. gen home_bin=0

. replace home_bin=1 if care_home_type=="PC" | care_home_type=="PN" | care_home
> _type=="PS"
(27,659 real changes made)

. 
. tab care_home_type home_bin, m

care_home_ |       home_bin
      type |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      9,210 |     9,210 
        PN |         0      9,166 |     9,166 
        PS |         0      9,283 |     9,283 
         U |   156,901          0 |   156,901 
-----------+----------------------+----------
     Total |   156,901     27,659 |   184,560 

. 
. label define home_binLab        0 "Private home" ///
>                                                         1 "Care home"

. 
. label values home_bin home_binLab

. 
. 
. /*  Centred age, sex, IMD, ethnicity (for adjusted KM plots)  */ 
. 
. * Centre age (linear)
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    184,560    40.21887    23.74046          0        105

. gen c_age = age-r(mean)

. 
. * "Centre" sex to be coded -1 +1 
. recode male 0=-1, gen(c_male)
(93778 differences between male and c_male)

. 
. * "Centre" IMD
. gen c_imd = imd - 3

. 
. * "Centre" ethnicity
. gen c_ethnicity = ethnicity - 3
(46,126 missing values generated)

. 
. 
. **************************************************
. *  Create binary comorbidity indices from dates  *
. **************************************************
. 
. * Comorbidities ever before study_start
. foreach var of varlist  chronic_respiratory_disease_date        ///
>                                                 chronic_cardiac_disease_date 
>            ///
>                                                 diabetes_date                
>                            ///
>                                                 chronic_liver_disease_date   
>                    ///
>                                                 stroke_date                  
>                                    ///
>                                                 dementia_date                
>                            ///
>                                                 other_neuro_date             
>                            ///
>                                                 organ_transplant_date        
>                    ///
>                                                 aplastic_anaemia_date        
>                    ///
>                                                 hypertension_date            
>                            ///
>                                                 dysplenia_date               
>                            ///
>                                                 sickle_cell_date             
>                            ///
>                                                 hiv_date                     
>                                    ///
>                                                 permanent_immunodeficiency_da
> te         ///
>                                                 temporary_immunodeficiency_da
> te         ///
>                                                 ra_sle_psoriasis_date dialysi
> s_date {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'< study_start)
  4.         order `newvar', after(`var')
  5. }

. 
. 
. **************************
. *  Epidemiological week  *
. **************************
. 
. gen start_week = 53 if study_start <= date("04jan2021", "DMY")

. replace start_week = 52 if study_start <= date("27dec2020", "DMY")
(158,867 real changes made)

. replace start_week = 51 if study_start <= date("20dec2020", "DMY")
(134,691 real changes made)

. replace start_week = 50 if study_start <= date("13dec2020", "DMY")
(109,004 real changes made)

. replace start_week = 49 if study_start <= date("06dec2020", "DMY")
(82,301 real changes made)

. replace start_week = 48 if study_start <= date("29nov2020", "DMY")
(54,315 real changes made)

. replace start_week = 47 if study_start <= date("22nov2020", "DMY")
(25,319 real changes made)

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
         47 |     25,319       13.72       13.72
         48 |     28,996       15.71       29.43
         49 |     27,986       15.16       44.59
         50 |     26,703       14.47       59.06
         51 |     25,687       13.92       72.98
         52 |     24,176       13.10       86.08
         53 |     25,693       13.92      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. replace start_week = start_week-46
(184,560 real changes made)

. 
. label define start_weekLab      1 "16Nov-22Nov" ///
>                                                         2 "23Nov-29Nov" ///
>                                                         3 "30Nov-06Dec" ///
>                                                         4 "07Dec-13Dec" ///
>                                                         5 "14Dec-20Dec" ///
>                                                         6 "21Dec-27Dec" ///
>                                                         7 "28Dec-04Jan" ///
>                                                         

. label values start_week start_weekLab

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
16Nov-22Nov |     25,319       13.72       13.72
23Nov-29Nov |     28,996       15.71       29.43
30Nov-06Dec |     27,986       15.16       44.59
07Dec-13Dec |     26,703       14.47       59.06
14Dec-20Dec |     25,687       13.92       72.98
21Dec-27Dec |     24,176       13.10       86.08
28Dec-04Jan |     25,693       13.92      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. 
. ***************************
. *  Grouped comorbidities  *
. ***************************
. 
. /*  Neurological  */
. 
. * Stroke and dementia
. egen stroke_dementia = rowmax(stroke dementia)

. order stroke_dementia, after(dementia_date)

. 
. 
. /*  Spleen  */
. 
. * Spleen problems (dysplenia/splenectomy/etc and sickle cell disease)   
. egen spleen = rowmax(dysplenia sickle_cell) 

. order spleen, after(sickle_cell)

. 
. 
. /*  Cancer  */
. 
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. local fiveybefore = study_start-5*365.25

. local oneybefore = study_start-365.25

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(haem_cancer_date, d(1/1/1900), `fiveyb
> efore')
(151,364 missing values generated)

. replace cancer_haem_cat = 3 if inrange(haem_cancer_date, `fiveybefore', `oney
> before')
(2,864 real changes made)

. replace cancer_haem_cat = 2 if inrange(haem_cancer_date, `oneybefore', study_
> start)
(706 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 147794 changes made)

. label values cancer_haem_cat cancer

. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(lung_cancer_date,  d(1/1/1900), `fiv
> eybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, d(1/1/1900), `fiveybefore') 
(124,316 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(lung_cancer_date,  `fiveybefore', `o
> neybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, `fiveybefore', `oneybefore') 
(5,739 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(lung_cancer_date,  `oneybefore', stu
> dy_start) | ///
>                                                                  inrange(othe
> r_cancer_date, `oneybefore', study_start)
(1,460 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 118476 changes made)

. label values cancer_exhaem_cat cancer

. 
. * Put variables together
. order cancer_exhaem_cat cancer_haem_cat, after(other_cancer_date)

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * HIV, permanent immunodeficiency ever, OR 
. * temporary immunodeficiency or aplastic anaemia last year
. gen temp1  = max(hiv, permanent_immunodeficiency)

. gen temp2  = inrange(temporary_immunodeficiency_date, `oneybefore', study_sta
> rt)

. gen temp3  = inrange(aplastic_anaemia_date, `oneybefore', study_start)

. 
. egen other_immunosuppression = rowmax(temp1 temp2 temp3)

. drop temp1 temp2 temp3

. order other_immunosuppression, after(temporary_immunodeficiency)

. 
. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 3608 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(9,927 real changes made, 9,927 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(9,927 missing values generated)

. 
. gen min=.
(184,560 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(88,717 real changes made)

. replace min = SCr_adj/0.9 if male==1
(85,916 real changes made)

. replace min = min^-0.329  if male==0
(88,717 real changes made)

. replace min = min^-0.411  if male==1
(85,916 real changes made)

. replace min = 1 if min<1
(48,388 real changes made)

. 
. gen max=.
(184,560 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(88,717 real changes made)

. replace max=SCr_adj/0.9 if male==1
(85,916 real changes made)

. replace max=max^-1.209
(174,633 real changes made)

. replace max=1 if max>1
(136,172 real changes made)

. 
. * egfr calculated using CKD-EPI formula with no eth
. gen egfr=min*max*141
(9,927 missing values generated)

. replace egfr=egfr*(0.993^age)
(172,590 real changes made)

. replace egfr=egfr*1.018 if male==0
(88,717 real changes made)

. 
. * Categorise into ckd stages
. * CKD stage calc without eth
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(9927 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(174633 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
. 
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(173023 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(9,927 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. 
. *More detailed version incorporating stage 5 or dialysis as a separate catego
> ry 
. recode ckd 0=1 2/3=2 4=3 5=4, gen(reduced_kidney_function_cat2)
(173023 differences between ckd and reduced_kidney_function_cat2)

. replace reduced_kidney_function_cat2 = 1 if creatinine==. 
(9,927 real changes made)

. replace reduced_kidney_function_cat2 = 4 if dialysis==1 
(36,588 real changes made)

. 
. label define reduced_kidney_function_cat2lab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4 egfr 15-<30" 4 "
> Stage 5 egfr <15 or dialysis"

. label values reduced_kidney_function_cat2 reduced_kidney_function_cat2lab 

.  
.         
. ***********
. *  Hba1c  *
. ***********
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage<=0
(10,372 real changes made, 10,372 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol<=0
(13,234 real changes made, 13,234 to missing)

. 
. local fifteenmbefore = study_start-15*(365.25/12)

. 
. * Only consider measurements in last 15 months
. replace hba1c_percentage   = . if hba1c_percentage_date   < `fifteenmbefore'
(172,454 real changes made, 172,454 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol_date < `fifteenmbefore'
(169,702 real changes made, 169,702 to missing)

. 
. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |      1,734    5.026263    2.029473   .0573327   11.05718
hba1c_mmol~l |      1,624    40.29419    17.88579   .0979988   99.35766

. gen     hba1c_pct = hba1c_percentage 
(182,826 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(1,624 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(3,346 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(182,187 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(501 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(166 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(211 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(95 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      2,373       70.92       70.92
  >=6.5-7.4 |        501       14.97       85.89
  >=7.5-7.9 |        166        4.96       90.85
    >=8-8.9 |        211        6.31       97.16
        >=9 |         95        2.84      100.00
------------+-----------------------------------
      Total |      3,346      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if diabetes==0
(36,828 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(555 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(90 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(36,183 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. * Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. 
. ******************************
. *  Aggregated comorbidities  *
. ******************************
. 
. /*
>         Create a comorbidities variable based upon Fizz's JCVI work that has 
> 0, 1, 2 or more of 
>         the following comorbdities: 
>         (1) respiratory disease, (2) severe asthma, (3) chronic cardiac disea
> se, (4) diabetes, 
>         (5) non-haematological cancer (diagnosed in last year), (6) haematolo
> gical cancer (diagnosed within 5 years), 
>         (7) liver disease, (8) stroke, (9) dementia, (10) poor kidney functio
> n, (11) organ transplant, 
>         (12) asplenia, (13) other immunosuppression.
> */
. 
. 
. *(1) respiratory disease
. tab chronic_respiratory_disease

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    147,594       79.97       79.97
          1 |     36,966       20.03      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *think I need level "3" of this, as this is asthma that requires OCS
. *(2) severe asthma
. tab asthmacat

   asthmacat |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |    177,217       96.02       96.02
 Yes, no OCS |      3,687        2.00       98.02
Yes with OCS |      3,656        1.98      100.00
-------------+-----------------------------------
       Total |    184,560      100.00

. generate asthma_severe=0

. replace asthma_severe=1 if asthmacat==3
(3,656 real changes made)

. tab asthma_severe

asthma_seve |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    180,904       98.02       98.02
          1 |      3,656        1.98      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(3) cardiac disease
. tab chronic_cardiac_disease

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    147,663       80.01       80.01
          1 |     36,897       19.99      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(4) diabetes
. tab diabcat

                   diabcat |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
               No diabetes |    147,732       80.05       80.05
       Controlled diabetes |        555        0.30       80.35
     Uncontrolled diabetes |         90        0.05       80.39
Diabetes, no hba1c measure |     36,183       19.61      100.00
---------------------------+-----------------------------------
                     Total |    184,560      100.00

. tab diabcat, nolabel

    diabcat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    147,732       80.05       80.05
          2 |        555        0.30       80.35
          3 |         90        0.05       80.39
          4 |     36,183       19.61      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. generate dm=0

. replace dm=1 if diabcat>1
(36,828 real changes made)

. tab dm

         dm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    147,732       80.05       80.05
          1 |     36,828       19.95      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. tab dm diabcat

           |                   diabcat
        dm | No diabet  Controlle  Uncontrol  Diabetes, |     Total
-----------+--------------------------------------------+----------
         0 |   147,732          0          0          0 |   147,732 
         1 |         0        555         90     36,183 |    36,828 
-----------+--------------------------------------------+----------
     Total |   147,732        555         90     36,183 |   184,560 

. 
. *(5) non-haem cancer (in previous year)
. tab cancer_exhaem

cancer_exhaem |
         _cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |    118,476       64.19       64.19
    Last year |      1,460        0.79       64.98
2-5 years ago |      5,720        3.10       68.08
     5+ years |     58,904       31.92      100.00
--------------+-----------------------------------
        Total |    184,560      100.00

. tab cancer_exhaem, nolab

cancer_exha |
     em_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    118,476       64.19       64.19
          2 |      1,460        0.79       64.98
          3 |      5,720        3.10       68.08
          4 |     58,904       31.92      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. generate cancer_nonhaemPrevYear=0

. replace cancer_nonhaemPrevYear=1 if cancer_exhaem_cat==2
(1,460 real changes made)

. tab cancer_nonhaemPrevYear

cancer_nonh |
aemPrevYear |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    183,100       99.21       99.21
          1 |      1,460        0.79      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(6) haem cancer (within previous 5 years)
. tab cancer_haem

cancer_haem_c |
           at |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |    147,794       80.08       80.08
    Last year |        706        0.38       80.46
2-5 years ago |      2,864        1.55       82.01
     5+ years |     33,196       17.99      100.00
--------------+-----------------------------------
        Total |    184,560      100.00

. tab cancer_haem, nolab

cancer_haem |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    147,794       80.08       80.08
          2 |        706        0.38       80.46
          3 |      2,864        1.55       82.01
          4 |     33,196       17.99      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. generate cancer_haemPrev5Years=0

. replace cancer_haemPrev5Years=1 if inrange(cancer_haem_cat,2,3)
(3,570 real changes made)

. tab cancer_haemPrev5Years

cancer_haem |
 Prev5Years |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    180,990       98.07       98.07
          1 |      3,570        1.93      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(7) liver disease
. tab chronic_liver_disease

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    147,788       80.08       80.08
          1 |     36,772       19.92      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(8 and 9) stroke or dementia
. tab stroke_dementia

stroke_deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,333       64.12       64.12
          1 |     66,227       35.88      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(10) poor kidney function
. tab reduced_kidney_function_cat2

    RECODE of ckd (RECODE of |
                   egfr_cat) |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |    146,669       79.47       79.47
Stage 3a/3b egfr 30-60       |      1,303        0.71       80.18
Stage 5 egfr <15 or dialysis |     36,588       19.82      100.00
-----------------------------+-----------------------------------
                       Total |    184,560      100.00

. tab reduced_kidney_function_cat2, nolabel

  RECODE of |
ckd (RECODE |
         of |
  egfr_cat) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    146,669       79.47       79.47
          2 |      1,303        0.71       80.18
          4 |     36,588       19.82      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. gen egfr60 = 0

. replace egfr60 = 1 if reduced_kidney_function_cat2 > 1
(37,891 real changes made)

. tab egfr60 reduced_kidney_function_cat2

           |     RECODE of ckd (RECODE of
           |            egfr_cat)
    egfr60 |      None  Stage 3a/  Stage 5 e |     Total
-----------+---------------------------------+----------
         0 |   146,669          0          0 |   146,669 
         1 |         0      1,303     36,588 |    37,891 
-----------+---------------------------------+----------
     Total |   146,669      1,303     36,588 |   184,560 

. 
. *(11) organ transplant
. tab organ_transplant

organ_trans |
      plant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    147,510       79.93       79.93
          1 |     37,050       20.07      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(12) asplenia
. tab spleen

     spleen |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,357       64.13       64.13
          1 |     66,203       35.87      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *(13) other immunosuppression
. tab other_immuno

other_immun |
osuppressio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    117,301       63.56       63.56
          1 |     67,259       36.44      100.00
------------+-----------------------------------
      Total |    184,560      100.00

. 
. *create a total comborb var
. order chronic_respiratory_disease asthma_severe chronic_cardiac_disease dm ca
> ncer_nonhaemPrevYear cancer_haemPrev5Years chronic_liver_disease stroke_demen
> tia egfr60 organ_transplant spleen other_immuno

. egen totComorbsOfInterest=rowtotal(chronic_respiratory_disease - other_immuno
> )

. summ totComorbsOfInterest, d

                    totComorbsOfInterest
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs             184,560
25%            1              0       Sum of Wgt.     184,560

50%            2                      Mean           2.334086
                        Largest       Std. Dev.      1.305774
75%            3              8
90%            4              8       Variance       1.705046
95%            5              8       Skewness       .3572688
99%            6              9       Kurtosis       2.919573

. order totComorbsOfInterest

. 
. *create the covariate var I need
. generate comorb_cat=.
(184,560 missing values generated)

. replace comorb_cat=0 if totComorbsOfInterest==0
(12,218 real changes made)

. replace comorb_cat=1 if totComorbsOfInterest==1
(38,621 real changes made)

. replace comorb_cat=2 if totComorbsOfInterest>1
(133,721 real changes made)

. 
. label define comorb_catLab      0 "No comorbidity"      ///
>                                                         1 "1 comorbidity"    
>            ///
>                                                         2 "2+ comorbidities" 
>                    

. label values comorb_cat comorb_catLab

. tab comorb_cat, m

      comorb_cat |      Freq.     Percent        Cum.
-----------------+-----------------------------------
  No comorbidity |     12,218        6.62        6.62
   1 comorbidity |     38,621       20.93       27.55
2+ comorbidities |    133,721       72.45      100.00
-----------------+-----------------------------------
           Total |    184,560      100.00

. 
. 
. 
. ********************************
. *  Outcomes and survival time  *
. ********************************
. 
. /*  28-day risk censoring dates  */
. noi di "REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD"
REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD

. gen ons_data_date = date("29jan2021", "DMY")

. gen ons_data_cens = ons_data_date-14                    // Censor 14 days pri
> or to ONS death data upload

. gen risk_28_days = study_start+28

. gen risk_40_days = study_start+40

. 
. * 28-day risk population
. gen risk_pop = (risk_28_days <= ons_data_cens)  // Indicator for has 28-days 
> follow-up

. gen time_check_28 = ons_data_cens-study_start

. summ time_check_28 if risk_pop == 1, d

                        time_check_28
-------------------------------------------------------------
      Percentiles      Smallest
 1%           28             28
 5%           29             28
10%           31             28       Obs             127,469
25%           36             28       Sum of Wgt.     127,469

50%           44                      Mean           43.95018
                        Largest       Std. Dev.       9.19976
75%           52             59
90%           57             59       Variance       84.63558
95%           58             59       Skewness         -.0578
99%           59             59       Kurtosis       1.808896

. 
. * 40-day risk population
. gen risk_pop_40 = (risk_40_days <= ons_data_cens)       // Indicator for has 
> 40-days follow-up

. gen time_check_40 = ons_data_cens-study_start

. summ time_check_40 if risk_pop_40 == 1, d

                        time_check_40
-------------------------------------------------------------
      Percentiles      Smallest
 1%           40             40
 5%           41             40
10%           42             40       Obs              82,301
25%           45             40       Sum of Wgt.      82,301

50%           50                      Mean            49.6381
                        Largest       Std. Dev.      5.764874
75%           55             59
90%           58             59       Variance       33.23378
95%           59             59       Skewness      -.0297975
99%           59             59       Kurtosis       1.799094

. 
. /*   Outcomes   */
. 
. * 28-day risk indicator
. gen died_pre_cens = (died_date_ons < ons_data_cens)

. gen death_time = died_date_ons-study_start if died_pre_cens == 1
(181,076 missing values generated)

. summ death_time, d

                         death_time
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            4              1       Obs               3,484
25%            9              1       Sum of Wgt.       3,484

50%           19                      Mean           20.89294
                        Largest       Std. Dev.      13.87209
75%           31             57
90%           41             57       Variance        192.435
95%           47             58       Skewness       .4915265
99%           53             58       Kurtosis       2.326221

. 
. gen risk_28 = (death_time <= 28)

. tab died_pre_cens risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_28
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |   181,076          0 |   181,076 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |     1,020      2,464 |     3,484 
           |     29.28      70.72 |    100.00 
-----------+----------------------+----------
     Total |   182,096      2,464 |   184,560 
           |     98.66       1.34 |    100.00 

. 
. * 40-day risk indicator
. gen risk_40 = (death_time <= 40)

. tab died_pre_cens risk_40, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_40
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |   181,076          0 |   181,076 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |       377      3,107 |     3,484 
           |     10.82      89.18 |    100.00 
-----------+----------------------+----------
     Total |   181,453      3,107 |   184,560 
           |     98.32       1.68 |    100.00 

. 
. /* Survival time */
. 
. * Censoring date for Cox
. gen vacc_cens = covid_vacc_date - 7 if covid_vacc_date != .
(151,604 missing values generated)

. gen cox_pop = (study_start < vacc_cens)                 // Exclude if vaccina
> ted within 7 days

. 
. * Censor at death, ons data censor, or 7 days prior to vaccine
. gen stime_death = min(died_date_ons, ons_data_cens, vacc_cens)

. 
. gen cox_death = (died_date_ons < .)

. replace cox_death = 0 if (died_date_ons > stime_death)
(3,089 real changes made)

. 
. gen cox_time = stime_death-study_start

. 
. * Format date variables
. format ons_data_date ons_data_cens risk_28_days risk_40_days stime_death %td 

. 
.                 
. *********************
. *  Label variables  *
. *********************
. 
. * Remove old labels
. foreach var of varlist _all {
  2.         label var `var' ""
  3. }

. 
. * Demographics
. label var patient_id                                    "Patient ID"

. label var start_week                                    "Epidemiological week
>  of study"

. label var age                                                   "Age (years)"

. label var agegroup                                              "Grouped age"

. label var agegroupA                                             "Age subgroup
> s"

. label var age70                                                 "70 years and
>  older"

. label var age1                                                  "Age spline 1
> "

. label var age2                                                  "Age spline 2
> "

. label var age3                                                  "Age spline 3
> "

. label var male                                                  "Male"

. label var bmi                                                   "Body Mass In
> dex (BMI, kg/m2)"

. label var bmicat                                                "Grouped BMI"

. label var bmi_date                                      "Body Mass Index (BMI
> , kg/m2), date measured"

. label var obese4cat                                             "Evidence of 
> obesity (missing set to none)"

. label var smoke                                                 "Smoking stat
> us"

. label var smoke_nomiss                                  "Smoking status (miss
> ing set to never)"

. label var imd                                                   "Index of Mul
> tiple Deprivation (IMD)"

. label var eth5                                                  "Ethnicity in
>  5 categories"

. label var ethnicity_16                                  "Ethnicity in 16 cate
> gories"

. label var ethnicity_16_combinemixed             "Ethnicity detailed with mixe
> d groups combined"

. label var stp                                                   "Sustainabili
> ty and Transformation Partnership"

. label var region                                                "NHS England 
> region"

. label var utla_group                                    "UTLA"

. label var rural_urban                                   "Rural urban classifi
> cation"

. label var rural_urban5                                  "Rural Urban in five 
> categories"

. 
. label var household_size                                "Household size"

. label var hh_total_cat                                  "Categorical househol
> d size"

. label var care_home_type                                "Care home status"

. label var home_bin                                              "Binary care 
> home status"

. 
. /*
> label var hba1ccat                                              "Categorised 
> hba1c"
> label var egfr_cat                                              "Calculated e
> GFR"
> label var bp_sys                                                "Systolic blo
> od pressure"
> label var bp_sys_date                                   "Systolic blood press
> ure, date"
> label var bp_dias                                               "Diastolic bl
> ood pressure"
> label var bp_dias_date                                  "Diastolic blood pres
> sure, date"
> label var bpcat                                                 "Grouped bloo
> d pressure"
> label var bphigh                                                "Binary high 
> (stage 1/2) blood pressure"
> label var htdiag_or_highbp                              "Diagnosed hypertensi
> on or high blood pressure"
> */
. 
. /*
> label var c_age                                                 "Centred age"
> label var c_male                                                "Centred sex 
> (code: -1/+1)"
> label var c_imd                                                 "Centred Inde
> x of Multiple Deprivation (values: -2/+2)"
> label var c_ethnicity                                   "Centred ethnicity (v
> alues: -2/+2)"
> */
. 
. * Comorbidities
. /*
> label var chronic_respiratory_disease   "Respiratory disease (excl. asthma)"
> label var asthmacat                                             "Asthma, grou
> ped by severity (OCS use)"
> label var asthma                                                "Asthma"
> label var chronic_cardiac_disease               "Heart disease"
> label var diabetes                                              "Diabetes"
> label var diabcat                                               "Diabetes, gr
> ouped"
> label var cancer_exhaem_cat                             "Cancer (exc. haemato
> logical), grouped by time since diagnosis"
> label var cancer_haem_cat                               "Haematological malig
> nancy, grouped by time since diagnosis"
> label var chronic_liver_disease                 "Chronic liver disease"
> label var stroke_dementia                               "Stroke or dementia"
> label var other_neuro                                   "Neuro condition othe
> r than stroke/dementia"    
> label var reduced_kidney_function_cat   "Reduced kidney function" 
> label var organ_transplant                              "Organ transplant rec
> ipient"
> label var dysplenia                                             "Dysplenia (s
> plenectomy, other, not sickle cell)"
> label var sickle_cell                                   "Sickle cell"
> label var spleen                                                "Spleen probl
> ems (dysplenia, sickle cell)"
> label var ra_sle_psoriasis                              "RA, SLE, Psoriasis (
> autoimmune disease)"
> label var aplastic_anaemia                              "Aplastic anaemia"
> label var hiv                                                   "HIV"
> label var permanent_immunodeficiency    "Permanent immunodeficiency"
> label var temporary_immunodeficiency    "Temporary immunosuppression"
> label var other_immunosuppression               "Immunosuppressed (combinatio
> n algorithm)"
> label var chronic_respiratory_disease_date      "Respiratory disease (excl. a
> sthma), date"
> label var chronic_cardiac_disease_date  "Heart disease, date"
> label var diabetes_date                                 "Diabetes, date"
> label var lung_cancer_date                              "Lung cancer, date"
> label var haem_cancer_date                              "Haem. cancer, date"
> label var other_cancer_date                             "Any cancer, date"
> label var chronic_liver_disease_date    "Liver, date"
> label var stroke_date                                   "Stroke, date"
> label var dementia_date                                 "Dementia, date"
> label var other_neuro_date                              "Neuro condition othe
> r than stroke/dementia, date"      
> label var organ_transplant_date                 "Organ transplant recipient, 
> date"
> label var dysplenia_date                                "Splenectomy etc, dat
> e"
> label var sickle_cell_date                              "Sickle cell, date"
> label var ra_sle_psoriasis_date                 "RA, SLE, Psoriasis (autoimmu
> ne disease), date"
> label var aplastic_anaemia_date                 "Aplastic anaemia, date"
> label var hiv_date                                              "HIV, date"
> label var permanent_immunodeficiency_date "Permanent immunodeficiency, date"
> label var temporary_immunodeficiency_date "Temporary immunosuppression, date"
> label var dialysis                                              "Dialysis"
> */
. label var comorb_cat                                    "Categorical number o
> f comorbidites"

. 
.         
. * Outcomes and follow-up
. label var study_start                                   "Date of study entry"

. label var study_end                                             "Date of last
>  entry"

. label var risk_pop                                              "1=Population
>  for 28-day risk analysis"

. label var risk_pop_40                                   "1=Population for 40-
> day risk analysis"

. label var risk_28                                               "28-day outco
> me"

. label var risk_40                                               "40-day outco
> me"

. label var cox_pop                                               "1=Population
>  for Cox analysis"

. label var stime_death                                   "Date of study exit"

. label var cox_death                                             "Outcome for 
> Cox"

. label var cox_time                                              "Survival tim
> e"

. label var sgtf                                                  "Exposure: 0=
> VOC; 1=non-VOC"

. 
. 
. ***************
. *  Tidy data  *
. ***************
. 
. * REDUCE DATASET SIZE TO VARIABLES NEEDED - KEEP THOSE WITH LABELS
. ds , has(varl)
bmi_date_m~d  study_start   region        imd           risk_40
sgtf          study_end     agegroup      hh_total_cat  cox_pop
age           male          agegroupA     rural_urban5  stime_death
rural_urban   smoke         age70         home_bin      cox_death
household_~e  smoke_nomiss  age1          start_week    cox_time
care_home_~e  eth5          age2          comorb_cat
bmi           ethnicity_~d  age3          risk_pop
ethnicity_16  stp           bmicat        risk_pop_40
patient_id    utla_group    obese4cat     risk_28

. keep `r(varlist)'

. 
. 
. ***************
. *  Save data  *
. ***************
. 
. sort patient_id

. order patient_id risk_pop risk_pop_40 risk_28 risk_40 cox_pop cox_death stime
> _death cox_time sgtf

. 
. label data "SGTF CFR ANALYSIS DATASET: $S_DATE"

. 
. save ./output/cr_analysis_dataset.dta, replace
(note: file ./output/cr_analysis_dataset.dta not found)
file ./output/cr_analysis_dataset.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 closed on:  12 Feb 2021, 15:16:39
-------------------------------------------------------------------------------
