-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 opened on:  11 Feb 2021, 11:40:03

. 
. clear

. 
. /*
> import delimited "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\output
> \input.csv"
> merge m:1 msoa using "C:\Users\EIDEDGRI\Documents\GitHub\SGTF-CFR-research\lo
> okups\MSOA_lookup"
> drop if _merge==2
> drop _merge
> */
. 
. import delimited ./output/input.csv
(57 vars, 400,000 obs)

. merge m:1 msoa using ./lookups/MSOA_lookup

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           400,000  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(0 observations deleted)

. drop _merge

. 
. 
. rename hiv hiv_code

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. gen study_start = date(sgss_pos_inrange, "YMD")
(79,999 missing values generated)

. summ study_start

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 study_start |    320,001       22260     14.1336      22236      22284

. noi disp "MINIMUM START DATE: " %td r(min)
MINIMUM START DATE: 17nov2020

. 
. gen study_end = date("04jan2021", "DMY")

. format %td study_start study_end

. 
. * DROP IF NO POSITIVE PCR TEST IN SGSS DURING STUDY PERIOD
. noi di "NO POSITIVE TEST IN STUDY PERIOD"
NO POSITIVE TEST IN STUDY PERIOD

. drop if sgss_pos_inrange == ""
(79,999 observations deleted)

. 
. * DROP IF DIED ON/BEFORE STUDY START DATE
. noi di "DIED ON/BEFORE STUDY START DATE:" 
DIED ON/BEFORE STUDY START DATE:

. drop if date(died_date_ons, "YMD") <= study_start
(21,853 observations deleted)

. 
. * DROP IF COVID POSITIVE ON/BEFORE STUDY START DATE
. noi di "COVID POSITIVE BEFORE STUDY START DATE:" 
COVID POSITIVE BEFORE STUDY START DATE:

. drop if date(covid_tpp_probable, "YMD") <= study_start
(26,927 observations deleted)

. drop if date(first_pos_test_sgss, "YMD") <= study_start
(81,659 observations deleted)

. 
. * DROP IF VACCINATED ON/BEFORE STUDY START DATE
. noi di "VACCINATED ON/BEFORE STUDY START DATE:" 
VACCINATED ON/BEFORE STUDY START DATE:

. drop if date(covid_vacc_date, "YMD") <= study_start
(4,972 observations deleted)

. 
. * Age: Exclude children
. *noi di "DROPPING AGE<18:" 
. *drop if age<18
. 
. * Age: Exclude those with implausible ages
. assert age<.

. noi di "DROPPING AGE>105:" 
DROPPING AGE>105:

. drop if age>105
(19 observations deleted)

. 
. * Sex: Exclude categories other than M and F
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. 
. ********************************
. *  CREATE DUMMY SGTF VARIABLE  *
. ********************************
. 
. gen has_sgtf = rbinomial(1,0.5)

. 
. * DROP IF NO DATA ON SGTF
. noi di "DROPPING NO SGTF DATA" 
DROPPING NO SGTF DATA

. drop if has_sgtf==0
(92,347 observations deleted)

. 
. gen sgtf = rbinomial(1,0.5)

. replace sgtf = rbinomial(1,0.6) if died_date_ons != ""
(1,585 real changes made)

. 
. label define sgtfLab 0 "non-VOC" 1 "VOC"

. label values sgtf sgtfLab

. 
. 
. ******************************
. *  Convert strings to dates  *
. ******************************
. 
. * Covariates
. foreach var of varlist  bp_sys_date                                     ///
>                                                 bp_dias_date                 
>                    ///
>                                                 hba1c_percentage_date        
>            ///
>                                                 hba1c_mmol_per_mol_date      
>            ///
>                                                 hypertension                 
>                    ///
>                                                 bmi_date_measured            
>                    ///
>                                                 chronic_respiratory_disease  
>    ///
>                                                 chronic_cardiac_disease      
>            ///
>                                                 diabetes                     
>                            ///
>                                                 lung_cancer                  
>                    ///
>                                                 haem_cancer                  
>                            ///
>                                                 other_cancer                 
>                    ///
>                                                 chronic_liver_disease        
>            ///
>                                                 stroke                       
>                            ///
>                                                 dementia                     
>                            ///
>                                                 other_neuro                  
>                    ///
>                                                 organ_transplant             
>                    ///     
>                                                 dysplenia                    
>                            ///
>                                                 sickle_cell                  
>                    ///
>                                                 aplastic_anaemia             
>                    ///
>                                                 hiv_date                     
>                            ///
>                                                 permanent_immunodeficiency   
>            ///
>                                                 temporary_immunodeficiency   
>            ///
>                                                 ra_sle_psoriasis  dialysis   
>    {
  2.         confirm string variable `var'
  3.         replace `var' = `var' + "-15"
  4.         rename `var' `var'_dstr
  5.         replace `var'_dstr = " " if `var'_dstr == "-15"
  6.         gen `var'_date = date(`var'_dstr, "YMD") 
  7.         order `var'_date, after(`var'_dstr)
  8.         drop `var'_dstr
  9.         format `var'_date %td
 10. }
variable bp_sys_date_measured was str7 now str10
(92,224 real changes made)
(4,671 real changes made)
(4,671 missing values generated)
variable bp_dias_date_measured was str7 now str10
(92,224 real changes made)
(4,601 real changes made)
(4,601 missing values generated)
variable hba1c_percentage_date was str7 now str10
(92,224 real changes made)
(4,537 real changes made)
(4,537 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(92,224 real changes made)
(4,605 real changes made)
(4,605 missing values generated)
variable hypertension was str7 now str10
(92,224 real changes made)
(73,873 real changes made)
(73,873 missing values generated)
variable bmi_date_measured was str7 now str10
(92,224 real changes made)
(4,737 real changes made)
(4,737 missing values generated)
variable chronic_respiratory_disease was str7 now str10
(92,224 real changes made)
(73,704 real changes made)
(73,704 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(92,224 real changes made)
(73,790 real changes made)
(73,790 missing values generated)
variable diabetes was str7 now str10
(92,224 real changes made)
(73,754 real changes made)
(73,754 missing values generated)
variable lung_cancer was str7 now str10
(92,224 real changes made)
(73,726 real changes made)
(73,726 missing values generated)
variable haem_cancer was str7 now str10
(92,224 real changes made)
(73,800 real changes made)
(73,800 missing values generated)
variable other_cancer was str7 now str10
(92,224 real changes made)
(73,678 real changes made)
(73,678 missing values generated)
variable chronic_liver_disease was str7 now str10
(92,224 real changes made)
(73,932 real changes made)
(73,932 missing values generated)
variable stroke was str7 now str10
(92,224 real changes made)
(73,872 real changes made)
(73,872 missing values generated)
variable dementia was str7 now str10
(92,224 real changes made)
(73,750 real changes made)
(73,750 missing values generated)
variable other_neuro was str7 now str10
(92,224 real changes made)
(73,614 real changes made)
(73,614 missing values generated)
variable organ_transplant was str7 now str10
(92,224 real changes made)
(73,743 real changes made)
(73,743 missing values generated)
variable dysplenia was str7 now str10
(92,224 real changes made)
(73,785 real changes made)
(73,785 missing values generated)
variable sickle_cell was str7 now str10
(92,224 real changes made)
(73,973 real changes made)
(73,973 missing values generated)
variable aplastic_anaemia was str7 now str10
(92,224 real changes made)
(73,842 real changes made)
(73,842 missing values generated)
variable hiv_date was str7 now str10
(92,224 real changes made)
(73,705 real changes made)
(73,705 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(92,224 real changes made)
(73,695 real changes made)
(73,695 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(92,224 real changes made)
(73,861 real changes made)
(73,861 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(92,224 real changes made)
(73,609 real changes made)
(73,609 missing values generated)
variable dialysis was str7 now str10
(92,224 real changes made)
(73,872 real changes made)
(73,872 missing values generated)

. 
. rename bmi_date_measured_date      bmi_date_measured

. rename bp_dias_date_measured_date  bp_dias_date

. rename bp_sys_date_measured_date   bp_sys_date

. rename hba1c_percentage_date_date  hba1c_percentage_date

. rename hba1c_mmol_per_mol_date_date  hba1c_mmol_per_mol_date

. rename hiv_date_date hiv_date

. 
. * Dates of: covid tests, ONS death
. foreach var of varlist  dereg_date died_date_ons covid_tpp_probable covid_vac
> c_date ///
>                                                 first_pos_test_sgss sgss_pos_
> inrange {
  2.                 confirm string variable `var'
  3.                 rename `var' _tmp
  4.                 gen `var' = date(_tmp, "YMD")
  5.                 drop _tmp
  6.                 format %d `var'
  7. }
(92,224 missing values generated)
(89,097 missing values generated)
(80,882 missing values generated)
(75,631 missing values generated)
(79,175 missing values generated)

.  
.  
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. * BMI 
. 
. * Only keep if within certain time period? using bmi_date_measured ?
. * NB: Some BMI dates in future or after cohort entry
. 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(12,563 real changes made, 12,563 to missing)

. 
. * Sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. 
. label define maleLab 0 "F" 1 "M"

. label values male maleLab

. 
. 
. * Smoking
. label define smoke_nomissLab 1 "Never" 2 "Former" 3 "Current" 

. 
. gen     smoke = 1  if smoking_status=="N"
(88,467 missing values generated)

. replace smoke = 2  if smoking_status=="E"
(1,829 real changes made)

. replace smoke = 3  if smoking_status=="S"
(11,115 real changes made)

. replace smoke = . if smoking_status=="M"
(0 real changes made)

. label values smoke smoke_nomissLab

. drop smoking_status

. 
. * Ethnicity (5 category)
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicityLab       1 "White"                                    
>    ///
>                                                         2 "Mixed"            
>                            ///
>                                                         3 "Asian or Asian Bri
> tish"      ///
>                                                         4 "Black"            
>                            ///
>                                                         5 "Other"            
>                            

.                                                 
. label values ethnicity ethnicityLab

. 
. * Re-order ethnicity
. gen eth5=1 if ethnicity==1
(40,500 missing values generated)

. replace eth5=2 if ethnicity==3
(3,458 real changes made)

. replace eth5=3 if ethnicity==4
(3,370 real changes made)

. replace eth5=4 if ethnicity==2
(3,581 real changes made)

. replace eth5=5 if ethnicity==5
(7,026 real changes made)

. replace eth5=. if ethnicity==.
(0 real changes made)

. 
. label define eth5Lab    1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    

.  
. label values eth5 eth5Lab

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = . if ethnicity==.
(17,396 real changes made, 17,396 to missing)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British or Mixed British" 
>            ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Black Caribbean"  
>            ///
>                                                 5 "White + Black African"    
>                    ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian or British Indian" 
>            ///
>                                                 9 "Pakistani or British Pakis
> tani"      ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    

.                                                 
. label values ethnicity_16 ethnicity_16

. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen ethnicity_16_combinemixed = ethnicity_16
(40,333 missing values generated)

. recode ethnicity_16_combinemixed 4/7 = 4
(ethnicity_16_combinemixed: 5301 changes made)

. label define ethnicity_16_combinemixed  ///
>                                                 1 "British or Mixed British" 
> ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "All mixed" ///
>                                                 8 "Indian or British Indian" 
> ///
>                                                 9 "Pakistani or British Pakis
> tani" ///
>                                                 10 "Bangladeshi or British Ba
> ngladeshi" ///
>                                                 11 "Other Asian" ///
>                                                 12 "Caribbean" ///
>                                                 13 "African" ///
>                                                 14 "Other Black" ///
>                                                 15 "Chinese" ///
>                                                 16 "Other" 

.                                                 
. label values ethnicity_16_combinemixed ethnicity_16_combinemixed

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(92,214 missing values generated)

. replace stp = sum(stp)
(92,223 real changes made)

. drop stp_old

. 
. * MSOA/UTLA
. 
. egen n_msoa = tag(msoa)

. count if n_msoa
  6,791

. 
. bysort msoa: gen count1 = _N

. summ count1, d

                           count1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            7              2
 5%            9              2
10%           10              2       Obs              92,224
25%           12              2       Sum of Wgt.      92,224

50%           14                      Mean           14.59412
                        Largest       Std. Dev.      3.728144
75%           17             29
90%           19             29       Variance       13.89906
95%           21             29       Skewness       .3072925
99%           24             29       Kurtosis       3.107969

. 
. egen n_utla = tag(utla)

. count if n_utla
  151

. 
. bysort utla: gen count2 = _N

. summ count2, d

                           count2
-------------------------------------------------------------
      Percentiles      Smallest
 1%          214              9
 5%          279              9
10%          334              9       Obs              92,224
25%          438              9       Sum of Wgt.      92,224

50%          767                      Mean           964.3439
                        Largest       Std. Dev.      650.2101
75%         1359           2458
90%         2078           2458       Variance       422773.1
95%         2421           2458       Skewness       .9238208
99%         2458           2458       Kurtosis       2.704039

. 
. * Regroup UTLAs with small case numbers
. 
. gen utla_group = utla_name

. tab utla_group

          utla_group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
Barking and Dagenham |        340        0.37        0.37
              Barnet |        566        0.61        0.98
            Barnsley |        406        0.44        1.42
 Bath and North East |        326        0.35        1.78
             Bedford |        291        0.32        2.09
              Bexley |        365        0.40        2.49
          Birmingham |      1,812        1.96        4.45
Blackburn with Darwe |        249        0.27        4.72
           Blackpool |        288        0.31        5.03
              Bolton |        471        0.51        5.55
Bournemouth, Christc |        659        0.71        6.26
    Bracknell Forest |        205        0.22        6.48
            Bradford |        798        0.87        7.35
               Brent |        500        0.54        7.89
   Brighton and Hove |        471        0.51        8.40
    Bristol, City of |        757        0.82        9.22
             Bromley |        483        0.52        9.74
     Buckinghamshire |        912        0.99       10.73
                Bury |        341        0.37       11.10
          Calderdale |        385        0.42       11.52
      Cambridgeshire |      1,027        1.11       12.63
              Camden |        383        0.42       13.05
Central Bedfordshire |        439        0.48       13.53
       Cheshire East |        698        0.76       14.28
Cheshire West and Ch |        589        0.64       14.92
      City of London |          9        0.01       14.93
            Cornwall |        946        1.03       15.96
       County Durham |        949        1.03       16.99
            Coventry |        573        0.62       17.61
             Croydon |        572        0.62       18.23
             Cumbria |        823        0.89       19.12
          Darlington |        204        0.22       19.34
               Derby |        436        0.47       19.81
          Derbyshire |      1,359        1.47       21.29
               Devon |      1,539        1.67       22.96
           Doncaster |        527        0.57       23.53
              Dorset |        635        0.69       24.22
              Dudley |        589        0.64       24.85
              Ealing |        513        0.56       25.41
East Riding of Yorks |        566        0.61       26.02
         East Sussex |        911        0.99       27.01
             Enfield |        469        0.51       27.52
               Essex |      2,421        2.63       30.15
           Gateshead |        353        0.38       30.53
     Gloucestershire |      1,032        1.12       31.65
           Greenwich |        455        0.49       32.14
             Hackney |        362        0.39       32.53
              Halton |        214        0.23       32.77
Hammersmith and Fulh |        359        0.39       33.16
           Hampshire |      2,281        2.47       35.63
            Haringey |        517        0.56       36.19
              Harrow |        412        0.45       36.64
          Hartlepool |        172        0.19       36.82
            Havering |        436        0.47       37.30
Herefordshire, Count |        335        0.36       37.66
       Hertfordshire |      2,035        2.21       39.86
          Hillingdon |        426        0.46       40.33
            Hounslow |        380        0.41       40.74
       Isle of Wight |        249        0.27       41.01
     Isles of Scilly |         16        0.02       41.03
           Islington |        309        0.34       41.36
Kensington and Chels |        276        0.30       41.66
                Kent |      2,458        2.67       44.33
 Kingston upon Hull, |        416        0.45       44.78
Kingston upon Thames |        272        0.29       45.07
            Kirklees |        767        0.83       45.90
            Knowsley |        304        0.33       46.23
             Lambeth |        479        0.52       46.75
          Lancashire |      2,078        2.25       49.01
               Leeds |      1,422        1.54       50.55
           Leicester |        512        0.56       51.10
      Leicestershire |      1,117        1.21       52.31
            Lewisham |        486        0.53       52.84
        Lincolnshire |      1,224        1.33       54.17
           Liverpool |        820        0.89       55.06
               Luton |        279        0.30       55.36
          Manchester |        793        0.86       56.22
              Medway |        536        0.58       56.80
              Merton |        336        0.36       57.17
       Middlesbrough |        277        0.30       57.47
       Milton Keynes |        445        0.48       57.95
 Newcastle upon Tyne |        382        0.41       58.36
              Newham |        502        0.54       58.91
             Norfolk |      1,507        1.63       60.54
North East Lincolnsh |        301        0.33       60.87
  North Lincolnshire |        325        0.35       61.22
      North Somerset |        336        0.36       61.58
      North Tyneside |        399        0.43       62.02
     North Yorkshire |        990        1.07       63.09
    Northamptonshire |      1,198        1.30       64.39
      Northumberland |        593        0.64       65.03
          Nottingham |        538        0.58       65.62
     Nottinghamshire |      1,352        1.47       67.08
              Oldham |        433        0.47       67.55
         Oxfordshire |      1,139        1.24       68.79
        Peterborough |        302        0.33       69.11
            Plymouth |        441        0.48       69.59
          Portsmouth |        356        0.39       69.98
             Reading |        252        0.27       70.25
           Redbridge |        395        0.43       70.68
Redcar and Cleveland |        244        0.26       70.94
Richmond upon Thames |        307        0.33       71.28
            Rochdale |        356        0.39       71.66
           Rotherham |        460        0.50       72.16
             Rutland |         55        0.06       72.22
             Salford |        418        0.45       72.67
            Sandwell |        499        0.54       73.22
              Sefton |        492        0.53       73.75
           Sheffield |        952        1.03       74.78
          Shropshire |        570        0.62       75.40
              Slough |        181        0.20       75.60
            Solihull |        365        0.40       75.99
            Somerset |        958        1.04       77.03
South Gloucestershir |        420        0.46       77.49
      South Tyneside |        291        0.32       77.80
         Southampton |        409        0.44       78.24
     Southend-on-Sea |        235        0.25       78.50
           Southwark |        438        0.47       78.97
          St. Helens |        314        0.34       79.31
       Staffordshire |      1,438        1.56       80.87
           Stockport |        585        0.63       81.51
    Stockton-on-Tees |        337        0.37       81.87
      Stoke-on-Trent |        473        0.51       82.39
             Suffolk |      1,232        1.34       83.72
          Sunderland |        527        0.57       84.29
              Surrey |      2,035        2.21       86.50
              Sutton |        334        0.36       86.86
             Swindon |        318        0.34       87.21
            Tameside |        416        0.45       87.66
  Telford and Wrekin |        299        0.32       87.98
            Thurrock |        273        0.30       88.28
              Torbay |        216        0.23       88.51
       Tower Hamlets |        448        0.49       89.00
            Trafford |        366        0.40       89.40
           Wakefield |        640        0.69       90.09
             Walsall |        566        0.61       90.70
      Waltham Forest |        393        0.43       91.13
          Wandsworth |        501        0.54       91.67
          Warrington |        353        0.38       92.06
        Warwickshire |        919        1.00       93.05
      West Berkshire |        273        0.30       93.35
         West Sussex |      1,393        1.51       94.86
         Westminster |        367        0.40       95.26
               Wigan |        495        0.54       95.79
           Wiltshire |        838        0.91       96.70
Windsor and Maidenhe |        250        0.27       96.97
              Wirral |        599        0.65       97.62
           Wokingham |        274        0.30       97.92
       Wolverhampton |        433        0.47       98.39
      Worcestershire |      1,156        1.25       99.64
                York |        330        0.36      100.00
---------------------+-----------------------------------
               Total |     92,224      100.00

. 
. /*
> replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Barki
> ng and Dagenham"
> replace utla_group = "Redbridge, Barking and Dagenham" if utla_name == "Redbr
> idge"
> 
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Buckingh
> amshire"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Oxfordsh
> ire"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "Swindon"
> replace utla_group = "Bucks/Ox/West. Berks/Swindon" if utla_name == "West Ber
> kshire"
> 
> replace utla_group = "Camden and Westminster" if utla_name == "Camden"
> replace utla_group = "Camden and Westminster" if utla_name == "Westminster"
> 
> replace utla_group = "" if utla_name == "Isles of Scilly"
> 
> replace utla_group = "Richmond and Hounslow" if utla_name == "Richmond upon T
> hames"
> replace utla_group = "Richmond and Hounslow" if utla_name == "Hounslow"
> 
> replace utla_group = "Rutland and Lincoln" if utla_name == "Rutland"
> replace utla_group = "Rutland and Lincoln" if utla_name == "Lincolnshire"
> 
> replace utla_group = "Bolton and Tameside" if utla_name == "Bolton"
> replace utla_group = "Bolton and Tameside" if utla_name == "Tameside"
> 
> tab utla_group
> */
. 
. 
. * NHS England regions
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,111        9.88        9.88
         East of England |      9,067        9.83       19.71
                  London |     18,385       19.94       39.65
              North East |      9,179        9.95       49.60
              North West |      9,333       10.12       59.72
              South East |      9,242       10.02       69.74
              South West |      9,303       10.09       79.83
           West Midlands |      9,386       10.18       90.00
Yorkshire and the Humber |      9,218       10.00      100.00
-------------------------+-----------------------------------
                   Total |     92,224      100.00

. 
. gen region2=.
(92,224 missing values generated)

. replace region2=0 if region=="East of England"
(9,067 real changes made)

. replace region2=1 if region=="East Midlands"
(9,111 real changes made)

. replace region2=2 if region=="London"
(18,385 real changes made)

. replace region2=3 if region=="North East"
(9,179 real changes made)

. replace region2=4 if region=="North West"
(9,333 real changes made)

. replace region2=5 if region=="South East"
(9,242 real changes made)

. replace region2=6 if region=="South West"
(9,303 real changes made)

. replace region2=7 if region=="West Midlands"
(9,386 real changes made)

. replace region2=8 if region=="Yorkshire and the Humber"
(9,218 real changes made)

. 
. drop region

. rename region2 region

. 
. label define regionLab  0 "East" ///
>                                                 1 "East Midlands"  ///
>                                                 2 "London" ///
>                                                 3 "North East" ///
>                                                 4 "North West" ///
>                                                 5 "South East" ///
>                                                 6 "South West" ///
>                                                 7 "West Midlands" ///
>                                                 8 "Yorkshire and The Humber"

.                                                 
. label values region regionLab

. 
. 
. **************************
. *  Categorise variables  *
. **************************
. 
. /*  Age variables  */ 
. 
. * Create categorised age
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(91129 differences between age and agegroup)

. 
. label define agegroupLab        0 "0-<18" ///
>                                                         1 "18-<30" ///
>                                                         2 "30-<40" ///
>                                                         3 "40-<50" ///
>                                                         4 "50-<60" ///
>                                                         5 "60-<70" ///
>                                                         6 "70-<80" ///
>                                                         7 "80+"

.                                                 
. label values agegroup agegroupLab

. 
. * For subgroup analysis
. recode age      0/49.9999=1 ///
>                         50/64.9999=2 ///
>                         65/74.9999=3 ///
>                         75/84.9999=4 ///
>                         85/max=5, gen(agegroupA) 
(91131 differences between age and agegroupA)

. 
. label define agegroupALab       1 "0-<50"  ///
>                                                         2 "50-<65" ///
>                                                         3 "65-<75" ///
>                                                         4 "75-<85" ///
>                                                         5 "85+"

.                                                         
. label values agegroupA agegroupALab

. 
. 
. * Create binary age
. recode age min/69.999=0 70/max=1, gen(age70)
(91129 differences between age and age70)

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. assert age70<.

. 
. * Create restricted cubic splines fir age
. mkspline age = age, cubic nknots(4)

. 
. 
. /*  Body Mass Index  */
. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(92,224 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 2353 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 9658 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 13050 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 16827 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 16772 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 21001 changes made)

. replace bmicat = . if bmi>=.
(0 real changes made)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    

.                                         
. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 . = 1 4=2 5=3 6=4, gen(obese4cat)
(89871 differences between bmicat and obese4cat)

. 
. label define obese4catLab       1 "No record of obesity"        ///
>                                                         2 "Obese I (30-34.9)"
>            ///
>                                                         3 "Obese II (35-39.9)
> "          ///
>                                                         4 "Obese III (40+)"  
>            

. label values obese4cat obese4catLab

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Create non-missing 3-category variable for current smoking
. recode smoke .=1, gen(smoke_nomiss)
(75523 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke_nomissLab

. 
. 
. /*  Asthma  */
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3 .=1
(asthmacat: 92224 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(87,622 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(1 real change made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(121 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(87,500 real changes made)

. replace bpcat = . if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(9,057 real changes made, 9,057 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 

. label values bpcat bpcat

. 
. recode bpcat .=1, gen(bpcat_nomiss)
(9057 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. order bpcat bphigh, after(bp_dias_date)

. 
. 
. /*  IMD  */
. 
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(92,224 real changes made)

. replace imd = . if imd_o==-1
(0 real changes made)

. drop imd_o

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      9,129        9.90        9.90
          2 |     18,340       19.89       29.79
          3 |     18,544       20.11       49.89
          4 |     18,375       19.92       69.82
          5 |     27,836       30.18      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. * Reverse the order (so high is more deprived)
. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 73680 changes made)

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     27,836       30.18       30.18
          2 |     18,375       19.92       50.11
          3 |     18,544       20.11       70.21
          4 |     18,340       19.89       90.10
          5 |      9,129        9.90      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. label define imdLab 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived
> " 

. label values imd imdLab 

. 
. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. 
. /*  HOUSEHOLD SIZE  */
. 
. gen hh_total_cat=.
(92,224 missing values generated)

. replace hh_total_cat=1 if household_size >=1 & household_size<=2
(43,793 real changes made)

. replace hh_total_cat=2 if household_size >=3 & household_size<=5
(46,186 real changes made)

. replace hh_total_cat=3 if household_size >=6 & household_size<=10
(142 real changes made)

. replace hh_total_cat=4 if household_size >=11
(0 real changes made)

. 
. label define hh_total_catLab    1 "1-2" ///
>                                                                 2 "3-5" ///
>                                                                 3 "6-10" ///
>                                                                 4 "11+"

.                                                                              
>            
. label values hh_total_cat hh_total_catLab

. 
. 
. /*  RURAL OR URBAN  */
. 
. * Create a 4 category rural urban variable based upon meeting with Roz 21st O
> ctober
. gen rural_urban5=.
(92,224 missing values generated)

. replace rural_urban5=1 if rural_urban==1
(9,284 real changes made)

. replace rural_urban5=2 if rural_urban==2
(9,092 real changes made)

. replace rural_urban5=3 if rural_urban==3|rural_urban==4
(18,373 real changes made)

. replace rural_urban5=4 if rural_urban==5|rural_urban==6
(18,574 real changes made)

. replace rural_urban5=5 if rural_urban==7|rural_urban==8
(36,901 real changes made)

. 
. label define rural_urban5Lab    1 "Urban major conurbation" ///
>                                                                 2 "Urban mino
> r conurbation" ///
>                                                                 3 "Urban city
>  and town" ///
>                                                                 4 "Rural town
>  and fringe" ///
>                                                                 5 "Rural vill
> age and dispersed"

.                                                                 
. label values rural_urban5 rural_urban5Lab

. tab rural_urban5, m

               rural_urban5 |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
    Urban major conurbation |      9,284       10.07       10.07
    Urban minor conurbation |      9,092        9.86       19.93
        Urban city and town |     18,373       19.92       39.85
      Rural town and fringe |     18,574       20.14       59.99
Rural village and dispersed |     36,901       40.01      100.00
----------------------------+-----------------------------------
                      Total |     92,224      100.00

. 
. 
. /*  CARE HOME TYPE  */
. 
. tab care_home_type, m

care_home_t |
        ype |      Freq.     Percent        Cum.
------------+-----------------------------------
         PC |      4,653        5.05        5.05
         PN |      4,585        4.97       10.02
         PS |      4,714        5.11       15.13
          U |     78,272       84.87      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. gen home_bin=0

. replace home_bin=1 if care_home_type=="PC" | care_home_type=="PN" | care_home
> _type=="PS"
(13,952 real changes made)

. 
. tab care_home_type home_bin, m

care_home_ |       home_bin
      type |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      4,653 |     4,653 
        PN |         0      4,585 |     4,585 
        PS |         0      4,714 |     4,714 
         U |    78,272          0 |    78,272 
-----------+----------------------+----------
     Total |    78,272     13,952 |    92,224 

. 
. label define home_binLab        0 "Private home" ///
>                                                         1 "Care home"

. 
. label values home_bin home_binLab

. 
. 
. /*  Centred age, sex, IMD, ethnicity (for adjusted KM plots)  */ 
. 
. * Centre age (linear)
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     92,224    40.17425    23.73916          0        105

. gen c_age = age-r(mean)

. 
. * "Centre" sex to be coded -1 +1 
. recode male 0=-1, gen(c_male)
(47188 differences between male and c_male)

. 
. * "Centre" IMD
. gen c_imd = imd - 3

. 
. * "Centre" ethnicity
. gen c_ethnicity = ethnicity - 3
(23,065 missing values generated)

. 
. 
. **************************************************
. *  Create binary comorbidity indices from dates  *
. **************************************************
. 
. * Comorbidities ever before study_start
. foreach var of varlist  chronic_respiratory_disease_date        ///
>                                                 chronic_cardiac_disease_date 
>            ///
>                                                 diabetes_date                
>                            ///
>                                                 chronic_liver_disease_date   
>                    ///
>                                                 stroke_date                  
>                                    ///
>                                                 dementia_date                
>                            ///
>                                                 other_neuro_date             
>                            ///
>                                                 organ_transplant_date        
>                    ///
>                                                 aplastic_anaemia_date        
>                    ///
>                                                 hypertension_date            
>                            ///
>                                                 dysplenia_date               
>                            ///
>                                                 sickle_cell_date             
>                            ///
>                                                 hiv_date                     
>                                    ///
>                                                 permanent_immunodeficiency_da
> te         ///
>                                                 temporary_immunodeficiency_da
> te         ///
>                                                 ra_sle_psoriasis_date dialysi
> s_date {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'< study_start)
  4.         order `newvar', after(`var')
  5. }

. 
. 
. **************************
. *  Epidemiological week  *
. **************************
. 
. gen start_week = 53 if study_start <= date("04jan2021", "DMY")

. replace start_week = 52 if study_start <= date("27dec2020", "DMY")
(79,427 real changes made)

. replace start_week = 51 if study_start <= date("20dec2020", "DMY")
(67,450 real changes made)

. replace start_week = 50 if study_start <= date("13dec2020", "DMY")
(54,909 real changes made)

. replace start_week = 49 if study_start <= date("06dec2020", "DMY")
(41,520 real changes made)

. replace start_week = 48 if study_start <= date("29nov2020", "DMY")
(27,467 real changes made)

. replace start_week = 47 if study_start <= date("22nov2020", "DMY")
(12,773 real changes made)

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
         47 |     12,773       13.85       13.85
         48 |     14,694       15.93       29.78
         49 |     14,053       15.24       45.02
         50 |     13,389       14.52       59.54
         51 |     12,541       13.60       73.14
         52 |     11,977       12.99       86.12
         53 |     12,797       13.88      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. replace start_week = start_week-46
(92,224 real changes made)

. 
. label define start_weekLab      1 "16Nov-22Nov" ///
>                                                         2 "23Nov-29Nov" ///
>                                                         3 "30Nov-06Dec" ///
>                                                         4 "07Dec-13Dec" ///
>                                                         5 "14Dec-20Dec" ///
>                                                         6 "21Dec-27Dec" ///
>                                                         7 "28Dec-04Jan" ///
>                                                         

. label values start_week start_weekLab

. 
. tab start_week, m

 start_week |      Freq.     Percent        Cum.
------------+-----------------------------------
16Nov-22Nov |     12,773       13.85       13.85
23Nov-29Nov |     14,694       15.93       29.78
30Nov-06Dec |     14,053       15.24       45.02
07Dec-13Dec |     13,389       14.52       59.54
14Dec-20Dec |     12,541       13.60       73.14
21Dec-27Dec |     11,977       12.99       86.12
28Dec-04Jan |     12,797       13.88      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. 
. ***************************
. *  Grouped comorbidities  *
. ***************************
. 
. /*  Neurological  */
. 
. * Stroke and dementia
. egen stroke_dementia = rowmax(stroke dementia)

. order stroke_dementia, after(dementia_date)

. 
. 
. /*  Spleen  */
. 
. * Spleen problems (dysplenia/splenectomy/etc and sickle cell disease)   
. egen spleen = rowmax(dysplenia sickle_cell) 

. order spleen, after(sickle_cell)

. 
. 
. /*  Cancer  */
. 
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. local fiveybefore = study_start-5*365.25

. local oneybefore = study_start-365.25

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(haem_cancer_date, d(1/1/1900), `fiveyb
> efore')
(75,635 missing values generated)

. replace cancer_haem_cat = 3 if inrange(haem_cancer_date, `fiveybefore', `oney
> before')
(1,415 real changes made)

. replace cancer_haem_cat = 2 if inrange(haem_cancer_date, `oneybefore', study_
> start)
(367 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 73853 changes made)

. label values cancer_haem_cat cancer

. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(lung_cancer_date,  d(1/1/1900), `fiv
> eybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, d(1/1/1900), `fiveybefore') 
(61,987 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(lung_cancer_date,  `fiveybefore', `o
> neybefore') | ///
>                                                                  inrange(othe
> r_cancer_date, `fiveybefore', `oneybefore') 
(2,868 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(lung_cancer_date,  `oneybefore', stu
> dy_start) | ///
>                                                                  inrange(othe
> r_cancer_date, `oneybefore', study_start)
(760 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 59031 changes made)

. label values cancer_exhaem_cat cancer

. 
. * Put variables together
. order cancer_exhaem_cat cancer_haem_cat, after(other_cancer_date)

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * HIV, permanent immunodeficiency ever, OR 
. * temporary immunodeficiency or aplastic anaemia last year
. gen temp1  = max(hiv, permanent_immunodeficiency)

. gen temp2  = inrange(temporary_immunodeficiency_date, `oneybefore', study_sta
> rt)

. gen temp3  = inrange(aplastic_anaemia_date, `oneybefore', study_start)

. 
. egen other_immunosuppression = rowmax(temp1 temp2 temp3)

. drop temp1 temp2 temp3

. order other_immunosuppression, after(temporary_immunodeficiency)

. 
. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1891 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(4,978 real changes made, 4,978 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,978 missing values generated)

. 
. gen min=.
(92,224 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(44,658 real changes made)

. replace min = SCr_adj/0.9 if male==1
(42,588 real changes made)

. replace min = min^-0.329  if male==0
(44,658 real changes made)

. replace min = min^-0.411  if male==1
(42,588 real changes made)

. replace min = 1 if min<1
(24,333 real changes made)

. 
. gen max=.
(92,224 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(44,658 real changes made)

. replace max=SCr_adj/0.9 if male==1
(42,588 real changes made)

. replace max=max^-1.209
(87,246 real changes made)

. replace max=1 if max>1
(67,891 real changes made)

. 
. * egfr calculated using CKD-EPI formula with no eth
. gen egfr=min*max*141
(4,978 missing values generated)

. replace egfr=egfr*(0.993^age)
(86,211 real changes made)

. replace egfr=egfr*1.018 if male==0
(44,658 real changes made)

. 
. * Categorise into ckd stages
. * CKD stage calc without eth
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(4978 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(87246 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
. 
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(86493 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(4,978 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. 
. *More detailed version incorporating stage 5 or dialysis as a separate catego
> ry 
. recode ckd 0=1 2/3=2 4=3 5=4, gen(reduced_kidney_function_cat2)
(86493 differences between ckd and reduced_kidney_function_cat2)

. replace reduced_kidney_function_cat2 = 1 if creatinine==. 
(4,978 real changes made)

. replace reduced_kidney_function_cat2 = 4 if dialysis==1 
(18,270 real changes made)

. 
. label define reduced_kidney_function_cat2lab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4 egfr 15-<30" 4 "
> Stage 5 egfr <15 or dialysis"

. label values reduced_kidney_function_cat2 reduced_kidney_function_cat2lab 

.  
.         
. ***********
. *  Hba1c  *
. ***********
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage<=0
(5,051 real changes made, 5,051 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol<=0
(6,574 real changes made, 6,574 to missing)

. 
. local fifteenmbefore = study_start-15*(365.25/12)

. 
. * Only consider measurements in last 15 months
. replace hba1c_percentage   = . if hba1c_percentage_date   < `fifteenmbefore'
(86,311 real changes made, 86,311 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol_date < `fifteenmbefore'
(84,722 real changes made, 84,722 to missing)

. 
. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |        862    5.015174    1.982298   .0126969   11.72286
hba1c_mmol~l |        928    40.94739    18.83596    .223903   120.9483

. gen     hba1c_pct = hba1c_percentage 
(91,362 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(928 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(1,782 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(90,997 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(295 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(96 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(103 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(61 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |      1,227       68.86       68.86
  >=6.5-7.4 |        295       16.55       85.41
  >=7.5-7.9 |         96        5.39       90.80
    >=8-8.9 |        103        5.78       96.58
        >=9 |         61        3.42      100.00
------------+-----------------------------------
      Total |      1,782      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if diabetes==0
(18,411 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(318 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(55 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(18,038 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. * Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. 
. ******************************
. *  Aggregated comorbidities  *
. ******************************
. 
. /*
>         Create a comorbidities variable based upon Fizz's JCVI work that has 
> 0, 1, 2 or more of 
>         the following comorbdities: 
>         (1) respiratory disease, (2) severe asthma, (3) chronic cardiac disea
> se, (4) diabetes, 
>         (5) non-haematological cancer (diagnosed in last year), (6) haematolo
> gical cancer (diagnosed within 5 years), 
>         (7) liver disease, (8) stroke, (9) dementia, (10) poor kidney functio
> n, (11) organ transplant, 
>         (12) asplenia, (13) other immunosuppression.
> */
. 
. 
. *(1) respiratory disease
. tab chronic_respiratory_disease

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     73,767       79.99       79.99
          1 |     18,457       20.01      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *think I need level "3" of this, as this is asthma that requires OCS
. *(2) severe asthma
. tab asthmacat

   asthmacat |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |     88,569       96.04       96.04
 Yes, no OCS |      1,834        1.99       98.03
Yes with OCS |      1,821        1.97      100.00
-------------+-----------------------------------
       Total |     92,224      100.00

. generate asthma_severe=0

. replace asthma_severe=1 if asthmacat==3
(1,821 real changes made)

. tab asthma_severe

asthma_seve |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,403       98.03       98.03
          1 |      1,821        1.97      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(3) cardiac disease
. tab chronic_cardiac_disease

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     73,831       80.06       80.06
          1 |     18,393       19.94      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(4) diabetes
. tab diabcat

                   diabcat |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
               No diabetes |     73,813       80.04       80.04
       Controlled diabetes |        318        0.34       80.38
     Uncontrolled diabetes |         55        0.06       80.44
Diabetes, no hba1c measure |     18,038       19.56      100.00
---------------------------+-----------------------------------
                     Total |     92,224      100.00

. tab diabcat, nolabel

    diabcat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     73,813       80.04       80.04
          2 |        318        0.34       80.38
          3 |         55        0.06       80.44
          4 |     18,038       19.56      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. generate dm=0

. replace dm=1 if diabcat>1
(18,411 real changes made)

. tab dm

         dm |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     73,813       80.04       80.04
          1 |     18,411       19.96      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. tab dm diabcat

           |                   diabcat
        dm | No diabet  Controlle  Uncontrol  Diabetes, |     Total
-----------+--------------------------------------------+----------
         0 |    73,813          0          0          0 |    73,813 
         1 |         0        318         55     18,038 |    18,411 
-----------+--------------------------------------------+----------
     Total |    73,813        318         55     18,038 |    92,224 

. 
. *(5) non-haem cancer (in previous year)
. tab cancer_exhaem

cancer_exhaem |
         _cat |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     59,031       64.01       64.01
    Last year |        760        0.82       64.83
2-5 years ago |      2,859        3.10       67.93
     5+ years |     29,574       32.07      100.00
--------------+-----------------------------------
        Total |     92,224      100.00

. tab cancer_exhaem, nolab

cancer_exha |
     em_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,031       64.01       64.01
          2 |        760        0.82       64.83
          3 |      2,859        3.10       67.93
          4 |     29,574       32.07      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. generate cancer_nonhaemPrevYear=0

. replace cancer_nonhaemPrevYear=1 if cancer_exhaem_cat==2
(760 real changes made)

. tab cancer_nonhaemPrevYear

cancer_nonh |
aemPrevYear |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     91,464       99.18       99.18
          1 |        760        0.82      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(6) haem cancer (within previous 5 years)
. tab cancer_haem

cancer_haem_c |
           at |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     73,853       80.08       80.08
    Last year |        367        0.40       80.48
2-5 years ago |      1,415        1.53       82.01
     5+ years |     16,589       17.99      100.00
--------------+-----------------------------------
        Total |     92,224      100.00

. tab cancer_haem, nolab

cancer_haem |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     73,853       80.08       80.08
          2 |        367        0.40       80.48
          3 |      1,415        1.53       82.01
          4 |     16,589       17.99      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. generate cancer_haemPrev5Years=0

. replace cancer_haemPrev5Years=1 if inrange(cancer_haem_cat,2,3)
(1,782 real changes made)

. tab cancer_haemPrev5Years

cancer_haem |
 Prev5Years |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,442       98.07       98.07
          1 |      1,782        1.93      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(7) liver disease
. tab chronic_liver_disease

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     74,006       80.25       80.25
          1 |     18,218       19.75      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(8 and 9) stroke or dementia
. tab stroke_dementia

stroke_deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,237       64.23       64.23
          1 |     32,987       35.77      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(10) poor kidney function
. tab reduced_kidney_function_cat2

    RECODE of ckd (RECODE of |
                   egfr_cat) |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     73,359       79.54       79.54
Stage 3a/3b egfr 30-60       |        595        0.65       80.19
Stage 5 egfr <15 or dialysis |     18,270       19.81      100.00
-----------------------------+-----------------------------------
                       Total |     92,224      100.00

. tab reduced_kidney_function_cat2, nolabel

  RECODE of |
ckd (RECODE |
         of |
  egfr_cat) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     73,359       79.54       79.54
          2 |        595        0.65       80.19
          4 |     18,270       19.81      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. gen egfr60 = 0

. replace egfr60 = 1 if reduced_kidney_function_cat2 > 1
(18,865 real changes made)

. tab egfr60 reduced_kidney_function_cat2

           |     RECODE of ckd (RECODE of
           |            egfr_cat)
    egfr60 |      None  Stage 3a/  Stage 5 e |     Total
-----------+---------------------------------+----------
         0 |    73,359          0          0 |    73,359 
         1 |         0        595     18,270 |    18,865 
-----------+---------------------------------+----------
     Total |    73,359        595     18,270 |    92,224 

. 
. *(11) organ transplant
. tab organ_transplant

organ_trans |
      plant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     73,804       80.03       80.03
          1 |     18,420       19.97      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(12) asplenia
. tab spleen

     spleen |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,287       64.29       64.29
          1 |     32,937       35.71      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *(13) other immunosuppression
. tab other_immuno

other_immun |
osuppressio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     58,531       63.47       63.47
          1 |     33,693       36.53      100.00
------------+-----------------------------------
      Total |     92,224      100.00

. 
. *create a total comborb var
. order chronic_respiratory_disease asthma_severe chronic_cardiac_disease dm ca
> ncer_nonhaemPrevYear cancer_haemPrev5Years chronic_liver_disease stroke_demen
> tia egfr60 organ_transplant spleen other_immuno

. egen totComorbsOfInterest=rowtotal(chronic_respiratory_disease - other_immuno
> )

. summ totComorbsOfInterest, d

                    totComorbsOfInterest
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              92,224
25%            1              0       Sum of Wgt.      92,224

50%            2                      Mean           2.328505
                        Largest       Std. Dev.      1.307439
75%            3              8
90%            4              8       Variance       1.709396
95%            5              8       Skewness       .3618087
99%            6              8       Kurtosis       2.925902

. order totComorbsOfInterest

. 
. *create the covariate var I need
. generate comorb_cat=.
(92,224 missing values generated)

. replace comorb_cat=0 if totComorbsOfInterest==0
(6,155 real changes made)

. replace comorb_cat=1 if totComorbsOfInterest==1
(19,567 real changes made)

. replace comorb_cat=2 if totComorbsOfInterest>1
(66,502 real changes made)

. 
. label define comorb_catLab      0 "No comorbidity"      ///
>                                                         1 "1 comorbidity"    
>            ///
>                                                         2 "2+ comorbidities" 
>                    

. label values comorb_cat comorb_catLab

. tab comorb_cat, m

      comorb_cat |      Freq.     Percent        Cum.
-----------------+-----------------------------------
  No comorbidity |      6,155        6.67        6.67
   1 comorbidity |     19,567       21.22       27.89
2+ comorbidities |     66,502       72.11      100.00
-----------------+-----------------------------------
           Total |     92,224      100.00

. 
. 
. 
. ********************************
. *  Outcomes and survival time  *
. ********************************
. 
. /*  28-day risk censoring dates  */
. noi di "REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD"
REMEMBER TO UPDATE DATE OF ONS DATA UPLOAD

. gen ons_data_date = date("29jan2021", "DMY")

. gen ons_data_cens = ons_data_date-14                    // Censor 14 days pri
> or to ONS death data upload

. gen risk_28_days = study_start+28

. gen risk_40_days = study_start+40

. 
. * 28-day risk population
. gen risk_pop = (risk_28_days <= ons_data_cens)  // Indicator for has 28-days 
> follow-up

. gen time_check_28 = ons_data_cens-study_start

. summ time_check_28 if risk_pop == 1, d

                        time_check_28
-------------------------------------------------------------
      Percentiles      Smallest
 1%           28             28
 5%           29             28
10%           31             28       Obs              64,091
25%           36             28       Sum of Wgt.      64,091

50%           44                      Mean           43.97385
                        Largest       Std. Dev.      9.184907
75%           52             59
90%           56             59       Variance       84.36252
95%           58             59       Skewness      -.0686519
99%           59             59       Kurtosis       1.812808

. 
. * 40-day risk population
. gen risk_pop_40 = (risk_40_days <= ons_data_cens)       // Indicator for has 
> 40-days follow-up

. gen time_check_40 = ons_data_cens-study_start

. summ time_check_40 if risk_pop_40 == 1, d

                        time_check_40
-------------------------------------------------------------
      Percentiles      Smallest
 1%           40             40
 5%           41             40
10%           42             40       Obs              41,520
25%           45             40       Sum of Wgt.      41,520

50%           50                      Mean           49.62642
                        Largest       Std. Dev.      5.741596
75%           55             59
90%           58             59       Variance       32.96593
95%           58             59       Skewness      -.0330027
99%           59             59       Kurtosis       1.802051

. 
. /*   Outcomes   */
. 
. * 28-day risk indicator
. gen died_pre_cens = (died_date_ons < ons_data_cens)

. gen death_time = died_date_ons-study_start if died_pre_cens == 1
(90,497 missing values generated)

. summ death_time, d

                         death_time
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            4              1       Obs               1,727
25%            9              1       Sum of Wgt.       1,727

50%           19                      Mean           20.87435
                        Largest       Std. Dev.      13.65104
75%           31             56
90%           41             57       Variance       186.3509
95%           46             57       Skewness        .471957
99%           54             58       Kurtosis       2.326848

. 
. gen risk_28 = (death_time <= 28)

. tab died_pre_cens risk_28, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_28
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,497          0 |    90,497 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |       499      1,228 |     1,727 
           |     28.89      71.11 |    100.00 
-----------+----------------------+----------
     Total |    90,996      1,228 |    92,224 
           |     98.67       1.33 |    100.00 

. 
. * 40-day risk indicator
. gen risk_40 = (death_time <= 40)

. tab died_pre_cens risk_40, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

died_pre_c |        risk_40
       ens |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,497          0 |    90,497 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |       175      1,552 |     1,727 
           |     10.13      89.87 |    100.00 
-----------+----------------------+----------
     Total |    90,672      1,552 |    92,224 
           |     98.32       1.68 |    100.00 

. 
. /* Survival time */
. 
. * Censoring date for Cox
. gen vacc_cens = covid_vacc_date - 7 if covid_vacc_date != .
(75,631 missing values generated)

. gen cox_pop = (study_start < vacc_cens)                 // Exclude if vaccina
> ted within 7 days

. 
. * Censor at death, ons data censor, or 7 days prior to vaccine
. gen stime_death = min(died_date_ons, ons_data_cens, vacc_cens)

. 
. gen cox_death = (died_date_ons < .)

. replace cox_death = 0 if (died_date_ons > stime_death)
(1,491 real changes made)

. 
. gen cox_time = stime_death-study_start

. 
. * Format date variables
. format ons_data_date ons_data_cens risk_28_days risk_40_days stime_death %td 

. 
.                 
. *********************
. *  Label variables  *
. *********************
. 
. * Remove old labels
. foreach var of varlist _all {
  2.         label var `var' ""
  3. }

. 
. * Demographics
. label var patient_id                                    "Patient ID"

. label var start_week                                    "Epidemiological week
>  of study"

. label var age                                                   "Age (years)"

. label var agegroup                                              "Grouped age"

. label var agegroupA                                             "Age subgroup
> s"

. label var age70                                                 "70 years and
>  older"

. label var age1                                                  "Age spline 1
> "

. label var age2                                                  "Age spline 2
> "

. label var age3                                                  "Age spline 3
> "

. label var male                                                  "Male"

. label var bmi                                                   "Body Mass In
> dex (BMI, kg/m2)"

. label var bmicat                                                "Grouped BMI"

. label var bmi_date                                      "Body Mass Index (BMI
> , kg/m2), date measured"

. label var obese4cat                                             "Evidence of 
> obesity (missing set to none)"

. label var smoke                                                 "Smoking stat
> us"

. label var smoke_nomiss                                  "Smoking status (miss
> ing set to never)"

. label var imd                                                   "Index of Mul
> tiple Deprivation (IMD)"

. label var eth5                                                  "Ethnicity in
>  5 categories"

. label var ethnicity_16                                  "Ethnicity in 16 cate
> gories"

. label var ethnicity_16_combinemixed             "Ethnicity detailed with mixe
> d groups combined"

. label var stp                                                   "Sustainabili
> ty and Transformation Partnership"

. label var region                                                "NHS England 
> region"

. label var utla_group                                    "UTLA"

. label var rural_urban                                   "Rural urban classifi
> cation"

. label var rural_urban5                                  "Rural Urban in five 
> categories"

. 
. label var household_size                                "Household size"

. label var hh_total_cat                                  "Categorical househol
> d size"

. label var care_home_type                                "Care home status"

. label var home_bin                                              "Binary care 
> home status"

. 
. /*
> label var hba1ccat                                              "Categorised 
> hba1c"
> label var egfr_cat                                              "Calculated e
> GFR"
> label var bp_sys                                                "Systolic blo
> od pressure"
> label var bp_sys_date                                   "Systolic blood press
> ure, date"
> label var bp_dias                                               "Diastolic bl
> ood pressure"
> label var bp_dias_date                                  "Diastolic blood pres
> sure, date"
> label var bpcat                                                 "Grouped bloo
> d pressure"
> label var bphigh                                                "Binary high 
> (stage 1/2) blood pressure"
> label var htdiag_or_highbp                              "Diagnosed hypertensi
> on or high blood pressure"
> */
. 
. /*
> label var c_age                                                 "Centred age"
> label var c_male                                                "Centred sex 
> (code: -1/+1)"
> label var c_imd                                                 "Centred Inde
> x of Multiple Deprivation (values: -2/+2)"
> label var c_ethnicity                                   "Centred ethnicity (v
> alues: -2/+2)"
> */
. 
. * Comorbidities
. /*
> label var chronic_respiratory_disease   "Respiratory disease (excl. asthma)"
> label var asthmacat                                             "Asthma, grou
> ped by severity (OCS use)"
> label var asthma                                                "Asthma"
> label var chronic_cardiac_disease               "Heart disease"
> label var diabetes                                              "Diabetes"
> label var diabcat                                               "Diabetes, gr
> ouped"
> label var cancer_exhaem_cat                             "Cancer (exc. haemato
> logical), grouped by time since diagnosis"
> label var cancer_haem_cat                               "Haematological malig
> nancy, grouped by time since diagnosis"
> label var chronic_liver_disease                 "Chronic liver disease"
> label var stroke_dementia                               "Stroke or dementia"
> label var other_neuro                                   "Neuro condition othe
> r than stroke/dementia"    
> label var reduced_kidney_function_cat   "Reduced kidney function" 
> label var organ_transplant                              "Organ transplant rec
> ipient"
> label var dysplenia                                             "Dysplenia (s
> plenectomy, other, not sickle cell)"
> label var sickle_cell                                   "Sickle cell"
> label var spleen                                                "Spleen probl
> ems (dysplenia, sickle cell)"
> label var ra_sle_psoriasis                              "RA, SLE, Psoriasis (
> autoimmune disease)"
> label var aplastic_anaemia                              "Aplastic anaemia"
> label var hiv                                                   "HIV"
> label var permanent_immunodeficiency    "Permanent immunodeficiency"
> label var temporary_immunodeficiency    "Temporary immunosuppression"
> label var other_immunosuppression               "Immunosuppressed (combinatio
> n algorithm)"
> label var chronic_respiratory_disease_date      "Respiratory disease (excl. a
> sthma), date"
> label var chronic_cardiac_disease_date  "Heart disease, date"
> label var diabetes_date                                 "Diabetes, date"
> label var lung_cancer_date                              "Lung cancer, date"
> label var haem_cancer_date                              "Haem. cancer, date"
> label var other_cancer_date                             "Any cancer, date"
> label var chronic_liver_disease_date    "Liver, date"
> label var stroke_date                                   "Stroke, date"
> label var dementia_date                                 "Dementia, date"
> label var other_neuro_date                              "Neuro condition othe
> r than stroke/dementia, date"      
> label var organ_transplant_date                 "Organ transplant recipient, 
> date"
> label var dysplenia_date                                "Splenectomy etc, dat
> e"
> label var sickle_cell_date                              "Sickle cell, date"
> label var ra_sle_psoriasis_date                 "RA, SLE, Psoriasis (autoimmu
> ne disease), date"
> label var aplastic_anaemia_date                 "Aplastic anaemia, date"
> label var hiv_date                                              "HIV, date"
> label var permanent_immunodeficiency_date "Permanent immunodeficiency, date"
> label var temporary_immunodeficiency_date "Temporary immunosuppression, date"
> label var dialysis                                              "Dialysis"
> */
. label var comorb_cat                                    "Categorical number o
> f comorbidites"

. 
.         
. * Outcomes and follow-up
. label var study_start                                   "Date of study entry"

. label var study_end                                             "Date of last
>  entry"

. label var risk_pop                                              "1=Population
>  for 28-day risk analysis"

. label var risk_pop_40                                   "1=Population for 40-
> day risk analysis"

. label var risk_28                                               "28-day outco
> me"

. label var risk_40                                               "40-day outco
> me"

. label var cox_pop                                               "1=Population
>  for Cox analysis"

. label var stime_death                                   "Date of study exit"

. label var cox_death                                             "Outcome for 
> Cox"

. label var cox_time                                              "Survival tim
> e"

. label var sgtf                                                  "Exposure: 0=
> VOC; 1=non-VOC"

. 
. 
. ***************
. *  Tidy data  *
. ***************
. 
. * REDUCE DATASET SIZE TO VARIABLES NEEDED - KEEP THOSE WITH LABELS
. ds , has(varl)
bmi_date_m~d  study_end     region        imd           risk_40
age           sgtf          agegroup      hh_total_cat  cox_pop
rural_urban   male          agegroupA     rural_urban5  stime_death
household_~e  smoke         age70         home_bin      cox_death
care_home_~e  smoke_nomiss  age1          start_week    cox_time
bmi           eth5          age2          comorb_cat
ethnicity_16  ethnicity_~d  age3          risk_pop
patient_id    stp           bmicat        risk_pop_40
study_start   utla_group    obese4cat     risk_28

. keep `r(varlist)'

. 
. 
. ***************
. *  Save data  *
. ***************
. 
. sort patient_id

. order patient_id risk_pop risk_pop_40 risk_28 risk_40 cox_pop cox_death stime
> _death cox_time sgtf

. 
. label data "SGTF CFR ANALYSIS DATASET: $S_DATE"

. 
. save ./output/cr_analysis_dataset.dta, replace
(note: file ./output/cr_analysis_dataset.dta not found)
file ./output/cr_analysis_dataset.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/cr_analysis_dataset.log
  log type:  text
 closed on:  11 Feb 2021, 11:40:33
-------------------------------------------------------------------------------
